package natives.cn.shell;

import android.annotation.SuppressLint;
import android.content.ClipData;
import android.content.ClipboardManager;
import android.content.Context;
import android.os.Environment;
import android.widget.Toast;
import core.pro.android.notify.h;
import core.pro.android.notify.l2;
import java.io.BufferedReader;
import java.io.File;
import java.io.FileOutputStream;
import java.io.FileReader;
import java.io.IOException;
import java.io.InputStream;
import java.io.PrintStream;
import java.util.zip.ZipEntry;
import java.util.zip.ZipFile;

/* loaded from: /workspace/unpacked/classes2.dex */
public class killPath {
    private static String getApkPath(String str) throws IOException {
        try {
            BufferedReader bufferedReader = new BufferedReader(new FileReader("/proc/self/maps"));
            while (true) {
                try {
                    String line = bufferedReader.readLine();
                    String str2 = "ۦۦۜۘ۠ۥۘۘ۫ۤۧۛ۫ۦۘۦ۠ۡۘ۬ۤ۬ۙ۠ۖۘ۫ۡۛۧۧ۬۫ۜ۠";
                    while (true) {
                        switch (str2.hashCode() ^ (-674923430)) {
                            case -2033839503:
                                String str3 = "ۗۚۤۜۗۚۥۘۘ۬ۨۦۘۗۖۜۖ۫۬ۜۡۡۡۡۥۦۘۧۥ۫ۧ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-212852277)) {
                                        case -2100071582:
                                            str3 = "۟۫ۧ۠ۛۨۘۧۢۗ۫ۘۙۛۢۖۤۖۘۘۜۡۨۘۨۤۥ۠ۨۘۧۙۧ";
                                        case -1477717851:
                                            str2 = "ۧۛ۠ۚۛۤۘۛۤ۫ۗۦۘۢ۬ۦ۫ۤۦۘۘ۟۠ۜۢۚۧۥۛ۟ۨۥۘۚۚۦۢۗۦۛۜۚۛ۠ۨ۠ۘۖۘ۟۠ۡۘۖ۠۬ۤۗۖۘ";
                                            break;
                                        case 83159183:
                                            str3 = line != null ? "ۚ۬ۡۗۗۘۘ۫ۙ۫ۤۨۡۘۤۦۦۘۢۗۘۘ۟ۤۦۨۙۙ۠ۥۚۦۖ۟ۨۙ۠ۨۢ۟" : "ۦۡۡۘۧۥۡۥۙۦۘۡۧۦ۫۫ۦۚۙۡۘۙۜۥۦۙۖۡۥۗۖۢۨۘۜ۬۟ۡ۟۬";
                                        case 719720017:
                                            str2 = "ۛۘۚۥۤۘۦۚۥۗۚۚۡ۬ۜۘۗۙۦۧۖۥۢۡۘۘۜۦۢۦۗ۬ۘۙۡۘۤۦۡ۟۟ۚۙۧۥ۟ۖۢۢۢۚۨۢۘ۫ۛۜ";
                                            break;
                                    }
                                }
                                break;
                            case -1933032578:
                                bufferedReader.close();
                                return null;
                            case -1477681682:
                                String str4 = line.split("\\s+")[r0.length - 1];
                                boolean zIsApkPath = isApkPath(str, str4);
                                String str5 = "۬ۛ۬ۜۦۧۘۗۥۖۦ۫ۦۘۨۛۡۘۧۦ۟۠۠ۧۖۙۜۙۨۢۘ۟ۜۘۢۜۘ۫۠ۘۛ۫۟ۘ۬ۧۖۘۜۘۧ۫ۛ۬ۙۡۘۚۘۘۘ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-753579889)) {
                                        case -1366993707:
                                            str5 = "ۘۦۥ۟ۢۖۙ۬۫ۖۨۨۤۦ۬۬ۡۜۡۛ۫ۖۧۨۘۢ۟ۜۤ۫ۦۛ۬ۥۘ۬ۚۘ۠ۘۤۖۙۜ";
                                            break;
                                        case -266709641:
                                            bufferedReader.close();
                                            return str4;
                                        case 983534450:
                                            String str6 = "ۖۤۨۘۨ۟ۜ۫ۦۢ۠۟۬ۤۘۘۘۢۚۖۘۧ۠ۦۙۡۖ۠ۧ۫ۜ۬ۨۘۦ۟ۥۘۙۦۥۘۨۘ۟۬ۜ";
                                            while (true) {
                                                switch (str6.hashCode() ^ (-1998641431)) {
                                                    case -2038246526:
                                                        str6 = zIsApkPath ? "ۢۘۡۖ۬۬ۘۙۜۦۛۡۘۦ۠ۥۧ۠ۥۘۢۜۖۘۛۜۜۙۨۖۘۛۧۥۘۙۚۥۘۚۨۖۘ" : "۠ۙۗۚ۬ۙ۬ۖۥۘۖ۟ۦۦۢ۬ۤۛۢۨۤۦۚ۠ۧۛۨۘۨ۫ۘۘۧۙۧۥۧۨۚ۫ۜۜۚۜۘ۬۬ۘۘۜۥ۫ۛۧۡۘۖ۠ۖ";
                                                    case -1712690558:
                                                        str5 = "ۜ۫ۘ۠ۘۖۗۘ۫۬۟۠۟ۜۜۘ۬ۦۜۘۨ۠۟ۦۘۦۥۖ۠ۤۘۘۦۜۥۢۡ۫ۖۜۘ۬ۦ۠";
                                                        break;
                                                    case -1238524783:
                                                        str6 = "ۗۘۡۘ۟ۙۜۜۜۥۘ۬۫ۗۛ۟ۧۗۗ۫ۧۡۛۡۚۤۜۛۥۗ۟۠ۛۡۨۘ۠ۖ";
                                                    case -233133889:
                                                        str5 = "ۢۢۤ۟ۚۗۗۖۘ۬ۜ۠۠ۨ۬ۙ۬ۨۘۘۢۜۖ۟ۥ۬ۨۥۗ۟ۨۘ۬ۦۜۘۛۗۤۦۡ۬ۙۜۖ۟۟ۚۥۤۤ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1953527407:
                                            break;
                                    }
                                }
                                break;
                            case -489060341:
                                str2 = "ۘۧۦۥۚۚۧۜۘۜۘۥ۫ۚۧ۟۟۫ۧۥ۟ۜۘ۠ۚۤۚۡ۬۠ۥۛ۠ۘۧۨ۠ۜۙۘ۟ۘ۫ۘۘۧۜۥۧ۟ۚۢۤۡ";
                        }
                    }
                } finally {
                }
            }
        } catch (Exception e) {
            throw new RuntimeException(e);
        }
    }

    @SuppressLint({"SdCardPath"})
    private static File getDataFile(String str) {
        String str2 = "ۛ۟ۗۨ۫ۛۡۤۚۗۘۥۥۥۘۨ۟۟ۛۨۡۡۛ۟ۦۧۜ۬ۖۢۢۥ۫۫ۧۢ";
        File file = null;
        StringBuilder sb = null;
        String name = null;
        while (true) {
            switch ((((str2.hashCode() ^ 576) ^ 685) ^ 511) ^ 1310305144) {
                case -1933751093:
                    String str3 = "۬ۢۢۦۗۨۦۦۧۘۡۜۨۙۛۨ۠ۜ۟۫ۡۧۘ۟ۚۘۨۙۡۘۛۗۖ";
                    while (true) {
                        switch (str3.hashCode() ^ 1880969168) {
                            case -1998007110:
                                String str4 = "ۙۨۧۚۨۛۜ۟۠ۧۛۗۦۗۦۨۘ۬ۢۥۜۖۘۘۛ۠ۙۜۖۧۡۨۘۧۛۘۘۢۙۥۥۨ۬۫ۤۡۘۗۚۨۡۜۖ۬۠ۧ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-750845808)) {
                                        case -1910752940:
                                            str3 = "ۥۧۡۘۨ۫۠ۘ۬ۘۘ۬ۚۧۤۖۘۘۙۘۖۘۡ۫۠ۨ۠ۜۙۦۥۘ۬ۨۖۘۜۥۘۘۥۥۙ";
                                            break;
                                        case -1464886155:
                                            str4 = name.matches("\\d+") ? "ۗۢۤۥۡۢۜۗۛۗۤۤ۬ۥۧۘۡۤۛۦۥۢۗ۫۟ۙۚۘ۠ۧۖۖۙۘۡۨ۫ۥۧۘۗۚۗۧۢۤۖ۬ۖۚ۠ۡۘۜۧۢ" : "ۘۛۖۘ۫ۡۡۨۗۗۘۜۜۙۗۘۚ۫ۘۘ۠ۧ۫۬ۤۜۡ۟ۖۘ۠ۛۖۗۢۗۙ۟ۨۘۧۡۦۘ۬۠۠ۥۘۥۖۧۖ۬ۘۤۨۧۤ";
                                        case -673392708:
                                            str4 = "ۘۙ۫۫ۙۘۤۗۗۙۘ۬ۜۗۖۘۥۗۨۘۚۦۤۚۢۛۨۦۖ۬ۙۛۙۗۡۘۥۢۘ۬۫ۢۦۖۤ";
                                        case -493002866:
                                            str3 = "ۙۛ۬ۦۖۗۨۜۙۚۖ۫ۗۡۦۘۧۧۤۤۘ۠۬ۙۨۘۘۥۦۙۙۙۨ۟ۗۙۖۧۘ";
                                            break;
                                    }
                                }
                                break;
                            case -444972677:
                                str2 = "ۙۖ۬ۗۦۥۢ۠ۥۦۛۙۦۚ۟ۚۨۖۜۛۙ۫ۘۘۖ۬ۖۢۨۨۘۗۥۧۖۥۖۘۡۥۚۙۜۘ۫ۜۥ۠ۜۡۘ";
                                break;
                            case -398008970:
                                str3 = "ۢۗۦۘۧ۟ۡۖ۟ۦۤۧۜۧۗ۫ۦۚۨۥۥۛ۬ۙۖ۟ۗۤۢۨۧۘۥۡۤۘۙۦۘۨۧۡۜۗۘۘ۫۟ۜۘ۠ۗۚۚ۫ۢۙ۫ۛ";
                            case 1955439936:
                                break;
                        }
                    }
                    break;
                case -1911036988:
                    str2 = "۠ۤۥۘۚۧۨۘ۬ۥۚ۫۬ۧۛ۫ۦۘۛۨۚۢۜۜۘۗۚۧۤۚۖۧۡۦۘۦۚۡۧۙۘۘۛۤۧ۟ۚۜۘ۟۟ۨۨ۟ۥۘ۠ۜۖۘ۠ۤۨۘ";
                    continue;
                case -1662324054:
                    h.f("dJHQtn+tBaE+h54=\n", "W/Wxwh6CcNI=\n", sb, name);
                    str2 = "ۢۦۥ۠ۦۜۘ۠ۦۜۨۖۜۘۥۧۧۢۤۜۛۥ۬۬ۗۨۚۛۥۨ۫ۨۜ۫ۛۦ۟۫ۡۜۦۜۘۨۨۦۘۗۜۥۘ";
                    continue;
                case -1223973612:
                    str2 = "ۤۜۘۘۦۛۙۦۧۡۘ۬ۚۦۘۘۜۘ۬ۜۦۘۥۨۡ۠ۜۨۙۧ۬۟ۢۘۘ";
                    name = Environment.getExternalStorageDirectory().getName();
                    continue;
                case -868444169:
                    file = new File(h.e("vA==\n", "k23lQXESDCA=\n", sb, str));
                    str2 = "ۘۖۡۦۤۖۘۜ۫ۨ۫ۖۤ۬ۤۖۘۙۘۙۧ۬ۢۤۢۚۥ۫ۥۘۛ۫ۙۡ۫ۜ۟ۘۙۤۘۙ۬ۦۘۦۘۦۘۛۙۙۙۘۘ۟۫۬";
                    continue;
                case -231403773:
                    return new File(h.e("U7TFG/Cegn4IsYs=\n", "fNCkb5Gx5h8=\n", new StringBuilder(), str));
                case -154394200:
                    str2 = "ۨۖۦۛۧۙۡ۫ۛۚۛۨۚۙۥۚۘ۬ۙۚۢۨۥۦۨۡۘۛ۬ۘۤۦۥۖۙۖۖ۫ۖۘ۬ۢ";
                    sb = new StringBuilder();
                    continue;
                case 1342820575:
                    return file;
                case 2029762793:
                    String str5 = "ۗۚۨۘۜۥ۟ۧ۟۠ۙۥۜۘۜۦۨۘۥۢۨۘۖۙۦ۠ۡۡۘۤۚۚۦ۠ۥۡ۫۟۠ۗۛۚۙۖۘۚ۫ۥۜۡۖۥ۠ۛ";
                    while (true) {
                        switch (str5.hashCode() ^ (-911849076)) {
                            case -1896532919:
                                String str6 = "ۨۘۥۙۦۥۧۘ۫ۗۘۥۘ۟ۜۡۘ۠ۗ۫ۜۢۤ۠ۧۛۗۘۥۤۥۗ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-956162426)) {
                                        case -1858678885:
                                            str6 = file.canWrite() ? "ۡۖۘۘۥ۬ۨ۫ۤۨۙۦ۬ۤۛۥۘ۠ۚۘۘ۫ۛۗۘۦۘۧۘۛۖۥۧ۫ۜۤۗۡ۠۫ۨۛۗ۫ۜۘ" : "۫ۢۙۜ۟ۢۤۧۚ۬۬ۚۜۜۘۢۧۧۦۗۘۢ۠ۥ۟ۥۧۘۢۤۤ";
                                        case -1626561156:
                                            str6 = "ۧۘۧۘۤۧۛۚۡۜۨۙ۟ۚۦۛ۠ۘ۟ۤۡۗ۠۠ۚۛۦۧۘ۫ۤۦۘ";
                                        case -902275129:
                                            str5 = "۟۬ۦۤ۠ۛ۫ۚۖۘۢۛۤۘۖۛۢۘۘۘۢۨ۟۫۟ۖ۫ۢۥۘۖۜۧۘ۫ۛۘۧۙۖ";
                                            break;
                                        case -576600216:
                                            str5 = "۠۠ۗۜ۫ۜۚ۠ۛۚۖۤۘۨۥۛۛۥۥۖۨۘۜ۬۫۬ۥۡۘۚۛ۬ۚۗ۬ۖۧۧۡۖۘۢۚ۟";
                                            break;
                                    }
                                }
                                break;
                            case -1041212631:
                                str5 = "ۦۥۧۚۜۙۛۙۖۘ۬ۥۙ۟ۦۜۘۗۤ۟۠۟ۢۙۨۙۖۥۧۘۡۢۗ";
                            case 1229679465:
                                break;
                            case 1449182653:
                                str2 = "ۛۥۢۨۜۧۥ۟ۘۘۙ۬ۙ۫ۤۚ۫ۜۡۘ۫۠ۗۢ۬ۖ۬ۦ۟۟ۧ۫ۤۥۢ۟۫ۨۚۢۧ۟۠ۤۜۗۨۘۖۧۢۥۡۘۘ۟ۡۨۘ";
                                break;
                        }
                    }
                    break;
            }
            str2 = "ۢۤۡۗ۫۬۟ۜۘۦ۟ۨۨۤۨۘ۠ۗۡۛۛۖۘۡۗۖۚۨۙۦ۫۠ۗۧۖۘۗۖۧۘۡۜۡۤۘۖۘ۫ۚۖۥۖۤ";
        }
    }

    private static native void hookApkPath(String str, String str2);

    private static boolean isApkPath(String str, String str2) {
        String[] strArrSplit = null;
        String str3 = "ۛۗۧۖۤ۟ۦ۬ۚ۟ۥۚۢۦۤۢۖۥۛ۬۠ۗۜۡۘۤۛۨۘۤ۟ۤۨۧۛۗ۟ۖۚۦۜۘۢ۬ۚ";
        int length = 0;
        while (true) {
            switch ((((str3.hashCode() ^ 93) ^ 369) ^ 801) ^ 824527180) {
                case -1910209823:
                    String str4 = "ۡۤ۠۫ۗۥۡۛۖۘ۫ۛ۠ۚۘۛ۟ۦۥۘۥۡ۫ۗۗ۠ۤۛۗ۬";
                    while (true) {
                        switch (str4.hashCode() ^ 766942610) {
                            case -2011684114:
                                String str5 = "۠ۢۨۖۛۗ۟ۥۡ۬۬ۖۘ۬ۥۖ۬ۙۢۗ۟ۦۨۙۨۡۛۗۛۖۘۡۢۖ۫ۡۜۥ۬ۢۗۘۦۢۢۢۥۡۘۘۦۘۘۨۛۥ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-29529940)) {
                                        case -1761024608:
                                            str5 = "ۥۚۧۖۤۡۖ۟۫۠ۨۥۘۢ۟ۜۘۛۘۡۨۢۚۘۤۖۘۧۡۖ۫ۗۥۘۖۢ۠ۛۨ۬ۖۚۦۜۡۢ";
                                        case -508217330:
                                            str4 = "ۤۜۛۤ۬۟۠ۨۗۦۡۘۘ۬ۡ۠ۥۚ۫ۡۖۤۘۢ۬۟ۦۖۚۡۡۘۖۜ۬ۧۦۦۜۘ۬ۥۜ۠ۥۛۥۙۛۡ";
                                            break;
                                        case -484352991:
                                            str5 = strArrSplit[1].equals("asec") ? "۠ۡ۬ۜۥ۫ۧۦۡۧۨۛۛۧۙۥ۬ۡۥۙۡۤۡۚۦۤۦۡۚۘ۫ۗۢ۫ۡۜۘ۬ۙۥۘۡۨ" : "ۢ۠ۥ۟ۘۛۥۙۘۘۗۗۚۤۡۡۘۨۧ۫ۙۘۦۢۛۖۜۡۜۦ۫ۙۘۡۨ۟۟ۦ۬ۡۗۙ۫ۧۢ۠ۜۤۖۘ";
                                        case 245856558:
                                            str4 = "ۤۗۡۗ۠۟ۧۨۡۘۗ۬ۧۦۦ۫۟۬ۖۦ۟ۘ۟ۧۘۤۢۨۤۡۡۚۙۙۥۙ۠ۤۧۡۤ۬۟ۛۛۤ۬ۦ";
                                            break;
                                    }
                                }
                                break;
                            case -1586604598:
                                str4 = "۠ۦ۠۠ۛۨۖۙۙۚۦ۬۬ۥۚۖ۠۫ۘۡۘۥ۠ۖۦۡۥۜۧۦۢۖۨۘۙۖ۬ۦۨۚۘ۫ۨۢۗۜ۫ۤ۬ۖۖۗۖۛ۠";
                            case -1338171471:
                                break;
                            case -1232356340:
                                str3 = "ۜۙ۠۬۫ۢۗۘۤۖۤۖۘۗۦۥۡ۟ۖۘۨۨۢۜۥۗۜ۫ۗۖۧ۟";
                                break;
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case -1826368909:
                    String str6 = "۟۠ۧۛۦۛۦۥۦۘۘۡۗۦۛ۟ۧ۫ۘۨۡۖۨۨ۠ۛ۟۟ۜۥۘۦ۫ۦۘۡ۠ۛ۟ۡۙ۫ۨۖۘۜۨۙۛۜ۠ۘۜ۟ۖ۟ۜۘ";
                    while (true) {
                        switch (str6.hashCode() ^ 707561227) {
                            case 37961712:
                                break;
                            case 531320845:
                                str3 = "ۥۢ۟۫ۥۥۘۘۚۨۘۜۤۘۘ۬ۙ۠ۧۦۨۘۚۡۖۛ۟ۘۘۢۗۘۘۨ۟ۨ";
                                break;
                            case 1488857826:
                                String str7 = "ۘۗۜ۬ۧۛ۬ۛۨۥ۬ۜۙ۬ۦۚۡۤۨۛ۫ۛۗۢۢ۠ۥۥ۫";
                                while (true) {
                                    switch (str7.hashCode() ^ (-946005642)) {
                                        case -1234318618:
                                            str7 = "۠۟ۤۚۘۜۘۤ۫ۥۘۘۛۘۚۘ۫ۗ۫ۘۘۚۨۧۜۘۙۘۡۨۘ۬ۤۨۘ۠ۛۨۙۚۥ";
                                        case -33895232:
                                            str7 = str2.startsWith("/") ? "ۖۦۥۘۗ۟ۧۘۥۖۘ۬ۙۚ۬ۖۚ۬ۗ۠ۨ۬ۢۗۖۦۘۡۡۦۘۛۖۙۦ۠ۦۦ۠ۤ۠۬ۖۘۧۖۗۜۨۘ۟ۡۦ" : "ۗۛۘۘۡۜۡۙۛۥۙۗۢۤۢ۬ۨ۟ۥۘۢ۟ۧۤۡۢۗۙۧۦۖ۬ۨۧ۠ۥۡ۟۫ۘۥ۬ۥۙۢۤۧۗۛۜۘ";
                                        case 1344625090:
                                            str6 = "۫ۦۦ۫ۦۦ۬۟ۨۖ۠۫ۛۘۘۛۧۙۙۗۨۡۜۛۥ۟ۜۢۤۢۢۛۥۖۥۢۜۛۡۢ۫ۘۘۡۤ۟ۦۙۘ";
                                            break;
                                        case 2009986967:
                                            str6 = "ۢ۟۠ۨۥۥۦۖۛۙۚ۬ۨۦۦۡۚۙ۬ۢۡۘۧ۠۠ۚۚ۟ۥۡۢ۟ۦۘۜ۟ۖ۫ۜۗ۠ۨۨۘۙۘۛ۫ۖۖۘ";
                                            break;
                                    }
                                }
                                break;
                            case 1528697530:
                                str6 = "۠ۗۘ۫ۧۢ۠۫۬ۦۚۖۘۖۤۙ۫ۥۦۘۛ۫ۛۧ۫۠ۨۜۘۘۥۙ۫ۢۚ۟ۤۧۘۧۦۘۡۚۢۜۥۡۘۨۜۥ";
                        }
                    }
                    break;
                case -1823684379:
                    return strArrSplit[length - 2].startsWith(str);
                case -1776143421:
                    String str8 = "ۧ۟ۜۘۚۖۡۢ۫ۙۨۖۘ۠ۢۢۘۛۖۘۦۛۥۜۦۙۢۧ۠ۨ۬۟ۦۗۘۧۨۘۧۛۜۥ۠ۥ۬ۥۗۧۙ";
                    while (true) {
                        switch (str8.hashCode() ^ (-157136214)) {
                            case -1755289415:
                                str3 = "ۤ۠ۜۢۡ۬ۖۜۘۗۡۨۘۛۖۥۡ۠ۘۙۛۗۡۥۢۡۨۘۤۖۘۥۛۛۢۡۦۚۢۥۘۜ۟۠ۥ۟ۨۗۦۜۘۥۘ۫ۦۖۨ";
                                continue;
                            case -378164721:
                                String str9 = "ۦۛۗۚۙ۟ۦۗۙۡۙۡۘ۟ۜۖۘۥۗ۟ۙۚۨۖۨۗۤۦۢۘ۟";
                                while (true) {
                                    switch (str9.hashCode() ^ 783987503) {
                                        case -556396037:
                                            str9 = !str2.endsWith(".apk") ? "ۤۧۜ۟ۚۙۡۦۥۘۜۗۗۢۧ۬ۚۥۛۗۜ۠ۖۚۥۘۨۢۛۘۘۙۛۗ۫ۚ۟۟ۢ۬ۤ۠ۨۢۧۥ۠۬ۗۦۘ" : "ۗۢۢۖۤ۠ۘۚۥۘۙۙۖ۬ۥ۠ۨۜۘ۬۟۠ۡۧۘۘۗۜۧ۠ۤۢ";
                                        case -226030083:
                                            str9 = "ۨۤۖۖۗۦۘۜۡۨۘۢۧۛۧ۠ۧ۠۬ۘۘ۬ۨۚ۠ۘۖ۟ۛ۟ۙۨۧۘ۟ۗۨۘۖۖۘۡۢۖۡۦۙ";
                                        case 740008739:
                                            str8 = "ۦۛۜۘۖۨ۬ۥۚۦۗۤۦۘ۫۬ۚۛ۬ۖۛۡۗۤۗۖۘ۟۫ۨۘۚۧۡۘۙ۟ۡۢۖۡۘ";
                                            break;
                                        case 1321219645:
                                            str8 = "ۖۥۜۘ۫ۨۙۚۘۧۘۚۙۖۘ۟۬ۤۡۧۛۢۨۤۖۗۢۦ۟۬ۡۖۤ";
                                            break;
                                    }
                                }
                                break;
                            case 1956232436:
                                str8 = "ۥ۫ۛۗۦۘۦ۟ۥۖۛۨۦ۟ۚۙ۠ۡۘ۫ۗۘۘۧۥۙۖۡۦ۬ۘۥۧۥۘۦ۠ۗ۫ۡۨۤ۫۫ۧۖۘۥ۫ۨۘ";
                                break;
                            case 2089530491:
                                str3 = "ۚۙۥۘۜۙۗ۠۬ۢۘۘ۫ۥۖ۠ۙۖ۠ۙۚ۫ۥۨۘۥ۟ۖۘ۬ۘۢۘۧۚۙۡۚۡۥۤۥۧ۠ۖۖۨۘۖ۬ۙۙۢۧۢۛۡۘ";
                                continue;
                        }
                    }
                    break;
                case -1745358908:
                    strArrSplit = str2.substring(1).split("/", 6);
                    str3 = "ۚۡۤۛۙ۠ۙۥ۫ۚۥۦۡۙۜۘۛۜۙۧ۫۬ۥ۬ۜۘۤ۬ۖۘۚۛ۠ۜۧ۟ۜۜۦ۠ۧۛۢۧۢۦۤۘۥۘ۟ۜۢۖۘۘۤۖۘ";
                case -1664828673:
                    String str10 = "۟ۜۨۘۤ۫۫۠۟ۜۦۚۤۗۤۖۘۖۧ۠ۘۨۜۘۨۦۘۘۗ۠۬۟۠ۜۛۡۘۤۜۧۗۚۘۡۨۡ";
                    while (true) {
                        switch (str10.hashCode() ^ (-6191305)) {
                            case 182146988:
                                break;
                            case 825970765:
                                String str11 = "ۙۙۢۢۡۥۙۢ۟۫۟ۦۘ۬ۢۖۘۖۛۧۥ۠ۨۤۧ۠ۘۘۨۘۡۧۧۦۚۗۡۨۥۘ";
                                while (true) {
                                    switch (str11.hashCode() ^ (-222407389)) {
                                        case -678406655:
                                            str10 = "ۛ۬ۛۡ۫۬۠ۚۚۜۜۚ۠ۨ۠ۥۗۗ۬ۦۘۥۚ۟ۛۘۖۢ۬ۦۘۛۨۙۢۜۜۘۜ۬ۦۧۢۘۧۢۖۘۚۗۖۘ";
                                            break;
                                        case 311627949:
                                            str11 = strArrSplit[1].equals("app") ? "ۗۛۖۘ۟ۦۙۘۧۜۘ۫ۛۦ۟ۜۘ۠ۘۦ۟۬۬ۛۦۨۘ۬۟ۖ۟ۨۛۥۙۥۨۡ۬" : "ۨۛۧۦۥۜ۟ۛۤۤۨۛۥۡۘOۦ۫۠۫ۚۛۨۖۢۙ۫۬";
                                        case 1069374010:
                                            str11 = "ۜ۠ۡۘۢۗۛۤۦۦۘۧۛۥۘۡ۫ۡۗ۬ۡۘۨۚۛۢ۫ۡ۫ۙۙۙۚۘۨۗ۟۫ۢۦۘ";
                                        case 1839573122:
                                            str10 = "ۖ۠ۢۡ۟ۘۘۙ۟۬ۧۨۢۜۦ۬ۚۗۨۘ۬ۨۘۤۤۥۘۡۥۘۘۛۖۧۗۘۘۡۤۥۦۙۥۗۤۘۘ";
                                            break;
                                    }
                                }
                                break;
                            case 943254602:
                                str10 = "ۨۚۢ۫ۡ۟ۡ۬۬ۡ۟ۛ۬ۜۘۘ۫۟ۢۤ۬ۙۨۧۥۨۦۧۘ۫ۧۡۘ";
                            case 1359558775:
                                str3 = "ۢۖۥۘ۟ۨۖۘۨۨ۬ۖۘۚۥۚۤۦ۫ۦۘۛۛۖۘۗۘ۬ۚ۫ۖۖۗۘۛۜۨۗ۠ۛۛۛۘۘۧ۫۟۟ۢۡۚۚۦ";
                                break;
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case -1360087720:
                    String str12 = "۫ۖۘۙۨ۟ۥ۟ۚۡ۟۬ۖۛ۬ۥۥ۠ۦ۬ۗۚۗۦۘۢۧۜ۬ۗۢۛۥۘۗۘۛۢ۬۬ۘۢۤ";
                    while (true) {
                        switch (str12.hashCode() ^ 93759110) {
                            case -1058673339:
                                str3 = "۫ۥۘۘ۬۬ۢۛۨ۟۫ۙۦۘۦۡۡۡۗۢۗۛۛۚۧ۫ۙۙ۬ۤۦۘ۬ۦۜ۫ۡۘ۠ۦۧۡۦ";
                                continue;
                            case -620200837:
                                str12 = "ۖۧۗۥۢۥۘۙۡۨۢۡۨۘۧ۟ۥۚۜۖۘۢۖۙ۫ۧ۬۫۬۠۟ۜۘۥۖۨ۠۬ۡۘ۟ۜۖۗۧۖۘۢۤۡۚۦۜۘ";
                                break;
                            case 1244672252:
                                String str13 = "ۡۜۧۤۘۡۘۦ۠ۥ۟ۖ۠ۧۡۖۘۛۧۢۥۦۘۥۖۡۙۧۥۦ۫ۡۘ۬ۘۘۖۛۖۖۦۚۛۖۘ";
                                while (true) {
                                    switch (str13.hashCode() ^ 1142690062) {
                                        case -379896184:
                                            str12 = "۬ۨ۟ۙۗۛۘۧۧۨۗۖۘۥۙۖ۫ۙۧ۬ۡۨۘۥۛۦۖ۫ۙۥۦۗۙۘ۫ۜ۠ۜۘ۟ۧ۟ۢ۟ۥۘۘ۬۫ۨۨۢ";
                                            break;
                                        case -118730709:
                                            str13 = "ۡۤ۠ۘۖۘۘۙۛۤ۫۬ۡۘۖۤ۟ۧۡۧۚۧۜۛ۫ۖ۫ۤ۬ۧۘۘۘۤ۬ۘۗ۟ۗۗۘۘۤۢۖۘ";
                                        case 1024693187:
                                            str13 = length == 3 ? "ۨ۫ۥۥ۬ۥۘۜۤۘۘۧۚۥۘۨۢۨۛ۟ۡ۟۫ۧۜۛ۠۬ۘۡۗۦۘۘ" : "ۨۛ۫ۚۘ۫۬۟ۛۢ۟ۘۘۚ۠ۨ۫ۥۖۙۖۦۘۧۖۚۙ۬ۧۦۗۚۗۧۗۘۡۚۤۖۘ۬ۨۦۡۧۢۨ";
                                        case 1159688303:
                                            str12 = "ۚۧۦۘۦ۟ۡۧۢۚۗۖۚۜۜۙۗۥۘ۟ۛۡۖ۬ۜۤۘۘۘ۟ۤۛۗۡۥ۠ۥۘ";
                                            break;
                                    }
                                }
                                break;
                            case 2140865969:
                                str3 = "۠ۢۖۘۦۗۥۧۥۦۘۗ۟ۧۜ۫ۧ۫ۢۢۧۘ۠ۙۜۨۡۨ۠ۧۥۗۘۤۡۗۘ۠ۜۜۘۜۤۡۘۦۛۖۡ۠ۢ";
                                continue;
                        }
                    }
                    break;
                case -1129204412:
                    String str14 = "ۧۢۜ۠ۧ۬ۦۜۢۜۜۘۗۤۤۘۢۡۤۚۥ۬ۤۡۘ۟ۡ۬ۡۙۜۘ۠ۥۘۘۤ۬ۖ";
                    while (true) {
                        switch (str14.hashCode() ^ (-1588112116)) {
                            case -627658571:
                                String str15 = "ۜۧۥۘۚۖۦۡۙ۠ۛ۠۬۬ۢۨۤۖ۟۟۠ۥۜۦۡۜۘ۠ۜۡۘۦۨۜ۠ۗۤۖۥۜۘ۬ۙۡۤ۟ۖۜۨۥ";
                                while (true) {
                                    switch (str15.hashCode() ^ (-1577141915)) {
                                        case -2097060791:
                                            str15 = length == 6 ? "ۢۘۘۘ۫ۗۥۚۨۚ۬ۥ۬ۘۙۚۙۦ۬ۡۛۗۨۦۖۜ۠۬ۥۙۧۧۧۜۖۘ۬ۨۜۡۘۢۦۢ" : "ۙۥۦۘۥ۠ۧۙۚۗ۬ۦۧۡۢۡۚۗۥۨۜۥۘۗ۫۬۬ۡۘۨۡۢ";
                                        case -408186678:
                                            str15 = "ۥۥۙۖ۫۟۟ۤۙۦ۫ۘۖۘۧۢۥۘۨ۫ۤۡۜۢۦۤۜۘۛۘۗۘۧۡ۟ۘۦ۟ۦۙ۬۠ۨۘ";
                                        case 1548445828:
                                            str14 = "ۙۙ۫ۜۦۘۘۜۦۥۘۜۧۘ۬۠ۨۡۡ۬۟ۙۧۜۜۨۘ۠ۦۦۘۢۜۧ";
                                            break;
                                        case 2038653615:
                                            str14 = "ۤۜۨۘۙ۠ۖۘۥۖۜۘ۟ۡۧۘۦۦۜۚۗۙۧۘۧۥۦ۠ۡۛۙۖ۫ۜۘۦۨۧۘۜۜۘۨۡۡۙۡ";
                                            break;
                                    }
                                }
                                break;
                            case -536167595:
                                str3 = "ۛۘۦۥۗۨۘۥۗۥۛۥۗۜ۫ۧۨۦ۫۫ۢۗۗۦۡۘۢۢۘۘۗۘۙۧۗۘۘۡۗۛ";
                                break;
                            case -225681753:
                                str14 = "ۢۛ۟ۚۧ۫۫ۜۥ۫ۗ۠ۦ۫ۙ۫ۗۡۛۖۖۘۖ۟ۢ۫۟ۨۘۚۗ۬ۜۚۢۚۗ";
                            case 298023341:
                                break;
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case -833329401:
                    String str16 = "۬ۡۨۚۜ۟ۘۤۘۤ۟ۛۨۗۘۖۨۖۤۨۧۘ۫ۨۡۘ۠ۚۧۘۨۥۘۘۙۥۘۡ۠ۜۧۡۘۘۢۤ۟";
                    while (true) {
                        switch (str16.hashCode() ^ (-1600058613)) {
                            case -415857144:
                                str3 = "ۜۢۙۦۨۤۥۛۘ۬ۙۨۘۗ۟۫ۛۡۦۛ۟ۧۧۤۚۗۛۛۧۛ۬ۨۘ۠ۘۡۖۦۙ۬ۤۡۘ۠ۘۛۙ۟ۢۘ۠ۨۘ۠ۡ";
                                continue;
                            case 464593186:
                                str3 = "ۦ۫ۜۘۧ۟۫ۙۖ۬۠ۛۖۥۦۘۥۧۧ۠ۨۙۧۜۖۜۡۥۖۡۦۢۙۨ۫ۦ۫ۙ۫ۛ۟۟ۨۘ";
                                continue;
                            case 1049297187:
                                String str17 = "ۙ۟ۧۤۗۙۨ۫ۗ۫ۖۦۘ۫ۧۨۘۘۡۤ۠ۜۘ۬ۙۨۢۚۚۗۛۘۘۘۥ۟ۤۗۡۘۗ۫ۜۗۗ";
                                while (true) {
                                    switch (str17.hashCode() ^ (-245223398)) {
                                        case -706682653:
                                            str16 = "۬ۤۦۘۤۤ۠ۙۜ۟ۥۛۥۘۥۨۘۗ۫ۢۢۧۖۤ۠ۦۘۙۨۗۖ۠ۗ۠ۖۧۥۧۛ۟ۛ۠ۜۗۨۘۧۦۦ۫ۢۙ۟۬ۘۘۤ۠ۨ";
                                            break;
                                        case -418927798:
                                            str17 = length == 5 ? "۬ۥۥۛۘ۟ۧۡۢۢۥۘۘۖ۠ۖۜۨۨ۠ۘۧۛۧۢ۬ۨۤۘۘۤ۫ۥۘ۬ۘۡۘۤۛۘۨۡۗ" : "ۡۤۧۢۙۨۚۚۜۘۗۘ۟ۜ۫ۗۤۘۢۥۜ۬۟ۡۛۤۧۜۘ۠۬۬۫ۙۖۘۥۘۡۢ۟ۨۢۚۡۤ۠ۘۗۦۜۘ";
                                        case 144059095:
                                            str16 = "ۨۨۢ۟ۡۡۘۤۘ۟۠ۧ۠ۦۡ۫۬ۧۗۘۜۧۘۦ۟ۥۘ۬ۗۛۡۥ۠ۡۛۙۘۛۗۧۙۦۘۙۧۡۘ۠ۗۨۘ۫ۚۙ";
                                            break;
                                        case 949273196:
                                            str17 = "ۤۙۖۛ۟۠ۖۢۘۘۤۘۗۦ۠۠ۦۘۘۛۤۨۜۢۦ۟ۘۥۨ";
                                    }
                                }
                                break;
                            case 1426124498:
                                str16 = "ۗۚۘۗۨۦۘۜۖۗۗۦۥۘۧ۫ۤ۟ۡۢۥۧ۟۠ۖۘۢۙۨۘۨۧۗۥۧۜۘۥ۠ۧ";
                                break;
                        }
                    }
                    break;
                case -828601884:
                    return strArrSplit[2].startsWith(str);
                case -753324943:
                    length = strArrSplit.length;
                    str3 = "ۡۢ۫ۜ۠ۧۡۙۦۙۖ۬۠۫ۜۚۘۘۧۨۜۚۦۛۛۤۨۘۦۢ۫ۖ۠ۘۘۘ۠ۛ";
                case -622860268:
                    String str18 = "ۢۡۤۚۡۖۘۢۨۗۦۚۤ۫ۢۖۘۜۙۧۘۚۦۘ۠ۛۘۘۖ۫ۘۘۨۤۙ";
                    while (true) {
                        switch (str18.hashCode() ^ (-341653953)) {
                            case -753407230:
                                break;
                            case 1380010262:
                                str3 = "ۡۜۨۘ۫ۘۘۘۢۧۢۦۤۦۘ۫ۜۡ۫ۤۨۥۘۜ۬ۥۘۨۦۜۘۛۖۡۘۙۧۦۢۦ۟ۡۘۦۛۜۘۚۚۨۘۚۖ۠";
                                break;
                            case 1434936778:
                                String str19 = "ۦۜۦۨۨ۠ۥ۟ۘۘۛۚۖۡ۬ۨۛۤۨۧ۠ۥۘۗ۫ۚۛۨۧۘۡۥۚۢۚ۫ۘ۟۠ۢۗۦۛۧۘۘۜۘۙۜ۠ۡۦۢۨۜۘۘ";
                                while (true) {
                                    switch (str19.hashCode() ^ (-463248818)) {
                                        case -1813715333:
                                            str18 = "۫ۘۡۗۛۗۨۖ۟ۡۤۡ۬ۤۢ۟ۤۚۡۗۥۘۢۡۘۗۦ۠ۧۤ۫ۡۜۘ۠ۦۨۘ";
                                            break;
                                        case -1202082974:
                                            str18 = "ۢۨ۠ۨ۬ۢ۫ۤۛۚۢۘۚۘۦۘۢ۫ۥۦۡ۠۟ۨۤ۟ۙۤ۬۫ۚۙۚۧ۟ۧۡۢۢۢ۟ۚۗۥۘ۠ۧ۫ۛۚۖۘۘۦ";
                                            break;
                                        case 1351907924:
                                            str19 = strArrSplit[length + (-1)].equals("pkg.apk") ? "ۥ۟ۡۢۚۦ۫ۨۨۘۗۛۢ۫ۦۚۘۥۤۘۥۨۜ۠ۙۙۖۛۛۢۤۛۧ۠" : "ۖۘۛۜۢۤ۬ۥۛ۠۬ۥۘۚۙۨۘۖ۠ۜۨ۠ۙۦ۫ۥۘۜۨۨۦۡۥۛۘۙۤۜۘ۬ۥۥۘ۠ۥ";
                                        case 1879137335:
                                            str19 = "ۙۜۘۘۜۜۘۘ۬ۘۘ۟ۚۖۘۢۢۗۘۘۦ۠ۘۡۚۨۘۙۢۡۘۧۤۜ۫۟ۥۘۖ۟ۘۘۨۚ۟۫ۦۛ";
                                    }
                                }
                                break;
                            case 1804627597:
                                str18 = "ۧۤۤۢ۟۠۟ۤۙ۫۫۬ۗۥۡۡۜۜ۠ۡ۬ۡۙۥۘۥۗۦۘۢ۠ۡۖۤۥۘۛ۫ۡۨ۠ۥۘ۠۬ۖۡۧۦۡۗۥ";
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case -56619901:
                    String str20 = "۬۫ۜۜۨۜ۫۟۟ۡ۠ۛۤ۠۫ۢۚۡۗۥۥۘۙ۫۫ۤۢۨ۬ۥۘ";
                    while (true) {
                        switch (str20.hashCode() ^ 1718683348) {
                            case -1497264168:
                                str20 = "ۨ۠ۦۘۙ۟ۤۢ۫ۖ۟ۨۜۧ۠ۦۛۖۖۚۗ۟۟ۗۚۤ۠ۥۘۥۦۦۘۜۚۜۘ۬۟ۨۘۧ۫ۙۧ۫ۘۘ۬ۗ۫ۦۜۥ";
                            case -114536507:
                                break;
                            case 161658549:
                                str3 = "ۦۜۘ۬ۖۢ۬ۗۥۥۜۧۘ۠ۡۘۗۙۦۖۤ۟ۙ۟ۙۚۚۦۛۦۘۘۖۗۙ۠ۜۘ";
                                break;
                            case 565217083:
                                String str21 = "ۡۙۜۘۗۥۜۘۗۤۖۘۢۖ۫ۗۜۛۦ۠۟ۙۧۜۦۨۧۜۨۘۥۗۚۘۤۘۘۖۗۥ";
                                while (true) {
                                    switch (str21.hashCode() ^ 416206024) {
                                        case -1935778300:
                                            str21 = strArrSplit[1].equals("app") ? "ۜۘۦۗۨۨۡۙۗۥ۫ۡ۬ۥۧۛ۫ۥۜۥۘۨۤۖۜۗ۬ۢۖۧۘ" : "۠۫ۗ۬ۧ۠ۘۖۘۘۖۤۡۘۧ۬ۡۧۜ۟ۧ۟ۦۘۨۜۤۚۙ۬ۨۛۤۧۧۡۖۤۢۜۦۗۙۦۜۘۛۖۖۘۢ۬ۚ";
                                        case -523777741:
                                            str21 = "ۛۖۛۦۢۦۘۙۤۖۘۦ۫ۚۘ۫۠ۚۡۧۘۡۜ۠ۛۢۥۚۧۛۢ۫ۜۖۘۦۘۨۙۜۘۧ۫۫۫ۡۡۘ";
                                        case 1547834200:
                                            str20 = "۠ۢۘۘۙۚۖۘۛۗۡۘۡۧ۫ۡۜ۟ۥ۟ۚ۟۫ۛۙ۟ۛۧۜۜۨۥۗۗۛۗۜ۠ۥۤۛۦۘۗۖۧۘ۬۫ۖۘۜۛ۫ۛۡۘۘۛۛۙ";
                                            break;
                                        case 1664932162:
                                            str20 = "ۖۧۡۘۡۤ۟۬ۚۥۡ۠ۨۨۤۡ۫۬ۧۨۧۙۘۦۛۧۦۨۗۢۘۨۖۦۚۡۥۘۘۡ۟۫ۖۥۘۘۜۥۘۘ۟ۛۨۙ۬ۦۧ۫";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    str3 = "ۛۥ۟۟ۜۨۘۙۤۘۘۢۜۚۚۙۖۢۜۛۘۢۧۖ۠۟ۗ۬ۨۘ۬ۙۡۘۡ۠ۨۚۦۦۛۦۦۘۡۚۥۧۡۢۢ۬ۦۘ";
                    break;
                case -26812622:
                    String str22 = "ۤ۫ۥۢ۟۟۠ۜۡۦۖۥۘۗۤ۬۟ۚ۠ۢۛ۟ۛۛۧۘۘۖ۬ۧۥۙۨۜۧۥۥۦۤ۟۟ۛ۫ۨۘ۠ۘ";
                    while (true) {
                        switch (str22.hashCode() ^ (-1738144958)) {
                            case -1942409843:
                                String str23 = "ۖۦ۫ۢۢۦۜۦۢۘۤۨۗۖۨ۟ۥ۬ۗۤۤۗۜۘۡ۠ۤ۠ۧۛۢۨۘۥۡۖۛۙۛۧۘۦۘۛۗۜۜ";
                                while (true) {
                                    switch (str23.hashCode() ^ 412102264) {
                                        case -1125323978:
                                            str22 = "ۘۥۨۚۥ۫ۗۗۘۘۤۜۜۘۨ۟ۦۘ۠۟ۨۘۡۖۚۤۘۧۨۘۨ۬ۘۙۙۖۙۖۙۘۘۦ۫ۘۘ۫ۘۖ";
                                            break;
                                        case 864141972:
                                            str23 = "ۚۦ۠ۖۡۘۘ۫ۥۜۡۖۘۛۙۖۙۛ۟ۥ۬ۜۘۧۨۙ۠ۛۘۨ۟ۤۦ۟ۜۦ۠ۘۜۖ۫ۛۤ۬ۨۚ۟ۦ";
                                        case 1178625470:
                                            str22 = "۫ۢۙۤ۠ۥۘۚۗۜۘۢۦۤۤۙۡ۫ۙۨۘۜۢۦۘۛ۟۬ۡۦۘۜۘۗۗۡۘ۬ۥۛۗ۟ۜۨۨۗ";
                                            break;
                                        case 1906627237:
                                            str23 = strArrSplit[5].equals("base.apk") ? "ۚۡۙ۠ۨۤۚ۬۟ۜ۠ۨۧۤۦۘۦۜ۟ۦۛۚۛۤۢ۟ۘ۟۬ۢۛ" : "ۛۦۙ۬ۢۡۘۢۤۜ۠ۛۥۘۛۦۡۘۨۢۨۘۜۧ۟ۖۧۚۖ۬ۙۛۙۧۡۜ۬۫ۡۥۥۙۡۘ۬ۘۛۙۧۦ۬ۡۥۘ";
                                    }
                                }
                                break;
                            case -1929061637:
                                break;
                            case 1144758614:
                                str3 = "۬ۜۧ۠ۜۚ۫۠ۦۘۨ۫ۤۛۘۧۘۘۨ۫ۦ۟ۗۛۛۘۗۗۘۘۘۢۥۘۢۦۚۜۛۤۦۨۥۘۦۘ۫ۚۡۜ۠ۤۜۘۤ۬ۢۥۤ۠";
                                break;
                            case 1882153369:
                                str22 = "۟ۗۜۘ۟۠ۖ۬ۥۡۘ۠ۗۤۨۙۛۧۜۜۘۘۨ۠ۙۢۢۡۜۨۢ۬ۚۤۚۘۘۥۤۛۧ۬ۧۖۧۜۘ";
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case 97335931:
                    String str24 = "ۧۘۦۘۤۛ۠ۨۛۧۜۤۜۘۗۖۘۧۗ۟ۖ۟ۜۢۖ۫ۡۛۘۖۤۥۢۧ۠ۗۜۚ";
                    while (true) {
                        switch (str24.hashCode() ^ (-1804445986)) {
                            case -1032453023:
                                break;
                            case -145809675:
                                str24 = "ۨۤۨۨۗۘ۫ۖۦۖۚۨۚۧۘۘۧۧۖۘۙۨۡ۠ۘۖۘ۠۬ۨ۫ۙۛۚۦۨۘ۫ۢۤۨۛۡۨۘ";
                            case 919218603:
                                str3 = "۫ۢۤۢۛۥۘۧۘ۬ۙۧۜۘ۬۫ۦۤ۬ۨۘۤۚ۠۠ۨ۫ۘۡۛۗۙۜۘ";
                                break;
                            case 1688598689:
                                String str25 = "ۖ۬ۜۧ۠ۨۘ۟ۙۡۘ۫ۘ۠ۤۢۛ۠ۡۢۖۜۖ۫ۙۖ۫ۧۜۧۧۚۜ۬۬ۧ۠ۤ۠ۛ۬ۢۢ۠ۡۙۛۙ۟۠۠ۦۘۡ۫۟";
                                while (true) {
                                    switch (str25.hashCode() ^ 1748770274) {
                                        case -581979645:
                                            str25 = strArrSplit[length + (-1)].equals("base.apk") ? "۟ۥۘۧۜۦ۠ۜۥۖ۟۠ۦۖۜۥۗۗۚۨۖۘۥ۟ۦۡۙۧۛۦۧۘۗ۬۬۟ۥۘ۫۫ۢۙۥۚۜۛ۟ۥۦۘۤ۟ۥۢۙ" : "ۤۛۖۨ۠ۥۘۗۥۦۢۜۚ۟ۦۛۙۦۦۥۦۖۘۘۧۥۘۙۖۦ۬۬ۤ";
                                        case -314198921:
                                            str24 = "ۗ۠ۡۘۜۘۖۘۗۖۜۖ۠۟۬۫ۧ۠ۧۦۘۜۥۖۤۘۚۨ۠ۘۘۛۖۘ۬ۖۜۥۥۜ";
                                            break;
                                        case 1210549676:
                                            str25 = "ۢ۬۬۬۫ۜ۟ۡۨۘۢۜۙۡۘۜۖ۟۫ۢ۬۫۬ۜۘۜۖ۫ۜۜ۠ۚ۬۠۬ۨۚ";
                                        case 1886256309:
                                            str24 = "ۡ۠ۛۢۢۡۘۨۥۥۘۧۥ۫ۧ۫ۙۘۦۢۖۛۧ۬ۘۨۦۘۜۛۗۦۨۛۜۘۨ۟ۚۙۧۦۘۗۗۧ۫ۙۨۘ۟ۚۖۛ۠۬ۖۢ۫";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    str3 = "ۛۥ۟۟ۜۨۘۙۤۘۘۢۜۚۚۙۖۢۜۛۘۢۧۖ۠۟ۗ۬ۨۘ۬ۙۡۘۡ۠ۨۚۦۦۛۦۦۘۡۚۥۧۡۢۢ۬ۦۘ";
                    break;
                case 257932773:
                    String str26 = "ۘ۟ۦۘۧۗۜۙۢ۠ۨۨۤ۬ۛۘۘۤۙۡۙۢۜۖۦۗۙۡۗۚۨۥۘۨۨۘ۫۫ۙ";
                    while (true) {
                        switch (str26.hashCode() ^ (-456503109)) {
                            case -670968677:
                                String str27 = "۟ۖۚۙۨۦۘۚۨۜۘ۟ۡۜۙ۫ۢۜۦۛۨۛۖۙۜ۬۬ۤۡۘۦۤۖ";
                                while (true) {
                                    switch (str27.hashCode() ^ 695291687) {
                                        case -2061177874:
                                            str27 = "ۨ۠ۜۘۖ۫ۥ۠ۘۤۚۙۖۘۧۛۖۘۗۥۘۚۛ۠ۜۚ۟ۚ۟ۦۤ۫ۨۘ۟ۦۗۜ۟ۛۤ۬ۨۘ۟ۜ";
                                        case -1776440393:
                                            str26 = "ۥۜۨۘۚ۠ۖۘ۫ۚۨۘۙۗۙ۠ۖۗۥۤ۬ۜۤۦۘۨۛۥۗۖۘ۫ۛۡۘۧۖۥ۟ۢۘۘۤۦۖۗۙۦۦ۟ۗۧۗۧۢۥۢۙ۟ۧ";
                                            break;
                                        case 70876931:
                                            str26 = "ۚۛۤۢ۬ۦۘۧۗۖۧۗۚ۫ۦۡۜۨۚۤ۠ۨۘ۬۟ۢ۟۟ۜۘۥ۟ۘۘۛ۬ۖۘۙۨۧۘۤۛۥۘۥۛۡۚۤ۟ۢۨۜۘ";
                                            break;
                                        case 669504977:
                                            str27 = strArrSplit[0].equals("mnt") ? "ۘۗۦۗۚۖۖۢۘۘۛۖۜۘۗۦ۬ۚۛ۫ۘۢۗۖۛۧ۫ۧ۫ۖۙۖۢۥۛۥۘۛۘۘۘ۫ۘ۟ۤۡۨۘ۟۠ۜۘ" : "ۤۙ۟ۤۛۧۚۚۦۜۖۘۘۜۡۘۧۖۦۤۤۥۘۥۛۜۘۛۘ۠ۘۜۘۘۗۨۘۘۙۡۛۘۛۡۚ۬ۜۢۜۘۗۜۢۛۥۜ۬ۗۘ";
                                    }
                                }
                                break;
                            case 296867724:
                                break;
                            case 531293656:
                                str26 = "ۙۥ۫ۜۢۜۖۦۘۘۦۘۛۖۙۥۤۨۢۨۜۨۤۡۨۘۡۨۦۧۦۧۘۖۨۦۙۚ۬ۘ۟ۗۖۘ";
                            case 735661876:
                                str3 = "۟ۤۜۜۦ۟ۗۗۡ۬ۥ۠ۡۗ۬ۚۗۦۘۗ۠۫ۨۚۦۘۙۤۧۜۡۛۧۚۛۡۚۙۥۙۢۙ۟ۡ۬ۗۡۚۨ۠";
                                break;
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case 295233163:
                    str3 = "ۖۤۖ۬ۥۖۘۛۥۖ۠۠ۛۥۖۘ۫ۨۚ۫ۙۘۡ۟ۖۦۥۜۨ۟ۖۤ۠ۤۡۙۜۜۥ۟۠ۥۙ";
                case 303868491:
                    String str28 = "ۙۥ۬۟ۦۘۥۙۙۚ۠ۛۤۛۢ۫ۜۤۚۤۨۘۘ۟ۡۘۘۤۙۡۗ۠ۖۜۤۨۜ۫ۛۡ۟ۨۖۖۘ";
                    while (true) {
                        switch (str28.hashCode() ^ (-94856998)) {
                            case -2003125129:
                                break;
                            case -1569989012:
                                str28 = "ۤ۫ۦۚۚ۫ۨۘۖۘۨۢۤۤۢۚ۬۟ۘۦۤۜۘۖۖ۬۟ۨۚۨۜۙۨۘ۬۫۠ۘۘۢ۫ۚۡۘۘۘ۫ۢۚۚ";
                            case -951044411:
                                str3 = "۟ۛۡۦۙۦۘۙۢۨ۬۫ۖۘۗۥۨۥۡۢ۟ۧۖۘ۠ۦۤ۟ۢۖۘۚۡۘۘۜۦۛۥ۟ۦۘۢۥۥۘۛۗۗ";
                                break;
                            case 2027002344:
                                String str29 = "۠ۡۜۜۙۡۘۚۢۧۚۗۨۘۥۦۜۘ۟ۛۧۦ۬ۘۘۛ۟ۨۡۚۖۘۡۥۙ۬۟ۙۢۙ";
                                while (true) {
                                    switch (str29.hashCode() ^ (-775608068)) {
                                        case -1833927892:
                                            str29 = length != 4 ? "ۚۨ۬ۧۘۚۛۢۜ۠ۜۡۙ۬۫ۥۘ۟ۗۚۡۡ۟ۤ۫ۙ۟ۨۡۘ۫۬ۦۘۗ۠۠" : "ۥۦۧۘ۠ۦۧۘۥۢ۬ۜۛ۬ۛۖۘۜ۬ۜۙۢۢۡ۠ۤۥ۠ۛ۠۬ۖۘۨۤۡۧ۠۫ۦ۫ۖۘۡۜ۫۬ۦۧ۟۬ۜۘ";
                                        case -1793441213:
                                            str29 = "ۚۜ۟۠ۨۘۚۖ۟ۥۡۘۖ۬ۖۘۜۖۘۚۡۜۨۛۙۜۤۢۖ۫۟ۖ۠۬ۛۡۤۧ۟۫ۢ۬ۚۖ۠ۜۘۜۛۥۘۚۧۡۗۗۜۘ";
                                        case 139600314:
                                            str28 = "ۢۨۚۧ۬ۜۘۗۡ۠ۢ۟۬ۦۙۡۢ۟ۤۖۧۨۘ۠۫ۖۗۡۤ۟ۢۛۙۦ۠ۨۤۛ";
                                            break;
                                        case 146768312:
                                            str28 = "ۨ۟ۨۘۙۗۥۘۜۦۛۡۦۜۘۘۖۨ۬ۖۥۧۦۤۨ۟۠ۨۗۖۘۧ۫ۜۡۡۖ۟۬ۧۥ۬۠ۗۦۜۘۛ۬ۨۘۤ۠ۥۦ۬ۧۧۨۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 369107426:
                    str3 = "۫ۦۛۢۚۙۘۚ۟ۜۥۚۨۢۙ۫ۚۜۘ۟ۘ۟ۡۜ۠ۧۛۥۤ۟ۘۘۙۖۧۘۛ۫ۛ";
                case 393880505:
                    return strArrSplit[4].endsWith(str);
                case 428008087:
                    String str30 = "ۘۦۤۨۨۥۗۥۨۘۛۤ۬۬ۧ۠۬۫ۡ۠ۖۡۙۜۙۡ۫ۤ۠ۡۘۤۛۙۧۡۨۘ۫ۤۙۡۘۦ۬ۖۥۘۨۙۦۘ۬ۙۚۡۚۜۘ";
                    while (true) {
                        switch (str30.hashCode() ^ 1314214823) {
                            case -1131353659:
                                break;
                            case -4376795:
                                String str31 = "۬ۧۡۡۙۡ۬ۦۦ۬ۛۢۘۢۧۦۡۦ۬۫۫ۡۘۘۛۛۘۙۜۗۥۖۜۘ۠ۥۙ";
                                while (true) {
                                    switch (str31.hashCode() ^ 1245686628) {
                                        case -1893426210:
                                            str31 = "ۛ۟ۡۘۛۖ۟ۜۧۢۧۧۖۨ۠ۘۛۙ۟ۖۦۡۡۛۖۥۦۘۜۨۦۘۘۘۡ۟ۦۘۛ۠۫ۙ۬ۥ";
                                        case -1015518502:
                                            str31 = strArrSplit[1].equals("expand") ? "ۦۖۨۗۚۢۜ۠ۦۘۙ۬ۘۗۡۘ۠ۤۦ۟ۛۧۚۧ۠ۙۙۜۘۚ۟۠ۜۡۦۡۗۙۜۡۨ۫۟" : "ۖۥۚۜۦۦۘۘۥۤ۫ۘۖۘۧۧۘۘۡ۬ۖۘ۠ۛۤ۫ۡۨ۠ۛۨۘ۬۬۠ۙۧۖۘۤ۬ۧۤۛۘۦ۟ۥۘۜۦۗۥۢۤ";
                                        case -20305511:
                                            str30 = "۬ۙۥۨۤۧۦۖۡۘۖۗۨۡۨۦۘ۠ۧۦۘۗۛۚۘۘ۫ۥۖۦ۬ۦ۟ۢۖۖۘ۠ۤ۟ۢۢۥۦۢۦۜ۬ۨۨۧۖۘ";
                                            break;
                                        case 1776375900:
                                            str30 = "۠ۖۦۘۜۗۜۘۗۥۘۖۘۗۘۙۢۦۚۡۦۜۚۥۨ۫ۡ۟ۘۘۥۛۗۡۖۨۘ۬ۨ۬";
                                            break;
                                    }
                                }
                                break;
                            case 1669173225:
                                str3 = "ۗۧۘۚ۬ۚ۬ۖۨۘ۟ۨۙۨ۠ۘۘ۫ۖ۬ۤۙۡۘۨۢۖۘۤ۠ۢۧۡۦۘۘۤ۠ۨۖ";
                                break;
                            case 2008582516:
                                str30 = "۟ۦۖۦۘۨۥ۠ۙۤۥۦ۟ۦۘۜۥۤۡۘۦۡۘۧۖۧۜۘۗ۟";
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case 1056852548:
                    String str32 = "ۚۨۥ۬ۨۘۡ۠ۢۦۘۦۙ۟ۡۙۙۡۘۛ۫ۗۖۤۚۜۚۤۨۥۘ۬ۜۦۘۗۜۦۡۤۨۘۜۨ۬ۜۜۘۤۡۨۥ۠ۢۧۤ";
                    while (true) {
                        switch (str32.hashCode() ^ (-1936991447)) {
                            case -1745324760:
                                str3 = "ۙۢۥۗۖۦۤۡۥۘۧۖۜۘۚ۟۠ۤ۠ۙۧۗ۟ۗۦۧۛۧۘۛ۟ۙۦۖۛ۟ۛۡۜۘۦۡۡۢۚۡۘۨۦۡۡ۟ۦ۫ۙۚ";
                                break;
                            case 1246457412:
                                String str33 = "ۥۘۗۗۥۨۧۧۦۘۘ۫ۙۚۗۗ۬ۛۡۘۚ۬ۥۗ۬ۙۖ۫ۢۡۛۥۘ۫ۥۖۘ۬ۡ۟";
                                while (true) {
                                    switch (str33.hashCode() ^ 2043359266) {
                                        case -2136728984:
                                            str32 = "۬ۙۘۘۨۥۧۥۚ۠ۙۙۨۦۜۨۖۗۖۚۜ۫ۜۛۙۗۧۧۜ۟ۦ";
                                            break;
                                        case -458297182:
                                            str33 = "ۘۜۗۗۘۙۖ۬ۡۥۙۦۜۗۛۜۗۜۖۗۥۥ۬ۥۜۧۜۧۗ۬ۘۘۥۘۛ۟ۘۢۡۙۤۧۨ";
                                        case 67256:
                                            str32 = "ۨۗۖۦۡۗۢۧۡۘۗۛۖۛۚۛۙۗۗ۬۠ۙۛۚ۠ۡۧۙۖۨۖ۟ۤۛۨۜ۬ۙۦۢ۠ۥۡۘۢۙۥ۟ۛۖ۟۠۟ۦۗ۟";
                                            break;
                                        case 1213866117:
                                            str33 = strArrSplit[0].equals("data") ? "۟ۛۦۘۜ۬ۢۡۖ۬ۤۡۜۘۗ۠ۚۛ۟ۜۘۗ۠ۨ۠ۛ۟ۤۜۙۚ۟ۜ" : "ۥۘۖۧۛۦۘۖۥۖۗۛ۠ۗۧۜۘۢۗۘۘۦ۫ۛۤۡۘۡۨۧۘۤ۟۟ۖۗۦۡۙۥۘ۠ۢۧۤۥۚۚۖ۫ۥۧ۟";
                                    }
                                }
                                break;
                            case 1491377907:
                                break;
                            case 1641285097:
                                str32 = "۟ۧۨۘۤۤۧۤ۫ۘۘ۠ۡۡۘۚ۬ۤۧۢۨۖ۬ۜ۟ۚۚۨ۠ۘۘۧۘۤ۟ۛۨۡۜۥۘ";
                        }
                    }
                    break;
                case 1293716618:
                    String str34 = "ۖ۬ۚۤۖ۬ۢ۠ۥۦۘۥۗۜۡۗۙ۠ۢۜۤ۫ۗۦۘۧۧ۫ۙۖۧ";
                    while (true) {
                        switch (str34.hashCode() ^ (-274011444)) {
                            case 372278127:
                                String str35 = "ۢۢۢۧ۟ۖۘ۬ۘۗۖۗۛ۫ۜ۠ۚۦ۫ۚۥۨۘ۬۠ۦۡ۟ۘۧ۫۫";
                                while (true) {
                                    switch (str35.hashCode() ^ 1947367086) {
                                        case -1067007142:
                                            str35 = "ۢۖۛۙۧۛۜۘۘ۬ۖۘۜ۟ۡۘۤۛ۟۬ۚۙۢۖۡ۠ۤۙۘۨۘۚۤۢۡۤۡ";
                                        case -248831961:
                                            str35 = strArrSplit[3].equals("app") ? "ۨۗۦۘۚۙۦۘ۬ۜ۬ۢ۟ۢۦۨۘ۠ۗۧۘۡۨۘۘۥۥۘ۫ۛۜۢۛۢۨۦۘۘۡۥۡ" : "ۙۧۦۚۗۖۘۘۢۜۧ۬ۦۘۚۥۖۘ۬ۨ۫ۚۚۚۨ۟۟ۨۘۢۡۥۡۨۧۤۗۥۥۘ۠ۤۤ۬ۖۦۘۧ۬ۦۘۨۨۡۚ۟ۨ۠ۦۜ";
                                        case 18181488:
                                            str34 = "ۙۜۡۦۚۜۧۚ۫ۜۨۨۛۙۖۤۥۜۜۢۙۜۘۨۘۚ۬۫ۜۖۢۛۦۦۘۗۙۙۢۗۙۢ۬ۡۘ۠ۡۙۘ۬";
                                            break;
                                        case 1348641759:
                                            str34 = "ۗۥۘۙۚۚۘۦۦۘۡۧ۬ۗ۬ۥۘۨ۫ۘۘۜۛۥۘۜۦۧۘۗۦۖۘۤ۟ۤ";
                                            break;
                                    }
                                }
                                break;
                            case 421964872:
                                break;
                            case 811092224:
                                str3 = "ۜۦ۠۫ۤۨۘۦۦۧۘ۠ۦ۫ۨۘۜ۠ۨۘۦۚۖۘۛۥۗۦ۟۫۟۬ۙۛۢۘۧۥۥۘ۟ۗۥ۟ۘۡۘ";
                                break;
                            case 1880544741:
                                str34 = "ۗۡۧۘۦۖۨۨۖۥ۫ۥۨۘ۫۫ۨۙۖۤۧۚۤ۬۫ۘ۫۫ۧۨ";
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case 1485731814:
                    String str36 = "۟۫ۤۦۙۡ۬ۦۧ۬۬ۥۘۨ۬ۘۚ۟ۙۧ۬ۨۛۖۖۙۙۧۚۘۖۘ";
                    while (true) {
                        switch (str36.hashCode() ^ (-1158298317)) {
                            case -779847850:
                                String str37 = "ۧۘۚ۫ۗۖۛۤۥۘۛۨۚۜۦۦۖۥۥۘۗۘۡۘۨۛۦۧۚ۠ۨۦۖۜۢۥۢۜ۟۠ۤۥۘۢۖ۫ۥۘ۫ۛۤ";
                                while (true) {
                                    switch (str37.hashCode() ^ (-426107792)) {
                                        case -1293848081:
                                            str37 = strArrSplit[0].equals("data") ? "ۢۢۢۚۘۡۘۤۨۘۜۗۧ۟ۨۛ۬ۗۗ۠۬ۛۚۗ۟۟ۘۥۘۘۤۤ" : "ۖۨۧۨۚۘ۟ۛ۬ۧ۟ۖۘۙۨ۬ۚۙۤۛۖۙ۬ۦۥۘ۠ۧۗۨۡۗۚۖۨۘ۬۬ۨۘۤ۠۬ۚۘۗ";
                                        case -662210560:
                                            str37 = "ۖ۬ۨ۬ۤۨۘۙۖۜۘۛ۟۠ۨۨۡۘ۠۟ۖ۫ۥۢۜۧۘ۬ۥۜۘۚ۬ۖۘ۟ۖۖۘۘۧۘۘۛۜۥۦۜۙ";
                                        case 8875725:
                                            str36 = "۫ۖۤۦۖۧۙ۠ۨۘۥۖۧۨۘ۫ۦ۬ۧۚۥ۠ۘۙۦۡۖۘۥۧۥ";
                                            break;
                                        case 1190907356:
                                            str36 = "ۘۙۛۧۧۜۖ۠۫۟ۡ۬ۛۛۡۘۡ۟ۜۘۚۗ۫ۗۧ۬ۛۜۥۖۡۘۥ۬ۦۘ۫ۥۖۤۨ۫ۦۦۗۤۤۛۙۘۖ";
                                            break;
                                    }
                                }
                                break;
                            case 518593231:
                                str36 = "ۖ۬۫ۙۛۗۜۡۘۖۤۘۘۥۡۨۙۡۜۘۗۛۛۦۤۦۘۛۢۥۡۗۡ";
                            case 1731823716:
                                break;
                            case 1965861334:
                                str3 = "ۥۗ۟ۘۨۜۜ۠۬ۙۛۧ۠ۡۡۖۛۖ۬ۜۙۖۚۗ۠ۢ۬۬۬ۨۘۥۜۛ۫ۢۖ";
                                break;
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case 1692442217:
                    str3 = "ۜۨۧۙۨۥۘۥ۠ۦۥۢۜۖۖۨۦۛۗۘۤ۠ۙ۟ۜۡ۟ۜۥۥۡۘ۬ۦۦ۬ۡۘۤۗۡۘۛۥۡ۟ۛۖۘۖۦ۫۟۬ۦ";
                case 1827455305:
                    return false;
                case 2029963176:
                    String str38 = "ۥۤۜۘۧ۫ۦۘۚۘۜۢۖۘۗۡۥۙۙۦۜ۟ۜۨۦۦۘۜۧ۟ۜۥ۫۫ۙۥۘۖۖ۠";
                    while (true) {
                        switch (str38.hashCode() ^ 1108805542) {
                            case -892401090:
                                str3 = "۠ۘۛۡۢۧۢۤۨۖۦۖۧۥۖ۠۠ۥۢۖ۫ۤۛۛۜۜۡۦۖۖۘ";
                                break;
                            case -486555188:
                                String str39 = "ۨۧۦۙۢۛۦۦ۬ۤ۫ۥۗۨۡۘۖ۟ۖۘۧۡۘۤۙ۟ۖۖۧۘ";
                                while (true) {
                                    switch (str39.hashCode() ^ (-1900776029)) {
                                        case -997179915:
                                            str38 = "ۦ۟ۥۙ۟ۤۖۦۡۗۨ۟ۘ۬ۖۧۘۘ۟ۦۘۜۢۨۢۧۘۜۦۜۘ۠ۚۧۖۘۨ۠ۛۧۗۦۘۙۜۙ۟ۦۛۛ۠ۥۥۖۢ";
                                            break;
                                        case -654539506:
                                            str39 = strArrSplit[0].equals("mnt") ? "۫۫ۧۢۙۦۘۗۗۘۧ۬ۨۗۚۚۢۥۖۘۜۡۤۜۢۘۘۨۚۜۘۤ۠ۖۘۢ۬ۚۜۙۜۗۢۜۦۦۖ" : "ۤۛ۟ۛ۟ۚۨۜ۫۫۟ۖۧۦۥۧۙۥۘۖۘۜۜۙ۬ۙ۟ۖۦۙۜۘ";
                                        case 1394650983:
                                            str39 = "ۡ۟ۛۗ۟ۥۘۙۖۦ۟۠ۡۢۚ۠ۨۤ۠ۙۚۥ۫۟ۥۜۚۘۙۘۦۘ۫ۡۥۘۤۤۤۖۡۤ۬ۧ۬ۦۨ۫۫ۥۥۘ";
                                        case 1501541659:
                                            str38 = "ۢ۫ۖ۬ۜۨۤۖۛ۠ۜۡۘ۠ۗۨۡۦۨۥۨۘۘۛۚۘ۠ۜۘۢۚۚۨۡۢۦ۠۫";
                                            break;
                                    }
                                }
                                break;
                            case 941583559:
                                break;
                            case 978980799:
                                str38 = "ۦۨۜۧۡ۫ۥ۠ۖۘۥۥۤۧۥۨۧۧۡۘۥۙۙۦۜۨۘۛۢۥۢۡۘۦ۟ۖۘۨۤۥۢۛۘۘۨۛۥۘ";
                        }
                    }
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
                    break;
                case 2056445362:
                    return strArrSplit[length - 2].startsWith(str);
                case 2089193535:
                    str3 = "ۥ۫ۗۙۤۖۘ۟ۜۛۨۖۢۜۤۨۢۘۨۘۛ۫ۨۖ۟ۜۘۧۘۨۘۨۚۗۗ۬۠ۡۗ";
            }
        }
    }

    public static void killOpen(Context context, String str, boolean z) throws IOException {
        int i;
        int i2;
        try {
            System.loadLibrary("yzrSignatureKiller");
            PrintStream printStream = System.out;
            printStream.println("[菜鸟云验证] 加载 SO 成功");
            String str2 = "ۘ۟ۛۤۨ۠۬ۤ۠۠ۚۚۡۨۡۛۥۦۗ۬ۨۘ۫ۛۧ۬ۚ۟ۜۡ۟ۛۜۥۘۤ۫ۦۘۧۚۘۘۜۗۦۘۙۜۙۙۗ۫";
            while (true) {
                switch (str2.hashCode() ^ (-1731325423)) {
                    case -480319796:
                        String str3 = "ۛۘ۬ۦۤۖۘۗۖۙ۟ۜۢۘ۟۬ۗۡۚ۬ۧۥۖۢۥۤۜ۬ۛۡۚۙۛۤۦۜۘۤۧۙۡۗ۠ۡۘۗۜۛۛۥۡۥ";
                        while (true) {
                            switch (str3.hashCode() ^ (-1950544633)) {
                                case -2091768145:
                                    str2 = "۫ۙۘۘۚۚۘۥۡۨۘۛۥۨ۟ۧۘۘۗۢۤ۬ۦۜۘ۬۬ۜۘۛ۬ۥ۫ۡۚۙۧ۬ۗۨۧۧۘۘۤ۫ۡ";
                                    continue;
                                case -1147405041:
                                    str3 = "ۥۢۙ۫ۨۦۘۖۙۡۛۘۥۢ۫ۖۚۥۥۘ۟۫ۤ۟ۧ۫ۡۚۧۖۖۧۘۢۖۥ۟ۘۨۗۘۥ۟ۦۡۘۤۤۦۦۛۥۘ";
                                    break;
                                case 396704342:
                                    str2 = "ۨۨۙ۟ۦۖۗۖ۠۬ۙۦۚۡۘۥۗۗۧۨۚۤۙۚۜۢۚۖ۫۟۫۠ۛۡۖۧ۬۟ۛۧۥۗۥۚۙۚۤۨۡ۠ۦۨ۟ۘ";
                                    continue;
                                case 860267554:
                                    if (!z) {
                                        str3 = "ۤۚۥ۠۬۬ۜۦ۠ۗۤۨۛ۫ۚۖۘۢۗۖۘۦ۬ۜۙۛ۬۬ۜۢ";
                                        break;
                                    } else {
                                        str3 = "ۜ۬۫ۡۘ۬ۢ۟۠۫ۖ۬۟۬ۙ۠ۛۥۘۛۧۛ۟ۥ۬ۧۙ۫ۡۥ۠۫ۦ۟ۜ۫ۡۘۨۚۧۡ۟ۘۘۢۧۛۛۖۨۖۡۜۘ۬۠۟";
                                        break;
                                    }
                            }
                        }
                        break;
                    case 942036411:
                        Toast.makeText(context, "加载 SO 成功", 0).show();
                        break;
                    case 956666212:
                        break;
                    case 1919141223:
                        str2 = "ۗ۠ۧۖۡۖۘ۟ۗۦ۟ۧۨۘ۬ۧۨۘ۫ۤۖۛۨۗ۟ۛۚۦۛۜۘۢۦۚۗۨ۫ۜۖۨۘ";
                }
            }
            String apkPath = getApkPath(str);
            String str4 = "ۖۛۖۘۖۢۨۘۘۙۨۘ۟ۤۜۘ۫ۢۘۘ۫۟ۖ۟ۧ۟ۖۗ۠۟۠ۨۛۗ۬ۙۗۚ۫ۥۘ۬۠ۥۢ۠ۤ۬ۥۥۨ۬ۢ";
            while (true) {
                switch (str4.hashCode() ^ (-1890981039)) {
                    case -1953090015:
                        String str5 = "۟۫۠ۨۢۦۘ۫ۦۦ۠ۖۖۧۧۗۙۡۢۚ۠ۡۘۦۦۤۥ۠ۦۘۙۥۦۘۦۡۡۗۗ";
                        while (true) {
                            switch (str5.hashCode() ^ 113603106) {
                                case -2018792257:
                                    str4 = "ۘۗۖ۟ۤۛ۟ۙۨۘۦ۟ۤۤۖ۬ۦۥ۠ۤۥۧۘۛۧۦۘۗۗۡۘ۬ۛۘ۟ۨۚۖ۟ۗۙۥۥ۟ۥ۠ۧ۬ۖۙ۠ۧۤۢۤۡ۠ۚ";
                                    continue;
                                case 133061345:
                                    str5 = "ۙۙۚ۠ۛۚۨۙۜ۬ۜ۫ۚۥۘۘۙۘۧۙۢۚ۬ۧۖۨۘۢۚۦۥ۟ۢۦۤۦۦ۫ۙۡۧۙۧ۫ۛۜۚ۬";
                                    break;
                                case 1666062272:
                                    str4 = "ۨۜۨۗ۫ۘۘ۠ۜ۟ۚۜۦۘۜۙۙۖۧۢ۠ۚۚۡۘۧۘۚۖ۫ۖۧۘ";
                                    continue;
                                case 2022521102:
                                    if (apkPath != null) {
                                        str5 = "۟ۜۧۨ۠ۜ۫ۧۗۨۥۘ۠ۤۖۘ۠ۘۧۘ۟ۡۧۧۗۘۦۥۢۙۛۜۘۥۡۘۚۡۖۚۜۖۘۚ۫ۚ";
                                        break;
                                    } else {
                                        str5 = "۫۟۬ۤۜۖۥۛ۠ۗۖۧۡۤۖۘ۬ۡۡۤۙۖۡۛۡۘۛۘۖ۫ۘۘۘۦۖۖۘ۟ۨۧۘ";
                                        break;
                                    }
                            }
                        }
                        break;
                    case -1889580438:
                        File file = new File(apkPath);
                        File file2 = new File(getDataFile(str), "origin.apk");
                        try {
                            ZipFile zipFile = new ZipFile(file);
                            try {
                                String strDecrypt = "assets/yunzhuru/origin.apk";
                                ZipEntry entry = zipFile.getEntry(strDecrypt);
                                String str6 = "۟ۢۙۙۜۦۘۛ۟ۘۘ۟ۤۥۥۦۘۡۦۤۥۧۗۛۚ۫۠ۘۖ۠ۚ۫ۥۧۘۢ۬۠";
                                while (true) {
                                    switch (str6.hashCode() ^ 2032845596) {
                                        case -2057164319:
                                            String str7 = "ۚۚۡۘ۬۫۟۬۬ۦۚۥۜۥۚۖۘۨۚۚۢ۟۟ۨۡۘۘۥۨۘ۟ۗۤ۟ۘۢۙ۬ۡۘۢۤۛۨۦ۬";
                                            while (true) {
                                                switch (str7.hashCode() ^ (-758452225)) {
                                                    case -203039840:
                                                        str7 = "ۘ۫ۛۗۙ۠۫ۘۥۘۘۙۧۙۖۗۜۡۤۥۙۨۘۤۚۖۘ۬ۗۚ۬۬ۜۥ۠ۜۘۦ۫ۡ۟ۨۘۤۜۖۚۖ۠ۧۡۧۘ";
                                                    case 874410438:
                                                        String str8 = "ۧۥۗۥۖۥۘۙۚۥۘۛ۫ۡۘ۟ۛۘۘ۬ۡۘ۠۫ۡۜۦۥۘ۫ۜۛۡۖ۬ۥۚۤ۬ۜۧۘ";
                                                        while (true) {
                                                            switch (str8.hashCode() ^ 1173720488) {
                                                                case -692851340:
                                                                    str8 = "۬ۡ۟ۨۚ۫ۧ۠ۙۡۙۘۛۙۚۚۥ۟ۙۤۤۙ۠ۛۢۖۗۗ۟۫ۥ۬ۦۙۛۘ";
                                                                case -232932925:
                                                                    printStream.println("[菜鸟云验证] origin.apk 已存在且大小一致" + strDecrypt);
                                                                    String str9 = "ۙۛۖۘۜۤۢۘۖ۟۟ۤۘۘۖۢۘۘۙۧۨۘۚ۫ۨ۬ۙۥۢۗۜۘۧ۫ۦ۠ۛۖۥۗۨۦۨۤۦۛ۬ۦۘۨ۟ۧۘۤۨۘۥ۠ۤ";
                                                                    while (true) {
                                                                        switch (str9.hashCode() ^ (-449237018)) {
                                                                            case -935875379:
                                                                                Toast.makeText(context, "origin.apk 已存在且大小一致", 0).show();
                                                                                break;
                                                                            case -600939706:
                                                                                break;
                                                                            case -564419940:
                                                                                str9 = "ۤۗۙۘۚۖۛۤۨۘۛۙ۫ۚۦۤۗۛ۠۫ۖ۬ۚۖۦۛۘۤۗۨۡۘۘ۟ۤۘۧۨۚۚۤ۠ۘ۟ۛۛۧۧۙۨۢ۫۫ۥۛۙ";
                                                                                continue;
                                                                            case 1712179571:
                                                                                String str10 = "ۚۛ۠ۚ۬ۦۜۢۤۢۜۚ۟۟۟ۗ۫ۥۤۛ۫ۤۥۡۘ۠ۡۧۘۨ۟ۡۘۛۘ۬ۥۧۗ";
                                                                                while (true) {
                                                                                    switch (str10.hashCode() ^ (-907852821)) {
                                                                                        case -1430920542:
                                                                                            if (!z) {
                                                                                                str10 = "۬ۦۧ۫ۛۗۨۢۜۘۘ۫ۛ۠ۧۨۘۚۤۖۚ۫ۛۡۤۛۢۨۨۘۜۗۙۚ۬ۙۗۡ۟ۦۘۛۖۤۦ۬ۡۜۧۦۘ";
                                                                                                break;
                                                                                            } else {
                                                                                                str10 = "ۚۜۜۘۘۥۨۘۛۙۨۛۢ۟ۦۢۚۤۜۙ۠ۛۙ۟ۦۦۘۥ۬ۡ۟ۜۚۧۦۘۢۤۖۘ۠ۤۡۘ۬ۛۡ";
                                                                                                break;
                                                                                            }
                                                                                        case -555654041:
                                                                                            str9 = "ۛۦۡۘ۟ۧۦۘ۟۠ۖۘۚۙۚۢۧۖۘۖ۠۟۫ۗۘۢۙۛ۬ۙۘۚ۫ۛ۠۬ۡۦۛۥ۟ۜۥۧۛۘۘۛ۫ۘۜۧۛ";
                                                                                            continue;
                                                                                        case -259392793:
                                                                                            str9 = "ۧۛۚۚ۟ۚۨۢ۬۫ۙۨۘ۟۠ۖۘۤ۠ۚۧۗۖۤۛۗۥۨۨ۬ۜۦۘۦۚۙۙۛۜۘۖ۠ۤۚۢ۬ۛۡۡۘ۬ۘۡۘ";
                                                                                            continue;
                                                                                            continue;
                                                                                        case 2096234435:
                                                                                            str10 = "۠ۙۨۘۛ۫ۡۘۤۗۦۗۧۤ۠۟۬ۦۖ۬ۖۡۥ۟ۙ۠ۜۥۦۧۡۜۘۡۛۥۘ۠ۖۧۘۛۜۛ۬ۢ۬ۙۗۚۤ۫";
                                                                                            break;
                                                                                    }
                                                                                }
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1560476727:
                                                                    String str11 = "ۚ۠ۖۘۨۘۨۘۦ۫ۥۘۛۢۡۦۦۦۘۖ۠ۦ۫ۧۜۘ۟ۡۚۤۡۡۢۢۛ";
                                                                    while (true) {
                                                                        switch (str11.hashCode() ^ 320933989) {
                                                                            case -971127166:
                                                                                if (file2.length() == entry.getSize()) {
                                                                                    str11 = "ۧۖۧۘ۬ۧۡ۠ۘ۬ۧ۟ۜۘۨ۫ۢۜ۬ۡۘۡۛۡۘ۟۫ۨ۬ۚۡۧۙۧ";
                                                                                    break;
                                                                                } else {
                                                                                    str11 = "ۛۧۧۘۡۡۘۨۨۨۦۘۖۦۛۥۚ۬ۘۘ۬۫ۗۖ۠۬ۘۤۜۘ۟ۘۢۨۥۛۖۛۦ";
                                                                                    break;
                                                                                }
                                                                            case -574669046:
                                                                                str11 = "۬ۘ۬ۖۙۥۘۥۨۧۘۗۗ۠۟۬ۨ۬ۚۜۘ۟ۢ۬ۚۖۥۘ۟ۥۘ۬ۙۘ";
                                                                                break;
                                                                            case -347781044:
                                                                                str8 = "ۚۡ۫۬ۖۛۨۖۛۧ۬ۤۜۛۙ۫ۘۥۘۦۜۖۗۧۡۢۡۜۘۤۨۖ";
                                                                                continue;
                                                                            case 1643328647:
                                                                                str8 = "ۖ۟ۢۧ۬ۖۘۢۚ۫ۥ۟ۙۘۧۧۛ۫ۘۘۡ۬ۦۜۦۙ۟ۖۖۘۡۧۡۤ۫ۨۘۨۙۖ";
                                                                                continue;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1949609457:
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1592867384:
                                                        break;
                                                    case 1951527500:
                                                        String str12 = "ۢۦۘ۫ۘۖۙ۫ۖۘۚۖۙۖۦۘۤ۫۬ۚۖۡۘۨۚۤۘۛ۟۬ۘ۠ۦ۟ۜۨۡۨۘ۠۠ۤۦۛ۬ۡۘۛۚۙ۟";
                                                        while (true) {
                                                            switch (str12.hashCode() ^ (-1420273848)) {
                                                                case -351092242:
                                                                    str12 = "ۤۦۡۛ۠۫۟ۛۦ۠۟ۧۤۜ۠ۡۢۘ۟ۦۨۘۜ۠ۗۛۡۖۘۛۥۧ۠ۤۨۘۧۨۤ";
                                                                    break;
                                                                case -332127734:
                                                                    str7 = "ۡۜۗۡۡۦۡۨۖۡۗۦۛ۠ۖۘۥۚۨ۬ۥۘۘۧ۫۬۠ۜۜۥۙۜۘۦۗۧۘۨ۬ۗ۠۬۠ۥۥۘۘۗۘۤ۫ۚۧۖ۫ۚۘ۬";
                                                                    continue;
                                                                case 941882134:
                                                                    str7 = "ۙۖۜۡۜ۫ۨۦۨۗۥۘ۫ۖۜۘ۠۬۬ۜۘ۠ۡۘۗۢۜۘۦ۬ۘۜۜۥۡ۫ۗۤ۠ۧ۫ۧۙ۠۠۠ۤۖۧ";
                                                                    continue;
                                                                case 1299885981:
                                                                    if (!file2.exists()) {
                                                                        str12 = "ۚ۫ۢ۬ۘۥۡۡۗ۠۟ۜۘۦ۠ۜ۬۠ۙۘۜۡۘ۫ۗۜ۟ۖۦۘۚ۬ۡ۟ۗۨۘ۫ۡۗۜۥۖۡۙ۬ۡ۠ۢ۠ۨ۫ۢۛۖۙ";
                                                                        break;
                                                                    } else {
                                                                        str12 = "۟ۡۖۘ۠ۨۦۘۧۧۗۥۛ۫ۧۤۡۘۘۦۧۥۖۨۘۧ۠۬ۧۘۜۜ۫۬ۦۙ۫ۖ۟ۛۜ۬ۖۘ۠ۙۡۘۤۨۤۥۖ۠";
                                                                        break;
                                                                    }
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            InputStream inputStream = zipFile.getInputStream(entry);
                                            try {
                                                FileOutputStream fileOutputStream = new FileOutputStream(file2);
                                                try {
                                                    byte[] bArr = new byte[102400];
                                                    while (true) {
                                                        int i3 = inputStream.read(bArr);
                                                        String str13 = "ۢۜۡۘ۠ۤۦۘۨۛۛۚۢۨ۫ۨۜ۬ۖ۫ۤۜ۟ۤۥۦۘۡۧۚۨۘۤۛۡۘۤ۠۠ۧ۟ۘۘۛۜۘۖۛۘۘۛۧۜ";
                                                        while (true) {
                                                            switch (str13.hashCode() ^ 956003486) {
                                                                case -1838032791:
                                                                    String str14 = "ۜۤۤ۟ۖ۫ۛۨ۠ۡۚۘۦۜۗۗۥ۫ۥۤۖۤۢۜ۬۬ۦۥۖۜۗۜۜۘ۟ۛۗ۬ۢ۟ۧۗۗ۬ۗۦۘۤۡۜ";
                                                                    while (true) {
                                                                        switch (str14.hashCode() ^ 701840565) {
                                                                            case -1885609725:
                                                                                str13 = "ۧۗۛ۬۫۬ۛۢۥۥۘۧۛ۠ۤۥۖۘ۬۫ۥۘۙ۫ۦۘۜۤۧۢۦۤۗ۬ۖۗۗۜۨ۠ۤۨۜۜ۫ۛۨۖۘ۠ۤۦۘۙۦۧ";
                                                                                break;
                                                                            case -981413641:
                                                                                str13 = "ۡۛۖ۟ۨۨۖۗۘۘ۠ۚۘۜۘۖۘۨۡۜۘۦۗۘۘۦۥۤۨۡۢۨۨ۫ۛۤ۫۠۫ۡ";
                                                                                break;
                                                                            case 501472967:
                                                                                str14 = "ۖۤۡۧ۬ۚۜۛۘۘۨ۫۫ۘۚۘۧۥۘۘۘۧۤۤۚۜ۫۟ۚۙۖۥۗۗۥۘ۫ۨۤ۠ۢۡۢۚۦۘۤۤۥۘ۟ۢۡۘ";
                                                                            case 1343630147:
                                                                                str14 = i3 != -1 ? "ۙۧۘۗۥۖۘۘۗ۫ۧۘ۟۬ۖۥ۠ۜۜۢۨ۠ۙۗۘۘۛۦۨۘۚۧۘۢۜۦۘۡۛ۠ۛۧۨۡ۬ۘ۫۫۠۠" : "۠ۛۘۘۘۘۦۦ۟ۦۘۖۜۥ۫ۦۧۙ۟ۖۡۧۘۖ۠ۖۢۦ۟ۗ۬۠ۤۥۧۗۤ۬ۤۛ۠ۥۢۦۘ۬ۥۘۗۢۛ۫ۙۡۥۡ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case -1396735517:
                                                                    str13 = "ۦۤۨۘۚۢۜۧۥۥۘۨ۫۠ۘۧۦۘۢۘۘۘ۬۠ۡۘۢۘۙ۠ۡۖۘۡۘۜۙۡۢۢۘۧۘۡۙۨ۠ۜ۠";
                                                                case -879704378:
                                                                    fileOutputStream.close();
                                                                    inputStream.close();
                                                                    System.err.println("[菜鸟云验证] origin.apk 提取完成" + strDecrypt);
                                                                    String str15 = "ۨۥ۟ۘۦۢۙ۬ۥۥۨۥۖۥۥۧۙۢ۫۠ۛۗۢ۬۟ۗۥۜۥ۫ۢۖ۠ۤۚ۠ۛۜۧۤ۬";
                                                                    while (true) {
                                                                        switch (str15.hashCode() ^ (-336456526)) {
                                                                            case -1505152674:
                                                                                Toast.makeText(context, "origin.apk 提取完成", 0).show();
                                                                                break;
                                                                            case -521608810:
                                                                                String str16 = "ۤۚ۬ۖۧۙ۫ۜۘ۫ۥۖۥۗۜۘۖۦۖ۠ۘۥ۠ۡۜۘۖ۬ۡۦۙۨ";
                                                                                while (true) {
                                                                                    switch (str16.hashCode() ^ 1835580099) {
                                                                                        case -1424072350:
                                                                                            str15 = "ۙۚۜ۠ۥۗۦۤۚۘۚۙ۫ۦ۬ۙۜۦۜ۠ۤ۟۬ۙۖۨۧۜۜ";
                                                                                            continue;
                                                                                            continue;
                                                                                        case -541539761:
                                                                                            str16 = "ۙ۟۠ۥ۬ۢۢۤۜۚۙۡ۟ۗۙۙ۟ۙۖۤ۠۬ۘۛۢۨۢ۟۬ۢۧۨۘۡۛۦۚۖۗ۬ۛۜۘۗۙۢۙۨۦۘ";
                                                                                            break;
                                                                                        case 422553728:
                                                                                            if (!z) {
                                                                                                str16 = "ۦۗ۬ۤۤۡ۟ۧۡۘۨۛ۬ۙ۠ۦۛۘ۠ۙۥۘۥۚۚۛۗۚۥۘ۠ۙۜۢۨۥۙۥ۠ۨۘۘ۬ۘۧۘۧۤۡۘ";
                                                                                                break;
                                                                                            } else {
                                                                                                str16 = "ۥۚۨۘۜۥۧۡۘۙۨۡ۠ۡۨۙۛۥۨۢ۟ۦۘۤۤۖۘۥۦۖۦۖۨۘ۫ۤ۟ۧۨۥۨۡۛۘۙ۫ۦۧۘۖ۫";
                                                                                                break;
                                                                                            }
                                                                                        case 1103613602:
                                                                                            str15 = "ۗۦۜۘۧ۬ۨۘۛ۬۟ۚ۠ۖ۫ۨۢۙۧۚۚۨۚۥۛۖۘۢ۬ۛۖۛ۫ۤۥۧۘۢۥ۫۬ۦۗۦۤۙ۫ۙۢ۟ۦۧۨۛۦۗۙۢ";
                                                                                            continue;
                                                                                    }
                                                                                }
                                                                                break;
                                                                            case 1599308815:
                                                                                break;
                                                                            case 2017845015:
                                                                                str15 = "ۨ۬ۦۦۘۧۘۢۡۖۘ۬ۘۧۘۘۜ۟ۡ۠ۖ۬۫ۗۛۥۘۚۦۘۘۗ۠ۖ";
                                                                                continue;
                                                                            default:
                                                                                continue;
                                                                        }
                                                                    }
                                                                    break;
                                                                case -283111440:
                                                                    break;
                                                            }
                                                        }
                                                        zipFile.close();
                                                        hookApkPath(file.getAbsolutePath(), file2.getAbsolutePath());
                                                        System.out.println("[菜鸟云验证] 调用 hookApkPath 完成");
                                                        String str17 = "ۛۦۘۘۘۖۘۘ۬ۨۛۗ۫۬ۖ۬ۦۚۚۖۚۖ۟ۚۜ۬ۚۧۥۗۘ۬";
                                                        while (true) {
                                                            switch (str17.hashCode() ^ (-240460376)) {
                                                                case -1447952168:
                                                                    return;
                                                                case -567183921:
                                                                    str17 = "ۛۖ۟۫ۦۘۨۡۘۙۧۘۘ۠ۦۡۨ۠ۖۘۤۛ۟ۚۗۦۘۢۥۘۙ۠ۥ۫۟۟ۥ۬ۖۘ۬ۜۥۘۦۛۖۘۛ۬ۥۦۖۡۘ";
                                                                    break;
                                                                case -301260630:
                                                                    String str18 = "ۦ۟ۥۘۚۧۖۡۨۥۨۨۘۦ۠ۖۘۧۙۖ۬ۙۘۤۥۤۨۜۧۗۛ۟";
                                                                    while (true) {
                                                                        switch (str18.hashCode() ^ 1103466364) {
                                                                            case -450854348:
                                                                                str17 = "ۧۙۤۚۦۢۧۨۥۘۖۦۗۤۥۘۡ۫ۤ۠۠ۨۘۦۙۘ۠ۚۦ۠ۜۥۢۥۡۖۥۢ۬ۤۘۜۗۖ";
                                                                                continue;
                                                                            case 761377241:
                                                                                str17 = "ۗۗۚ۫ۦ۫ۨۚۚۥۖۗۛ۬۫ۖۚ۬ۙۘۖ۠۟ۡۜۘۜ۠ۥ۟";
                                                                                continue;
                                                                            case 1620090122:
                                                                                str18 = "ۘۗۚۙۜۦۛۨۘۙ۬ۗ۠ۙۢۚ۬ۚۨ۬ۥ۠ۛۤۢۦۚۚۗۡۘۢۚۨۘۜۙۖ۬ۛۥۘ۫ۘۡۛۥۘ۟ۡ۟ۢۘۢۥۦ۠";
                                                                                break;
                                                                            case 1852892589:
                                                                                if (!z) {
                                                                                    str18 = "ۡۜۦۘۘۖۚ۟ۨۛ۟۬۬ۧۛۦۨ۟ۢۡۛۧۘ۟۟ۚۦ۫ۢۡۦ";
                                                                                    break;
                                                                                } else {
                                                                                    str18 = "ۥۙۢ۫ۨ۬ۜۙۘۛۦۖۛۥ۠۫ۙۨۧۜۡۧۥۤۖۗ۬ۜۡۖۘۛۚۦۘۥۢۧ";
                                                                                    break;
                                                                                }
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1155381284:
                                                                    Toast.makeText(context, "调用 hookApkPath 完成", 0).show();
                                                                    ((ClipboardManager) context.getSystemService("clipboard")).setPrimaryClip(ClipData.newPlainText("apk path", "原路径" + file.getAbsolutePath() + "，新路径" + file2.getAbsolutePath()));
                                                                    return;
                                                            }
                                                        }
                                                        fileOutputStream.write(bArr, 0, i3);
                                                    }
                                                } finally {
                                                }
                                            } finally {
                                                while (true) {
                                                    switch (i) {
                                                        case -1223359710:
                                                            break;
                                                        case -941816750:
                                                        case 393281306:
                                                            while (true) {
                                                                switch (i2) {
                                                                    case -1595475507:
                                                                        continue;
                                                                    case -249795044:
                                                                        break;
                                                                    case -246241698:
                                                                        continue;
                                                                    case 273407080:
                                                                        if (inputStream == null) {
                                                                            break;
                                                                        } else {
                                                                            break;
                                                                        }
                                                                }
                                                            }
                                                            break;
                                                        case 2114917525:
                                                            try {
                                                                break;
                                                            } catch (Throwable th) {
                                                                break;
                                                            }
                                                    }
                                                }
                                            }
                                            break;
                                        case -557611381:
                                            printStream.println("[菜鸟云验证] origin.apk 文件不存在" + strDecrypt);
                                            String str19 = "ۙۡۡۙۤۦۘ۠ۘۨ۬ۦۦۘۖۙۖۘۘ۠۫ۢۖۥ۬ۤۗۤۢۤۡۡۨۗۘۖۘۡۧۚ۬ۤ۠ۛ۬ۤ";
                                            while (true) {
                                                switch (str19.hashCode() ^ (-1194748896)) {
                                                    case -1690308868:
                                                        break;
                                                    case -1221444140:
                                                        String str20 = "ۧۡۤۢ۟ۙ۟ۜۜۘۖ۬ۦ۫ۚۛۡۨۦۘۡۖ۟ۚ۠ۖۘۨۦ۠۬ۘ۫۫ۧۡۘ۬ۙۜ۟ۚۦۨۨۘ";
                                                        while (true) {
                                                            switch (str20.hashCode() ^ (-1960029631)) {
                                                                case -1829721364:
                                                                    str19 = "ۙۛۘۘۨۡۚ۬ۖۘ۠ۡۖۘۖۢۙۡۥۤۧۙۖ۟۬ۖۛۢۛۛ۠ۜۡۥۢۙ۠ۖۤۥۧۘ۫ۨۜۡۧۜۘۛ۬ۘ۫ۧۜۙ۫";
                                                                    continue;
                                                                case -1794595474:
                                                                    str19 = "ۧ۟ۨۘۖۨۧۛۛۢۘۚ۬ۥۡۘۢ۫ۦۘۜۨۦۘ۬ۢۨۢۚۘۘۘۥۨۘ۬ۙۦۘۡۜۜۘ";
                                                                    continue;
                                                                    continue;
                                                                case -334219175:
                                                                    str20 = "ۧۧۙۧۙۦۖۗ۟ۦۚۧۖۛۘۘۦۙۖۘۗۤۥۜ۠ۖۢۛۦۦۚۖ۠ۨۚۨۘۥۧ۠۬ۤۖۡۨۥۘۢۜۖۘ۠۬ۛ۬ۛۨۘ";
                                                                    break;
                                                                case 1363528859:
                                                                    if (!z) {
                                                                        str20 = "ۜۘۙۦۗ۬ۚۤۗۤ۫۫ۤۥۚۧۦۨۡ۫ۢ۟ۚۜۘۜۘۨۘۘۥۨۘۦۨۥۘۖۛۘۘ";
                                                                        break;
                                                                    } else {
                                                                        str20 = "ۡۥۖۘ۠۬ۥۘۜۖۡۘۖ۠ۤۗ۠ۛۧۥۧۘ۫ۥۗۙ۬ۜۗۙۖۦ۬ۢۖۗۢۜۤۘۘ";
                                                                        break;
                                                                    }
                                                            }
                                                        }
                                                        break;
                                                    case -210571998:
                                                        Toast.makeText(context, "origin.apk 文件不存在", 0).show();
                                                        break;
                                                    case 948736349:
                                                        str19 = "۬ۡۥۘۚۨۢ۫ۛ۫ۙۧۖۘۜۙ۫۬ۦۛۛ۠ۛۤۙۗۧۗۦۘ۬۟۫۬ۤۛۤۘۜۥ۟۟ۧۡ";
                                                        continue;
                                                    default:
                                                        continue;
                                                }
                                            }
                                            path();
                                            System.err.println("[菜鸟云验证] Entry not found: " + strDecrypt);
                                            zipFile.close();
                                            return;
                                        case -200642305:
                                            String str21 = "۫۠ۨ۬ۜۖۘۙۘۖۧ۟ۖۥۖۙۨ۫ۙ۬۟ۦۨۧۘ۬ۤ۬ۤۗ۬۟ۨۧۗۨۨۘۡۤۘۘ۟ۖۥۘ";
                                            while (true) {
                                                switch (str21.hashCode() ^ (-137560575)) {
                                                    case -2132076545:
                                                        str21 = "ۨۤۖۘ۫۬۬ۨۚۧۤۙۙۥۙ۠ۦۜ۟۠ۙۥۢ۫ۚ۫۬ۛ۫";
                                                        break;
                                                    case -1604693024:
                                                        str6 = "۬ۡۦۨۘ۠۠ۧۨۜۘۤۤ۬ۖۢ۫ۡۗۥۖ۬ۡۥۥۢۧۜۚۘۡۡۘۛۡۢۚۚۛۨ۠ۤ";
                                                        continue;
                                                    case -98430546:
                                                        str6 = "ۥۦۛ۫ۘۡۢۗۨۘۤۥۜۛۤ۟ۛۛۡۘۛۖۜۘۖۥۥۘۗۨۧۘ۟ۢۚۘۡۥۘ۠ۥۡۨۨۙ۟ۙۤ";
                                                        continue;
                                                    case 763903558:
                                                        if (entry != null) {
                                                            str21 = "ۤ۫ۦۘ۫۠۟ۛۡۗۢ۬ۚۘۙۚ۬۬ۧ۫ۤۖۘۘۚۘۘۜۜۢۤۧۙۘۙ۫ۘۖۚ";
                                                            break;
                                                        } else {
                                                            str21 = "ۢۙۡۘۗۙۥۘۚ۠ۥۘۛۢ۬ۜ۬۠ۦۖۨۙۤۡۖ۬ۙۦۛۤۦۘۢ۬ۤۜۘۚ۫۠ۦۡۚۧۛۘۤۤۘۘ۠ۙۘ";
                                                            break;
                                                        }
                                                }
                                            }
                                            break;
                                        case -190729158:
                                            str6 = "ۡ۠ۨۘۦۧۙۙۦۦۘۦۧۚ۫ۗۥۘ۠ۢ۟ۗۜۥۤۦۤۜۡۘۧۡ۠ۗ۠ۙۙ۟۫";
                                    }
                                }
                            } finally {
                            }
                        } catch (IOException e) {
                            System.out.println("[菜鸟云验证] 读取 origin.apk 失败");
                            String str22 = "۠ۤۡۘۖ۠۬ۤۤۚ۠ۨۥۗۛۥۖۛۘۜۥۢ۬ۡ۫ۖۡۘۢ۠ۡۧۢ۬ۡۛ۫ۚ۟۟ۘۡۘۖ۠ۡۚۡۜۨۦ۬ۢۦۦۘ";
                            while (true) {
                                switch (str22.hashCode() ^ 1395053457) {
                                    case -1016651639:
                                        str22 = "۬ۦۙۚ۬۠۬ۤۨۗۡۨۚۚۨۨۗ۬ۡۤ۫۬۫ۦ۫ۜۘۙۥۛۦۨۛ۠ۛۘۧ۠ۘۤۘۡۖۦۜۘ۠ۗۧ";
                                        continue;
                                    case -52590157:
                                        String str23 = "ۚۢ۬ۡۡ۟ۦۗ۠ۦۗۦۘۥۚۚۛ۠ۘ۫۠ۦۘۨۚۤۙۤۥۚۨۧۛۙۜۘۛۛۨۘ";
                                        while (true) {
                                            switch (str23.hashCode() ^ 1087458254) {
                                                case -1919912959:
                                                    if (!z) {
                                                        str23 = "۠ۢۤۧۡۘۤۢۙ۠ۦ۟ۤۤ۫۟ۥۥ۬ۦۤۤۘۘۤۘ۫ۥۘۜۘۜۚۦۗۥۘۢۛ۠ۜۙۥۧۢۦۚۜۨۘ";
                                                        break;
                                                    } else {
                                                        str23 = "ۜۢۦۨۧۜۧۖۜۘۖۚۜۘۡۢۘۦۨۥۧۖۖۙ۫ۡۦۛۖۘۧۤۨۛۤۡۘۛۖۧۘ";
                                                        break;
                                                    }
                                                case -227354254:
                                                    str22 = "ۦۦۛۤۘۗ۟ۖۛۛۧۦۘۘۗۥۗ۫ۤۚۦۢۨۥۖۘۙۧۥۘۡ۫ۚۧۤۡۘۖۗۡۘ۫ۗۗۘ۬";
                                                    continue;
                                                case 123158521:
                                                    str22 = "۠ۨۡ۟ۤۜۧ۬ۥۚۥۖ۫۠ۘۘ۫ۨۜۥۜۧۘۙۘۡۚۖۖۘۡ۫ۢۤ۟۠ۤۜۖۤۥۨۥۨۨ";
                                                    continue;
                                                    continue;
                                                case 1821847882:
                                                    str23 = "۟ۤۧ۟ۡۧۢ۫ۖۡۢۖۘۚۨۨۘۙ۫ۜۗۢۘۤ۬۟ۧ۠ۗۛۨۘۡۜۥۙۚۖۘ";
                                                    break;
                                            }
                                        }
                                        break;
                                    case 127076452:
                                        break;
                                    case 669804296:
                                        Toast.makeText(context, "读取 origin.apk 失败", 0).show();
                                        break;
                                }
                            }
                            path();
                            throw new RuntimeException(e);
                        }
                        break;
                    case -1026587966:
                        String str24 = "ۧۜۜۘ۫ۨۧۢۜۢۦۖۦۧۛۚ۠۠۠ۛ۠ۥۘ۠ۙ۫ۧۤۨۘۜ۟ۘۘۖۨۨۜ۫ۖۘ";
                        while (true) {
                            switch (str24.hashCode() ^ (-530274323)) {
                                case -1936473938:
                                    Toast.makeText(context, "获取 APK 路径失败", 0).show();
                                    break;
                                case -1109733901:
                                    String str25 = "ۖ۟ۗۢۡۙۛ۟ۥ۠ۘۖۖۗۗۧۧۥۧۗۢ۬ۚۜۘ۫ۦۥۦۗۨۘۗۛۡۤۢۙۥ۫ۡۦ۬ۖۘۡۧۥۘۥۖۜ";
                                    while (true) {
                                        switch (str25.hashCode() ^ (-30277431)) {
                                            case -1672616977:
                                                str24 = "ۤۚ۫ۢ۬ۥۧ۟ۥ۟ۧۙۚ۟ۙۡۛۦۘۧ۟ۖۨۢۡۜۢۙۦۧۘۘ";
                                                continue;
                                            case -1167127684:
                                                str25 = "ۤۢ۠ۗ۬ۘۘۙۜۨۘۦۧۡۘۚ۫ۨۡۦۙۡۥۖۘۜۚۨۘۢ۫ۡۗۢۖ";
                                                break;
                                            case -1114522928:
                                                str24 = "ۘۤۘۖۗۖۥۢۦۘۖۤۛۖۘۜۘۛۨۛۗ۟۬۬۫ۚ۟۠۫ۛۜ۟ۧۘۖۘۤۡۥۘ۫ۘۦۙۤۖۤۜۘۢۗۢ";
                                                continue;
                                            case 736775773:
                                                if (!z) {
                                                    str25 = "ۛۡۖۘ۟ۢۦۘۡۧ۬ۘ۟ۙۢۤۥۛ۫ۜۡۜۢۖۛۤ۬ۜۘۢۖۢ۠۫ۧۜ۟ۜۖۢۘۤۨۜ";
                                                    break;
                                                } else {
                                                    str25 = "۫ۤۢۙۤۥۘۖۧۜۘ۫ۗ۫ۢۚۙۚۡ۠ۚ۟ۨۘ۟ۥ۬ۖ۫ۙۨۧۘۘ";
                                                    break;
                                                }
                                        }
                                    }
                                    break;
                                case -983957192:
                                    str24 = "ۧۤۢۚۡ۬ۘۘ۬ۘۖۗۢ۠ۗ۠ۘ۠ۤ۠ۖ۟ۖۜ۠ۡۦۙۦۘۙۚۦۘۘۚۥ";
                                    break;
                                case 1309846245:
                                    break;
                            }
                        }
                        printStream.println("[菜鸟云验证] 未找到APK路径,加载xhook");
                        path();
                        System.err.println("Get apk path failed");
                        return;
                    case -170226515:
                        str4 = "ۗ۫ۗۨۡۜۢۡۗۗۙۘۚۜۧۘۚۚ۟ۚۚۗۢۚۘۖۙۦ۠ۙۨۚۦ۟۫۟ۡۘۜ۫ۘۘۘۛۜۙ۫ۚۧۡ";
                        break;
                }
            }
        } catch (Throwable th2) {
            String str26 = "ۥۘۡۙۛۢۦۦۘۙ۠ۗۨۖۗۚۙۥۘۘۘۧۛۢۢ۬ۜۜۘ۬ۙۜۘۘۧۜۚۡۨ";
            while (true) {
                switch (str26.hashCode() ^ (-31621625)) {
                    case -1037898185:
                        break;
                    case -448130579:
                        Toast.makeText(context, "加载 SO 失败", 0).show();
                        break;
                    case -55765623:
                        String str27 = "ۛۗۚۥ۠ۜۘ۠۠۟۠ۥۘۥۜۦۘۦ۟۫۬۠ۙ۠۬ۨۘ۬ۨۘۘۢۙۜۖۖۧۘۛۙۡۘ";
                        while (true) {
                            switch (str27.hashCode() ^ 1691286332) {
                                case -1944197774:
                                    if (!z) {
                                        str27 = "ۨۢۛۙۡۘۚۡۘۛۗۡۘ۫ۥۥۘ۫ۥۦۛۗۖۘۙۛۛ۠ۧۧۜۛۖۘۖۘۧۚۦۥۘ۬ۦۥۘۖۨ۫۟ۨۘ۫ۖۘۨۙۦۗ۫ۘۘ";
                                        break;
                                    } else {
                                        str27 = "ۚ۟ۗۖ۠ۘۚۖۚۤ۠ۨۘۦ۟۫۫ۚ۟ۧۚۥۘۧۙۥۖۗ۠ۡۧۙۚۡۥۙۧۢ";
                                        break;
                                    }
                                case 241310895:
                                    str26 = "ۜۗۛ۟ۘۖۥۧۜۘۛۙۚ۟ۢۧۦ۠ۗۗۡۛۨۖۘۨۖۦۘۤۦۥ";
                                    continue;
                                case 387470935:
                                    str27 = "ۧۨۢۜۡ۫ۛۘۨ۟ۜۜۘۢۙۡۚۨۦۘۗۦ۬ۚۜ۬ۜۗۨۘ۟ۜۘۛۙۦۘۤ۫ۨۨ۬ۛۢۗ۬ۦۘۢ۟ۢۤۧۖۥۘۥۧۧ";
                                    break;
                                case 1532862853:
                                    str26 = "۬ۨۡۘۙ۫ۖۜۗۗۚۦ۬۫ۖۧۜۦۖۘ۫ۧ۬ۘۚ۟ۧۘۗ۫ۖۨۤ۠ۡ۬ۖ۟ۙ۫ۛ۟ۛۙ۟ۢۦۘۤ۬ۧۨ۬ۡۘۙ۬۟";
                                    continue;
                                    continue;
                            }
                        }
                        break;
                    case 1413088453:
                        str26 = "ۨۛۥۗۜۡۖۘۧۛۗۖ۬ۙۨۘ۬۟۫ۨۥۡۙۜۜ۬ۙۧۧۤۖۤۙۦۡۜۘۗ۬ۥۛۙۡۘ۟۟ۘۘۚۥۘۘ۬ۦۨۘۨ۫۫";
                        continue;
                }
            }
            PrintStream printStream2 = System.err;
            printStream2.println("[菜鸟云验证] 加载 SO 失败");
            printStream2.println("Load SignatureKiller library failed");
        }
    }

    public static void killOpen(String str) throws IOException {
        int i;
        int i2;
        try {
            System.loadLibrary("yzrSignatureKiller");
            PrintStream printStream = System.out;
            printStream.println("[菜鸟云验证] 加载 yzrSignatureKiller库 成功");
            String apkPath = getApkPath(str);
            String str2 = "ۜ۟ۜۘ۟ۜۤۦۢۢۢ۠ۗۦۖ۟۟ۖ۫۠ۦۢۚۖۢ۬ۜۧۘ۬ۥۙۘۗۘۘ۠ۖۘۗۜۨۘۦۘۛ۫۫ۖۙۘۗ۫۠ۘۚ۟";
            while (true) {
                switch (str2.hashCode() ^ 1290642087) {
                    case -2087796176:
                        printStream.println("[菜鸟云验证] 未找到APK路径,加载xhook");
                        path();
                        System.err.println("Get apk path failed");
                        return;
                    case 1086587078:
                        File file = new File(apkPath);
                        File file2 = new File(getDataFile(str), "origin.apk");
                        try {
                            ZipFile zipFile = new ZipFile(file);
                            try {
                                String strDecrypt = "assets/yunzhuru/origin.apk";
                                ZipEntry entry = zipFile.getEntry(strDecrypt);
                                String str3 = "ۗۜۘۦ۠ۚۥۙۜۘۧۚ۠ۦۛۧۖ۠ۢ۬ۤۘۛۛۖۘ۬۬ۗ۫ۨۧۜۡۤ۠۠۟ۥۚۢۖۘۘ۫ۚۡۘۤۦ۟";
                                while (true) {
                                    switch (str3.hashCode() ^ 1427194306) {
                                        case -1539723507:
                                            String str4 = "ۖۤۖ۠ۧۙۡۖۖۘۜۖۥۥۦۘۘۧۢۢ۬ۡۨۘ۬ۖۧۘ۬۫۠ۦۗ۫۟ۨۖۗۢۥ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1875831727)) {
                                                    case -665619853:
                                                        str3 = "ۛۦ۠ۥۚۖ۠۠ۤۦ۠ۛۚۨۛۦۨ۠ۙۦۡۘ۠۫۟ۙ۟ۘۘۛۧۤ۬ۡ۫۫ۡۨۛ۟ۜ۠ۢۘۘ۬ۜۗۢ۬۠";
                                                        continue;
                                                    case 458113203:
                                                        if (entry != null) {
                                                            str4 = "ۨۚۡۘ۟ۖۢۜۛ۬ۜۦ۠ۛۧ۟۬۫۫ۗ۠ۡۘۙۦ۬ۗۥۘۘۥۖۥ";
                                                            break;
                                                        } else {
                                                            str4 = "ۢ۠ۚ۫۫ۘۘۧۘ۬ۦ۠ۙۙۙۡۤۜۘۡ۬ۡۦۗۨۘۧۥۧۧ۠ۢۖ۬ۡۘۖ۠ۜۤۗ۫ۡۘۡۙۖۖۚۖۘ";
                                                            break;
                                                        }
                                                    case 1123777338:
                                                        str3 = "۠ۗۢۖۦۖۘۘۦۜۥۙ۫ۖۧۖۘۨۜۦ۬۫۠ۨۘۤۖۙۜۡۦۦ";
                                                        continue;
                                                    case 1502916147:
                                                        str4 = "ۙۘۦۜۤۗ۟ۡۦ۠ۧۨۘۚۧۖۧۙۜۘۨ۬ۛۖۦ۬ۙ۫ۖۘ۟ۢۛۧۘۖۘۡۘۧ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -822798410:
                                            String str5 = "۫۟ۢۨۛۥۜۚۗۛۢۦۘ۟ۙ۬۬ۦۦۨ۫۫ۡۦۥۜۙ۟۠ۡۙۧۘ۫ۗۘۤ۟ۥۘۚۗۘ۟۫۫ۥۘۚ";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-287504797)) {
                                                    case 408437958:
                                                        String str6 = "ۚ۬ۘۘۗ۠ۖ۠ۤۚۖۗۦۛۦ۟۬ۨ۫ۨۦۦۗۦۙ۟ۚ۫ۚۡۖۘۖۡ۟ۛۡ۟ۡۤ۟ۘۘۙ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ (-1344603528)) {
                                                                case -1463753776:
                                                                    break;
                                                                case -1355887796:
                                                                    String str7 = "ۡۢۡۘ۬ۧۤۡۨۦۜۡۦۘ۟ۢ۟۬ۜۖۘۧۦ۠ۖۡۖۘ۫ۦۥۘۖۥۡۗۗ۬ۥ۟ۖۘۖ۠ۚۥۜۗۜۡۥۘۜ۬ۥۘ";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ (-1540230683)) {
                                                                            case 33192605:
                                                                                str7 = "ۦۗۦۙ۟ۢ۟ۗۧۖۛ۟۟ۙۖۜۘۤ۠ۘۘۖ۟ۥۘۛۨۜۘۖ۟۬ۦۙۙۥۜۡ۫ۙۚ۟ۧۚۙۙۡ۠ۙۥۘۘۢۛۧۦۥۘ";
                                                                                break;
                                                                            case 367454994:
                                                                                str6 = "ۙ۫ۡۖ۠ۗ۬ۖ۫ۘ۬ۚ۬ۤۢۜۢۢۡۥۨ۟ۛۜۘۛۛ۟ۥۡۨۘۛ۟ۦۗ۬۫۟ۦۢ۠ۤۡ";
                                                                                continue;
                                                                            case 1162678969:
                                                                                str6 = "ۗ۟ۛۘۥۜۘۡۖۖۘۘۧۘۗۙۜۘۨۡ۠۟ۚۡۛۡۦۘۧۜۙۖۧۖۘ۟۫ۡۘۤ۠ۨۘ۬ۤۘۦۖۨۘ";
                                                                                continue;
                                                                            case 1889610001:
                                                                                if (file2.length() == entry.getSize()) {
                                                                                    str7 = "۠۬ۧۧۥ۬ۤ۟ۜۤۦۡۦۘۖۜۦۛۖۙۛۨۧۘۘ۬ۗۗۤ۠ۙ۬۟ۜۤۦۘ";
                                                                                    break;
                                                                                } else {
                                                                                    str7 = "ۤ۠ۥۘۤۦۘۥ۫۠ۙ۟ۧۜۡۨۡۦۦۤۜۚۘ۠ۖۦۡۘۘۛۘۚۡۧ۠ۨۖۘۚۚۨۘۙۥۖۘ";
                                                                                    break;
                                                                                }
                                                                        }
                                                                    }
                                                                    break;
                                                                case -822620163:
                                                                    str6 = "ۖۖۡۧۘ۟ۘۦ۟۠ۥۜۥۡۤۦۦۘۡۨ۟ۛۤۥۖ۠۟ۥۡۙۡۡۜۘۖۙۖ";
                                                                case 652655170:
                                                                    printStream.println("[菜鸟云验证] origin.apk 已存在且大小一致" + strDecrypt);
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 501828659:
                                                        String str8 = "ۥۨۖۘۗۡ۬ۜ۬ۘۗۧۥ۠۫ۜۨۡۘۜۧۖۙۘۡۗۡۖۧۖۡۡۜۖۡۛۜۨۗۦۙۛۥۘ";
                                                        while (true) {
                                                            switch (str8.hashCode() ^ (-1275987343)) {
                                                                case -1979459153:
                                                                    str5 = "ۚ۠۠۠۠ۨۘ۟ۜۖۘۦۨ۬۟ۜۗۛۦۤۗۢۢ۫ۛ۫۫ۥۘۢۢۧۘ۫ۥۘۤ۬ۧۛۡۘ۟ۧۤ۫ۜۙ۠ۤۡۘۜۗۤۚۘ۟";
                                                                    continue;
                                                                case -1514371215:
                                                                    str5 = "ۦ۫ۛۛ۟ۥۘ۟ۘۖۚۤۖۙۗۨۘۡۚۥۧۡۥۙۙۗۛ۫۬۟ۡۥۘۙۙۜ۠ۥۗ";
                                                                    continue;
                                                                case -1233981451:
                                                                    str8 = "ۧۥۜ۟ۤۗۦۚۜۘ۬ۤۜۢ۟ۖۧۨۥۘۢۧۖۖۜۦ۫۠ۥۘ۬۟ۗ";
                                                                    break;
                                                                case 524941537:
                                                                    if (!file2.exists()) {
                                                                        str8 = "۫ۦۛ۬۫ۦۘ۫ۚ۫ۛۡۡۘۙۜۡۘۘ۠ۛۛۤۡۘۚۜۘۘۛۙ۟ۜۖۖۘ۫ۦۚۤۜ۟۫ۤۚ۬۠ۡ";
                                                                        break;
                                                                    } else {
                                                                        str8 = "ۥ۟ۡۘ۠ۜۘ۟ۥۥ۟ۘۨ۫ۖۘۧۥۙۧ۫ۥۘۖۧۧ۬ۖۖۘۗۙۘۘ";
                                                                        break;
                                                                    }
                                                            }
                                                        }
                                                        break;
                                                    case 527349350:
                                                        break;
                                                    case 1579303834:
                                                        str5 = "ۜۨۨۤ۫ۛۦۛۛۜۡۜۥۙۤۖۘۘۘۘۢۘۘ۟ۙ۠۟ۖ۫۬۫ۦ۟ۚۡۘۖۙۤۤۡ۫۫۠۟";
                                                }
                                            }
                                            InputStream inputStream = zipFile.getInputStream(entry);
                                            try {
                                                FileOutputStream fileOutputStream = new FileOutputStream(file2);
                                                try {
                                                    byte[] bArr = new byte[102400];
                                                    while (true) {
                                                        int i3 = inputStream.read(bArr);
                                                        String str9 = "۟ۢۘۨۦۜۘۗۨۥۘۖ۬ۘۘۜۙۖۨۧۨۘ۟ۗ۬ۤۨ۬ۡۥۜۘۥۙۖۜۘۘۚ۫";
                                                        while (true) {
                                                            switch (str9.hashCode() ^ 38580409) {
                                                                case -2138573814:
                                                                    break;
                                                                case -1106950585:
                                                                    String str10 = "ۛ۬ۦۢۜۙۢۥۖۘ۟ۖۡۤۚۡۘۛ۫ۡۢۜۗۧ۬ۤ۟ۛۨۜ۫ۡۘ۬ۥۧۘۥ۠ۗۚۛ۬ۥۜۧ";
                                                                    while (true) {
                                                                        switch (str10.hashCode() ^ 1553903900) {
                                                                            case 593517900:
                                                                                str10 = i3 != -1 ? "ۗۖۜۢۦۘۙۤ۠ۤۜۨۘ۠۟۫ۦۛۨۘ۬ۚۦۖۨۘۡۘۧۖۚ۟۟ۙۨۘۚۚۦۘۢۡۨۖۙۚ" : "ۜۖۡۘ۫ۤۗۥ۫ۡۨۘۤ۠ۗۖ۬ۨۖۤۚۖ۠ۙۧۨۗ۫ۦۙۦۘۦۤۧۤۥۖ۟ۢۜۘۗۨۜۘۡۗۘۘۡۗۨۗۦۖۘۢۨۗ";
                                                                            case 809945736:
                                                                                str9 = "ۗۥۢۜۛۨۛۢۙۥ۫ۘۘ۠ۥ۠۟ۖ۟ۚۗ۫۠ۛۛۢۗۗۧ۟ۦۘۜ۟ۚ۟ۥۦۘ";
                                                                                break;
                                                                            case 1291399154:
                                                                                str10 = "ۛۛۘۘۥۧۨ۟ۨۡۢۡۥۘ۟۠ۜۥ۬ۡۚۚۙۙۘۗ۫۫ۨۚۨ";
                                                                            case 1295412018:
                                                                                str9 = "۠ۡۜ۬ۨۘۗۢۛۦۢۘۘۡۢۥۚۥۜۘۖۡۛۧۙۜۗۨۤۦۜۘۧۜۛۚۤ۫";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1593133597:
                                                                    fileOutputStream.close();
                                                                    inputStream.close();
                                                                    System.err.println("[菜鸟云验证] origin.apk 提取完成" + strDecrypt);
                                                                    break;
                                                                case 1938147196:
                                                                    str9 = "ۦ۬ۛۜۨۦۘ۠۠ۘۙۖۗۧۡۦۧۙۥۘ۠۟ۖۙ۟ۜۘۘ۬ۢۨۜۘ";
                                                            }
                                                        }
                                                        zipFile.close();
                                                        hookApkPath(file.getAbsolutePath(), file2.getAbsolutePath());
                                                        System.out.println("[菜鸟云验证] 调用 hookApkPath 完成");
                                                        return;
                                                        fileOutputStream.write(bArr, 0, i3);
                                                        break;
                                                    }
                                                } finally {
                                                }
                                            } finally {
                                                while (true) {
                                                    switch (i) {
                                                        case -1875040477:
                                                        case -1196058901:
                                                            while (true) {
                                                                switch (i2) {
                                                                    case -526441698:
                                                                        break;
                                                                    case -367554228:
                                                                        continue;
                                                                    case 3425076:
                                                                        continue;
                                                                    case 1808313453:
                                                                        if (inputStream == null) {
                                                                            break;
                                                                        } else {
                                                                            break;
                                                                        }
                                                                }
                                                            }
                                                            break;
                                                        case 52475438:
                                                            try {
                                                                break;
                                                            } catch (Throwable th) {
                                                                break;
                                                            }
                                                        case 2122949815:
                                                            break;
                                                    }
                                                }
                                            }
                                        case 816778195:
                                            str3 = "ۛ۟ۡۘۖۤ۠ۘ۫ۘۘۜۢۖۛۙۨۘۧۜۘۘۖۘۨۖ۬۠ۜ۠۠ۦ۫ۙ";
                                        case 1694626215:
                                            printStream.println("[菜鸟云验证] origin.apk 文件不存在" + strDecrypt);
                                            path();
                                            System.err.println("[菜鸟云验证] Entry not found: " + strDecrypt);
                                            zipFile.close();
                                            return;
                                    }
                                }
                            } finally {
                            }
                        } catch (IOException e) {
                            System.out.println("[菜鸟云验证] 读取 origin.apk 失败");
                            path();
                            throw new RuntimeException(e);
                        }
                        break;
                    case 1919611559:
                        String str11 = "ۡۗ۬۠ۖ۟۟ۢۗۚۘۗۦۦ۠ۥۥ۠۟ۜۖۙۛۗۡ۟ۚ۟ۘۘ۬ۥۡۥۙۖۘۨۤۖۘۤ۟ۤۜۚۜۙ۟ۦ";
                        while (true) {
                            switch (str11.hashCode() ^ (-1788657389)) {
                                case -568338850:
                                    str2 = "ۨۨۤۧ۬ۤۗ۬ۥۢۗ۫۠ۙۜۘۗۜ۫ۜۙۡۤۢۜۧۥۘۛۦۗ۬ۜۘۨۜۡ";
                                    continue;
                                case -121431119:
                                    str2 = "۫ۗۧ۟ۙۙۡۗۧۤۢۨۖۥۜۡۧۘۧ۬ۙۖۘۘۨۘۤ۟ۜۛ۠۫ۥۛۜۜۤۧ۫۬ۤۢۗۦۨۘۨۘ";
                                    continue;
                                case 522773941:
                                    if (apkPath != null) {
                                        str11 = "ۥ۠ۢ۠ۗۜۘۛۙۦۘۗ۬ۨۘۗ۫ۡۗۢ۠ۛۧۘ۟ۡۧۢۨۘۤۦۤۧۚ۟ۙۚ";
                                        break;
                                    } else {
                                        str11 = "۠ۛۗۛۧۥۡۙۨۘۗۦ۟ۛ۟ۜۙۤۦۛ۬ۦۧ۬ۘۨۛۨۙ۟ۜۡۙ۫ۙ۫";
                                        break;
                                    }
                                case 853717547:
                                    str11 = "ۛۢۤۡۘۧۘ۬۬ۜۘۢ۠ۥۘۜۧۦۘۦۛۧۚۖۡۘۜۜۦۘ۠ۘۘ۟۬ۨۘۥۜۨۘۤۛۨۥۜ۬ۚۜ";
                                    break;
                            }
                        }
                        break;
                    case 2006785991:
                        str2 = "ۤ۠ۥ۠۫ۜۘۨ۬ۛۦۢۘۙۥۘۗۛۦۘۗۨۙۗۢۖۘۘۢۢ۠ۦۗۨ۟ۛۨۨۧۦۦۜۙۗۥۥۘۗ۟۫ۘ";
                        break;
                }
            }
        } catch (Throwable th2) {
            PrintStream printStream2 = System.err;
            printStream2.println("[菜鸟云验证] 加载 yzrSignatureKiller库 失败");
            printStream2.println("Load SignatureKiller library failed");
        }
    }

    private static void path() {
        String str = "ۘ۟ۜۘۜۧۡۘۜ۟ۦۙۜۛ۠ۧۢۦۦۦۥۛۤۗۘۘۘۤۦۡ۬۟ۙۖۥ۫ۙ۠ۨۙۤۦۖ۟ۡۘ";
        while (true) {
            switch ((((str.hashCode() ^ 430) ^ 180) ^ 234) ^ (-925639140)) {
                case -361423390:
                    return;
                case 2127799113:
                    System.out.println("执行PATH_X_HOOK初始化失败");
                    str = "ۦۤۘۘۤۗۛۦۡۖ۬ۙ۟ۘۘۖۘۦۖۤۛۖۖۘۛۘۚۤۖۥۘۘۡۧۘ";
                    break;
            }
        }
    }
}
