package core.pro.android.notify;

import android.app.Activity;
import android.app.Dialog;
import gTBLD.dev.XSSTG.free.Utils;
import java.util.Set;

/* loaded from: /workspace/unpacked/classes2.dex */
public final /* synthetic */ class e1 implements Runnable {
    public final int a;
    public final Activity b;
    public final boolean c;
    public final Dialog d;

    public /* synthetic */ e1(Activity activity, boolean z, Dialog dialog, int i) {
        this.a = i;
        this.b = activity;
        this.c = z;
        this.d = dialog;
    }

    /* JADX WARN: Failed to find 'out' block for switch in B:4:0x0016. Please report as an issue. */
    @Override // java.lang.Runnable
    public final void run() throws NoSuchFieldException, SecurityException {
        boolean z = false;
        String str = "۟ۚ۫ۡۤۧ۬ۥۡۘۨۦۖۘۢۦ۟ۢۖ۬ۨۧۢۛۚۦۘۧ۫ۜ۠ۖۖۘ۠ۤ۫ۜۛ";
        Activity activity = null;
        Dialog dialog = null;
        while (true) {
            switch ((((str.hashCode() ^ 450) ^ 539) ^ 575) ^ 783697329) {
                case -2060450993:
                    Utils.monitorDialog(dialog);
                    str = "ۜۤۡۘ۬ۙۢۤۦۜۘۚ۫۫ۛۢۛۚۛ۠ۙۧۖۘۛۛۖ۬۟ۦۘۖۥ۬ۜۜۡۘۗۨ۬ۘ۫ۗۥۨۖ";
                case -2059407578:
                    String str2 = "ۦۚۧۢۨۡۘ۟ۢۙۜۦۚۘۦۨ۬ۤۘۘۜۥۚۢ۠ۖۘۧۘ۫ۦۨۜۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 1878785527) {
                            case -856836776:
                                String str3 = "ۙۘۧۙۘۨۖۘۜۘۢۢۨ۫ۦۨۘۨ۫ۘۢ۬ۛ۟۫ۖ۫۫ۗۜۚۖۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ 515612928) {
                                        case -901800059:
                                            str2 = "ۙۗۧ۬ۘۜۘۧ۠۫۠ۛۘ۬ۜۘۖۛۖۥۦۗ۬۫ۖۘ۫ۨۧۘۡۤۖۘۨ۬ۘۘۦۛۥ";
                                            break;
                                        case -754538993:
                                            str3 = "۫ۙۦۘۦۥۦۧۨۡ۫ۜۜۘۧۙۥۘۗۗۗۗۚۚۗۗۨۘۦۢۜۘۖ۬ۧۜۨۗۤۧ";
                                        case 7693392:
                                            str2 = "ۚۢۖۚۖۥۘۨۡۨ۠ۡۧۘۤ۠ۦۘ۫ۛۤۡۘۚۡۖۥۘۙۧۗۨۧۘ";
                                            break;
                                        case 946397597:
                                            str3 = !activity.isFinishing() ? "ۛ۫ۙۤۢۛۥۘۖۘ۟ۤۡۘۢۤۦۘۤ۫ۘ۠ۡۡۨۥۖ۠ۡۘۧۥۨۦ۠ۤۡۤۧۥۤۦۚۛۙ" : "ۛۖۜۘ۬ۖۛۤۥۙۖۢۤۤۥۖۘۤۙۘۘۢۢ۬ۙۗۨۖۨۥۘۗ۠ۖ۟ۜۘ۬ۤۥ۬ۦ۟ۨ۟۫ۜۢۨۘ۬ۡۧۢۢ۫ۥۜۤ";
                                    }
                                }
                                break;
                            case -169409330:
                                str2 = "۬ۡۘۘۦ۟ۨۦۙۖۙۜۜۘۛۥ۬ۡ۟۬۬ۢۖ۬ۖۨۘ۫۬ۥۘۥۥۦ";
                            case 177209168:
                                break;
                            case 1007102971:
                                str = "۠ۜۢۘۤۘۘۙۤ۫ۗۥ۫۬ۜ۬ۖۤۙۡۡۧۘ۫ۧۥۚۧ۟ۡ۟ۖۖۜۧۘۙۤۙۤۛۘۤۧۤ۠ۢ۠۬ۚۤ۟ۘۘۤۖۖۘ";
                                break;
                        }
                    }
                    str = "۠ۡۧۘۗۦۘۘ۟ۚ۠ۘۨۧۘۡۛۨۗۡۡۘۚۚۢۛۗۦۘۘۨۘۛۦۨ";
                    break;
                case -1967491809:
                    dialog.show();
                    str = "ۜ۠۫ۤ۠ۜۡۖ۫۬۟ۦۘۙۡ۠ۚ۠ۙۨۡۙۙۦۡۘۤۧۜۗۤۥۘ";
                case -1773917361:
                case 283555413:
                    str = "ۧۜۥۘۛ۟ۗۖۧ۠ۖ۬ۥۧۢۖۘۥۨۢ۟ۜۖۘ۫ۗۨ۬ۖۘۘۦۘۛ۬۟ۘۘ۟۬ۢۡۙۙۗ۠ۦۘ";
                case -1736853929:
                    Set<String> set = k2.closedPopupIds;
                    str = "ۦۛۡۘۗ۟ۡۘ۟ۧ۠ۡ۟۫۟ۗۚ۫ۧۢ۫ۢۥۘ۟۬ۗ۠ۜۘ۟۠ۖۙ۟۬۠ۙۘۢۖۛۙۜۡۜۚ۠۟ۙۨ";
                case -1589586086:
                    activity = this.b;
                    str = "ۤۘۜۘۙۨۧۥۤۙۙۢۧۦۚۚۖۧۗۚۖۥۜۨۦ۬ۢۛۤ۬۫ۡۡۘۧۢۜۘۧۙۨۘۦۙۗۘ۬ۢۧۥۡ";
                case -1565784341:
                case 871291332:
                    str = "ۧۡۥۥۙۦۢۧۨۤۚۥۛۜۛۗۘۢۦۙۜۜۖۨۘ۫ۘۘۘۧ۫ۨۘۗۥۧۘۛ۫ۨ";
                case -1532259071:
                    Utils.monitorDialog(dialog);
                    str = "ۡ۫۠ۨۤۛۗۢۦۦۨۗۗۤ۫ۜۧۦۘۥۛۨۘۚۗۥۤ۠ۤ۫ۛۖ۬ۚۢۦۖۘۘۤۡۙۢۙ";
                case -1505198857:
                    String str4 = "ۡۨ۠۬ۛۙۦۢۤۡۧۢ۬ۦ۟ۘۗ۫ۙۨۗ۟ۧۗۜ۬ۦۨۖۤ";
                    while (true) {
                        switch (str4.hashCode() ^ (-679837889)) {
                            case -55700315:
                                str = "ۡ۬ۜۘ۟ۙۦۡ۠ۙ۠ۢۜۚۗۨۘۨۤۤۤۚۜۘۡۡۗۗۥۢۢۨۡۘۗۨۥۜۡۡۨۦۥۘۦۥۖۘۧۚۦۢ۬ۗ";
                                continue;
                            case 1712081990:
                                str = "ۖۘۖۘ۫۫۬ۢۥۗۧۢۨۘۨ۫۠ۖۢۗۗۖۚۜۤۨ۬ۖۧۘ۫ۦ۫ۨۘۢۥۘۗۥۨۛۛۗ";
                                continue;
                            case 1880502549:
                                str4 = "ۙۨۦۨۨۙۜۚۗۧۥۢۦۖۚۗ۟۬۫ۧۦ۬ۦۘۙۨۖۘۖۖۦ";
                                break;
                            case 1895598092:
                                String str5 = "ۥۚۖۘۜۡۖ۠۟ۡۘ۟ۢۥۛۚۨۦۧۗۘ۬ۜۘۤ۫ۗۨ۟ۢۖۖۥ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-677527386)) {
                                        case -1941232227:
                                            str5 = z ? "ۦۗ۬ۦۘۡۘ۫ۗ۠ۗ۫ۛۨۧۥۛۙۥۘۚۗۖۦۖۙۦۘ۬ۦ۠ۥۘ" : "۫ۘۢۚۡۙۘ۬ۨۛ۠ۙۧۚ۫ۖۨۘۤۖۦۤۘۚ۟ۧۥۘ۟ۛۘۦۗۜۗ۫ۡۛۗۜۛۘۘۜۥۥۘۤۙۡۘۗۘۗۤۗۦۘ";
                                        case 1030843732:
                                            str4 = "ۚۢۖۡۨۤ۫۫ۘۘۚۨۡۘۖۜۜۚۡۦۘۗ۫ۤۢۛ۫ۡ۫ۥۘۙۙۦۘ۫۠ۨۡۦۥۥۜ۠ۙۗۖۘۘۤۨۘۙۗۜۘۛ۫ۛۛۙۜ";
                                            break;
                                        case 1668564904:
                                            str4 = "ۙۧۖۘۜۦۤۥۨۘۧ۟ۘۡۦۦۘۦۜ۟ۙ۟ۧۦۨ۫ۦۤ۬۟ۘۛۦۗۧۚۧ";
                                            break;
                                        case 1945987377:
                                            str5 = "ۙۙۚۡۤۛۢۥۧۘۘۖۥۘۘۘ۫ۢۘۦۨ۟ۘۛۗۘۘۧۤۢۦۖۥۘۛۜ۠ۢۘۘۨ۫ۢۗ۬ۖۘۛۢۘۘۤۛۨۘ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1463589514:
                case -844666259:
                    str = "ۙۦۜۘۨۤ۫ۤۨ۫ۧۛۥۘۗۛۧۗۥۙۨۤۖۘۜۘۤۡۧ۟۟ۜ۟ۙۚۙۛۥ";
                case -1319227098:
                    String str6 = "۬ۦۜۜۙۧۖ۫ۦۛۡ۫ۙ۟۠۟ۚۨۢۖۥۘۚ۠ۥۘۚۥۘۘۧ";
                    while (true) {
                        switch (str6.hashCode() ^ (-746060559)) {
                            case -1171998116:
                                String str7 = "ۘۗۖۘ۟۬ۜۖۥۦۘۡۧ۠ۖۦ۬ۛ۠ۦۜ۫ۨۘۘۚۥۢۧۡۧۚۗ۬ۢۚۡ۬۠ۚۛۢ";
                                while (true) {
                                    switch (str7.hashCode() ^ 1384607510) {
                                        case 59768610:
                                            str7 = z ? "ۘۤۤۛۙۜۘۗۜۦۘۧۖۢۡ۟ۦۘۙۤۜۘۚۚۥۘۥۡۦۘۜۚ۫ۙۜۥ" : "۠ۧۜۘۘۥۛۢۢۡۘۚۙۢۡۡۚۗۡۗۙ۬ۖۘۢۦۘۘ۬ۜۡۘ۟ۖۧۘۡۚ۫ۙۡۗۘۦۧۘۡ۟ۜۨۗۛۗۙ۟";
                                        case 580536705:
                                            str6 = "ۛۚ۬ۢۗۛۧ۬ۤ۠ۥۤۦۜۖۘۦۦۜۤۢۦۘۤۜۤ۠۫ۘۘ۫ۥ۬ۥۗۙۧ۠ۜ";
                                            break;
                                        case 931188902:
                                            str6 = "ۢۚۜۡۜۜۦۙۥۘۡۢۡ۬ۘۦۘۡۧۢۡ۟ۥۘۖۥۖۛۡۤۢۦۤ۬ۜۙۨۧۦۘۡۛۨۜۖۥۦ۠ۥۨ۠ۨ۠۠۠ۖۦۘ";
                                            break;
                                        case 1078028129:
                                            str7 = "ۛۙۖۘۧۗۥۗۗۥۢۖۧۛۨۜۘۢ۟ۘۦۚۜۦۚۥۤۤ۟ۛۡۘۙۢ۬ۨۦۨۥ۫۫۫۬ۤ";
                                    }
                                }
                                break;
                            case -555402877:
                                str = "۫ۖۛۢ۬ۙۙۡ۟ۤۖۘۖۡۨۧۤۨۢۤۥۛۢۙۘۛۨۦۖ۠ۦ۠ۤۖۡۜ۠ۗۦۘۗۗ۬ۤۧۛۘۘ";
                                continue;
                            case -119219524:
                                str6 = "ۗۗۨ۬۟ۢۥۘ۫ۚۢۢۢ۫ۦۘۚ۬ۛۘۥۚ۟ۖۜۘۛۚۨۧ۬ۖۛۨۢ۠ۥ۟ۧ۟۫ۢ۠۫";
                                break;
                            case 959417331:
                                str = "۬۬ۚۜۤۚ۟ۤۗۛ۟ۖۘۘۛۡۘۧ۫ۤۦۦۡۘۤۦۜ۬ۗۦۡۡۥ۠ۜ۟ۢۨۖۦۜۘۦ";
                                continue;
                        }
                    }
                    break;
                case -1238509600:
                    new x0(dialog, activity).show();
                    str = "ۤ۫ۥۘ۬ۤۧ۟۫ۦۚۜۚۦۨۘۦۨۨۘۤۡ۠۟ۛۤ۟۫ۤ۠ۨۦۘ";
                case -1209030427:
                    dialog.show();
                    str = "ۚۨۡۡ۠ۘۘ۬ۤۖۘ۠۫ۚ۟ۗۦۘۗ۫۬۬ۚۥۘۘۡۤۢۤ۫۟ۙۧ۠۟ۚۨۢۤ";
                case -1169656261:
                    new x0(dialog, activity).show();
                    str = "۬۠۬۟ۗۗۨ۫۟ۢ۬ۜ۠ۛۨ۫ۡۥۥۛ۟ۜۖ۬ۘۤۥۘۢۚۗۨۡۘۖۙ۠ۡۜۦۘۥۤۜۥۛۚۜ۫ۖ۟ۦۦۘۤۖۢ";
                case -940293432:
                case -866028098:
                case -638346840:
                case 1519193668:
                    break;
                case -912617436:
                    k2.logToFloatingWindow(l2.decrypt("eiXCzaMOdRmU6VEwfUvkQKKjMR4w144ZgPhRDkI=\n", "G0a2pNVnAfw=\n"), l2.decrypt("bqHjUg==\n", "GcCRPHyi/m0=\n"));
                    str = "ۘ۠ۤۖۤ۫۫ۛۘ۬۠ۨ۟ۖ۬ۛۤۨۘۛۛ۫ۤۢۥ۟ۤۥۚ۠ۖۨۚۢ۟ۛۦۘ";
                case -652550394:
                    str = "ۘۛۨ۫ۘ۫ۡۦ۟ۦۖۥ۟ۗۢۜ۠ۦۘ۠ۢ۬ۘۘ۟۠ۖۢۢۘۛۛ۫۬ۧۧۥۘۢۛۖۘۛۨۨۘ";
                    dialog = this.d;
                case -477030432:
                    String str8 = "ۢۛۗۚۥۧۛ۟ۡ۟ۖۡۨۡۘ۠۟ۚۤ۬ۤ۬ۦۧۘ۬ۤۡۘۨۘۗ";
                    while (true) {
                        switch (str8.hashCode() ^ (-209404957)) {
                            case -1946164357:
                                String str9 = "ۤۗۨۘۙۤۨۘ۟ۨ۬ۢ۬ۦۘ۠۫ۖۗۡۙۖۦ۠۟ۤۗۨ۫ۡۗۖۗ۬ۤۧۘۧۖۘۘۡۤۡۦۘۘ";
                                while (true) {
                                    switch (str9.hashCode() ^ 1239133302) {
                                        case -2073417870:
                                            str8 = "۬ۥ۬ۤۨۙۥۛۨۘۘۥۥ۠۠ۦۨ۠ۧۨۦۛۙۦۘۢ۫ۘۗ۠ۗۜۡۚۧ۟ۢۛ۬ۤ۠۟ۦۘۤۡ۫ۙ۟ۘۘ";
                                            break;
                                        case -502313931:
                                            str9 = "ۗۜ۟ۡ۠ۡۡۘۖۘ۠ۘۗۘۛۗۢۛۥۘۖ۟ۨۤۜۜۘۛۥۙ۫ۚۥۘۗۙۡۘۢۢۡ۬ۤۛۤ۟ۨۘۖۤۚۛ۬۟ۧۙۘۤۚۨۘ";
                                        case 409496375:
                                            str9 = !activity.isDestroyed() ? "ۧۜۨۡ۟۠۟ۘۚۖ۠ۤۨۛۘۘۙۧ۬۬ۖۡۘۗۤۦۘۖ۠ۥۘۡۦۨۦۥۢ۟ۘۡۘۗۨۦ۬ۡۙۢۙۡۗۜۥۘ" : "ۢۢۚ۠ۡۤۦ۫ۜۘۜۛۛۛ۫ۨۘۦۦۙۖۡۥۛۤ۠ۤۡۘۖۛۢۛ۠۠۠ۘۜۘۘۤ۠۬۬۬۬ۘۘۢۗۥ";
                                        case 1911121875:
                                            str8 = "ۥۚۛۗۨۛۖ۫ۤۖ۠۠ۧ۬ۘۘۚۤۖۘۢۥۖۡۧ۫ۜۡۨۛۧ";
                                            break;
                                    }
                                }
                                break;
                            case -1454383150:
                                str = "ۚۡۚۘۥۘۧۖۖۥ۟۠۟۫ۘۘۚۚۢ۬ۙۦۙۡۥۗۛۜۘۦۤۢ۠ۖۘۡۦ۬ۖۨۚۖۚۗ";
                                break;
                            case -1010918270:
                                break;
                            case -744517976:
                                str8 = "ۗۜۘۥۗ۫ۜۨۨۗۡۖۘ۬ۥ۠ۨۤۤۨۦۢۗۢۖ۬۫۟ۘۘۧ";
                        }
                    }
                    str = "۫ۗۛۦۧۨۘۚۛۨۤ۠ۨۘۜ۬ۜۘۖۨۡۡۡۘۘۢۥۢۗۘۘۢۙۘ۠ۡۨۘۢ۬ۜۘۢ۫ۦۖۜۥۘۧۛۨۡۡۤ۠ۜۖۘ۫ۗۛ";
                    break;
                case -173038682:
                    k2.logToFloatingWindow(l2.decrypt("uBCAl5rtLHJW3BNqRKi9K2CWc0QJONhyaPwTVHs=\n", "2XP0/uyEWJc=\n"), l2.decrypt("jC37Bw==\n", "+0yJaSzRC4U=\n"));
                    str = "ۙۗۡ۬ۛۧۧۗۘۘ۠۠ۤۨۜۢۥ۟ۨۤۡۦۘۙۗۘۦۛ۠۟ۗۜ";
                case -105116482:
                    str = "ۗۤۦۘ۫ۨ۠ۖۚۥۖۚۡ۠ۗۥۘۨ۟ۚۨۛۡۤۦۢۨۢۥۘۥۢۨۘ۬ۧۗۧ۫ۨۘۚۘۙ۬ۚۥۘ";
                case -95018037:
                    k2.confirmPopupShown(dialog);
                    str = "ۛۧۘۘۜۧۙ۬ۖۜۙ۫ۡۘۗ۬ۢ۬۠ۥ۟ۜۜۘۙ۬ۦۘۥۜۦۘ۫ۜۜۘۥۨۦ۬ۧۗ";
                case -80196282:
                    Utils.monitorDialog(dialog);
                    str = "ۦۛۨۗۖۤۚۙۛۤۘۛۖ۟۟ۚۛۜۘ۠۠ۛۡۤۨ۬۠ۜۘۙۘۜۘۙۧۘۢۨۗۚۘۘ۫۟ۖۨۖۜۙۗۡۘۥۖۤۜ۠ۚ";
                case 122982931:
                    String str10 = "ۤۥۚۛ۫۬ۡۤۢۚ۫۟۟ۚۗۘۗۖ۠ۜۘۤۡۘۦۢۗ۟ۨۧۚۚۛۢۛۦۘ۟ۦۥ۬ۨۡۘۦۧۦۘۛۦ";
                    while (true) {
                        switch (str10.hashCode() ^ (-642726306)) {
                            case -1993289534:
                                str = "ۢۙۘۛۘۥ۫ۚۖۘ۠ۤۜ۠۬ۡۖۗۙ۠۬ۦۘۤۚۥ۟ۦۜۘۜ۟ۥۘۘۥۡۘ۠ۥۛ۠ۦۘۖۘ";
                                break;
                            case -53390618:
                                String str11 = "ۚۙۚ۟ۨۖۘ۟۠ۥۘۤۗۖۘۙۦۖۦ۫ۜۡۧۥ۬ۡۘۘۖۤ۬ۢۥ۟ۥۚۤ۟";
                                while (true) {
                                    switch (str11.hashCode() ^ 1451831803) {
                                        case -902680112:
                                            str10 = "ۢۜ۫۬ۘۗ۬ۘ۟ۗۥ۫ۜۧۦۧۢۡۘۦ۟ۤۚۧۤ۫ۤۥۡۛ";
                                            break;
                                        case -32159401:
                                            str11 = "ۤۡ۠ۤ۠ۦۙۙۢۨۘۡۨۘۧۘۜۚۨۘۨۨ۫ۡۥۜ۟۟۠ۘۥۛۚۧۦۧۨۦ۬ۦۡ۬ۖۜۡۛۡۜۜۛ";
                                        case 489886622:
                                            str11 = !activity.isDestroyed() ? "۬۠۠ۤۧۨۘۧۡۘۘۢۡۨۘۘ۬ۛۛۧۤۤ۫ۜۜۜۚۘ۠ۖۘۤ۟۠ۡ۟۟ۦ۫ۦۘۘۡۘۦۘۥۘۜۜۙۙۘۜ۬ۘۖۘۘ۬۫" : "۬۬ۧۘۥۜۘۘ۫ۨۘۘۜۛۙ۠ۦۘۖ۬ۡۘۘۨۦۚۛۜۘۗۛۜۡ۫ۖۘ";
                                        case 585681216:
                                            str10 = "ۡۚۦ۬ۤۨ۠ۨ۟ۡۜۜۘۛۢ۬ۢۙۗۘ۟ۥۘۗۙۗۛۤۤ۬ۨۖۤ۬ۗۗۙ۠ۖ۟ۢۛ۬۬ۨۥۛۗۘۗۦ۬ۖ۫ۢ";
                                            break;
                                    }
                                }
                                break;
                            case 1106249775:
                                str10 = "ۥ۫ۜۘۛۡۦۗ۟ۡۡۖۥۚۤۚ۟۫ۧۡۥۖۘۛۜۖۘ۠ۖۖۘۙۨ۟ۡۥ۠ۖۨۧۗۨۧۥۘۜۢ۫ۦۘۧۥۙۚۨۜۤۧۨۘ";
                            case 1426169364:
                                break;
                        }
                    }
                    str = "۠ۡۧۘۗۦۘۘ۟ۚ۠ۘۨۧۘۡۛۨۗۡۡۘۚۚۢۛۗۦۘۘۨۘۛۦۨ";
                    break;
                case 125129900:
                    k2.logToFloatingWindow(l2.decrypt("0TAHRj0TJ2MH4ZeXxp/cKVfH2wOt5vljDOqWqPGf4wlVyM3I4e0=\n", "sFNzL0t6U4Y=\n"), l2.decrypt("n1vJAQ==\n", "6Dq7b9pF9js=\n"));
                    str = "ۧۜۥۘۛ۟ۗۖۧ۠ۖ۬ۥۧۢۖۘۥۨۢ۟ۜۖۘ۫ۗۨ۬ۖۘۘۦۘۛ۬۟ۘۘ۟۬ۢۡۙۙۗ۠ۦۘ";
                case 135014988:
                    Set<String> set2 = k2.closedPopupIds;
                    str = "ۡۡ۠ۖۙۜۘ۟ۜۦۗۙۥۘۥ۠ۙ۠ۗۘۚۙۖۦ۟۫۬ۖۨ۫ۧۖۘۚ۬ۡۗۖ۫";
                case 322680989:
                case 1760363649:
                    str = "ۙۨۡۘۛۘۜۘۘۤ۠۠ۛۨۥۛۧۤ۟ۛۢۥۘۜۖۗۧ۫ۡۘۗۡۘۘۗ۫ۡۥۡ۬ۨۥۢ۠۫۫ۥۨۖۧ۟ۤۥۤ۟ۨ۠ۜۘ";
                case 328377803:
                    String str12 = "ۛ۫ۨۡۢۢ۬ۤۖۡۦۥۨۖۘ۠ۦۤ۠ۜۡۦۧۙۧۚۦۨۗۙ۬ۜۘ۫ۚۥۙۨۥۛ۠ۜۚ۫ۨۚۤ";
                    while (true) {
                        switch (str12.hashCode() ^ (-524506292)) {
                            case -1945386593:
                                break;
                            case -1360989748:
                                str = "ۙ۟ۡۗۘۜۢۚ۫۠ۢۨۘۥ۟۬ۙۗ۠ۜۘۦۘۖۡۦۘ۟ۜۖۖ۟ۖۘۙۗۡۛۜۦۦۤۖۖۜۧۘ۟ۖۦۥۨ";
                                break;
                            case -49603355:
                                String str13 = "ۥۧۖۘ۠ۤۨۗۧۨۘۡۥ۬ۘ۟ۙۗۨ۠ۙۗۨۚ۫ۨ۠۬ۦۘۚ۠ۧۙۦۗۚۘۦۘ";
                                while (true) {
                                    switch (str13.hashCode() ^ (-2140007946)) {
                                        case -1826620833:
                                            str13 = !activity.isFinishing() ? "ۥۚ۬ۜۨۜۘ۫۫ۦۘۗۚۗ۟ۦۨۘۥ۬ۥۘۙ۬۠۟ۘۘ۫ۖۥۘ۬ۖۖۤۧ۫ۗۛۘۘ" : "ۚۘۡۘۚۧۙۦۘۢۘۚۡۛۦۘ۟ۖۗۘۗۤۥۚ۬ۨۨۛۖۘ۬ۡۙۘۥۜۥۘ";
                                        case -1752281422:
                                            str13 = "ۥۤۤۡۖۘۘ۬۬ۘۘۛۘۢۦ۟ۖۗۜۘۛۙۚۖ۬۬۟ۢۜۘۤۥۛ";
                                        case -1711004138:
                                            str12 = "ۙۨۘۘ۠ۜۛۚۧۜۢۜۨ۟ۡۥۘۦۦۖۖۧۥۚۙۧۡ۫۟۠ۛ۬";
                                            break;
                                        case 359968230:
                                            str12 = "۠ۜۧۡۡۜۢۚۖۘۦۤۖۤۖۧ۬ۜ۬ۥۛۢ۟ۥۡ۠ۘۢۘۡۜۢۜۨ۟ۥۨۥۥۘۛۖ";
                                            break;
                                    }
                                }
                                break;
                            case 1629106958:
                                str12 = "۫ۤ۬ۘۗ۫ۘ۬ۗۦ۬ۘۘ۫ۘۡۛ۠ۤۖۡۢۚۨۡ۠ۧۥۘ۠ۙۗۧ۫ۘۘ۬ۙۖۘ";
                        }
                    }
                    break;
                case 436890023:
                    new x0(dialog, activity).show();
                    str = "ۚۥۢۢۖۡۘۜۗۢ۫ۜۘۗ۫ۚۜۦۛۜۗۦۡۥۧۘۖۧۖۘ۫ۡۥ۫ۨۥۜۡ۟۫۟ۖ۬ۥۨۥ۫ۙۛ۬ۘۘ";
                case 438679756:
                    String str14 = "ۗۚۚۢۜۡۘ۟ۛۢۧۜ۠ۦۜۘۖۤۥۘ۫۫ۛ۬ۚۛۙۛۛۧۡۙۛۡۘۦۘۗ۟۟ۖۘۡۜۨۘۡۧۧۛ۠ۥۘ";
                    while (true) {
                        switch (str14.hashCode() ^ 877448840) {
                            case -1454688765:
                                String str15 = "۬ۘۛۡۗۨۘۗۦ۟ۧ۫ۦۘۤۖۦۖ۬ۛ۬ۘۜۡۤۨۘ۠ۖۖۘۘۘ۬";
                                while (true) {
                                    switch (str15.hashCode() ^ (-1493984496)) {
                                        case -2006553509:
                                            str14 = "ۦۦۘۘۜ۫ۡۘۥۚۨۧۗۚۨۙۖۘۙ۠ۦۙ۬ۨۘۤۥۡۖ۫ۜۘۤۙۜۧۡۢۦۘۘ۟۫ۖۘ۟ۗۦۘ";
                                            break;
                                        case -948286585:
                                            str14 = "ۧۧۘۘۚۨ۠ۤۘ۠ۖۘ۬ۛۥۘۙۙۜۘۡۜۦۘۛۛۤۤۢۜ۟۫ۡۘۖ۠ۖ۠۫ۤۖۙۦۘۢۛۛ";
                                            break;
                                        case -483083997:
                                            str15 = !activity.isDestroyed() ? "۠۬ۘۜۜۨۘۤۨۡۘۥ۠۫ۦۙۜۜۖۜۘۡۘۥۜۜۜۘۢۚ۬ۦ۠ۤ" : "ۖۜۗۛۗۧۨۚۜۚۘۢۗۜ۟ۘۖۘ۬ۤۜۘ۬۠ۦۘۦۗۢ۫۟ۥۘۡۗۛۚۖۨ۠ۙۚۗۧۗ";
                                        case -302125654:
                                            str15 = "۫ۘۡۢ۠ۦۜۙۦۖۦۧۘۥ۬ۖۘۦۡ۬ۖۨۘ۠ۜۜۘۨۗۖۢۦۢۘۡ۫ۜۖۡۢۚۡۘ۫۬ۦۙۦۗۤۤۧ";
                                    }
                                }
                                break;
                            case -182823579:
                                str = "ۤۛۚۦۘۥ۫ۧ۫۠۫ۦۘۡۥۚۜۜ۟ۖۤۨ۟ۛ۟ۗۢۨۜۜۡۘۜۦۥ۫ۨۖۥۛۙۜۤ۫۠۬ۛۢۦۚ۫ۦۘۨۧۦ";
                                break;
                            case -108600234:
                                str14 = "۟ۘۘۘۢۥۖۘۙۦۛۨۗۡۘۥۤۙۦۧۡ۠ۛۖۘۧ۟۫۠۟ۨۘۗ۫ۦۘۡۛ۠ۧ۟ۜ";
                            case 1712133140:
                                break;
                        }
                    }
                    str = "ۘۗۡۚۡۖۦۥۘۧۗ۫۬۠ۛۢۨۨۘۛۘۜۘۛۙۥۜۚۛۤۗۦۘۨۡۚۨۡۚۤۜۗۜۥۘۜۜۥۘۘۨۜۧۗۦۧ۫ۜۘ";
                    break;
                case 459969399:
                    k2.logToFloatingWindow(l2.decrypt("28fj6WD2VB0NFnM4m3qvV10wP6zwA4odBh1yB6x6kHdfPylnvAg=\n", "uqSXgBafIPg=\n"), l2.decrypt("1yLPwg==\n", "oEO9rLZ/Jm8=\n"));
                    str = "ۧۡۥۥۙۦۢۧۨۤۚۥۛۜۛۗۘۢۦۙۜۜۖۨۘ۫ۘۘۘۧ۫ۨۘۗۥۧۘۛ۫ۨ";
                case 494534255:
                    String str16 = "ۖۢۢۙ۬ۜۢۦۘۦۚۥۡۖۘۘۤۗۗۢ۟ۤ۠۬ۖۘۙۜۗۥۙۡۘ۫۫ۨۨ۬ۗۡۜۜۘۧۢۨۘ۬ۦۡۚۤۤ";
                    while (true) {
                        switch (str16.hashCode() ^ 1176558087) {
                            case -1635628714:
                                str16 = "ۤۗۛۦۧۧ۠ۢۦۢۦۨۘۥۚۛۙۚ۫ۥۚۦۘۜۦۙۙۙۦۘۘۜ";
                            case -1583330738:
                                String str17 = "ۜۦۦ۠ۗۥۦۦۥۘۘۢۚ۬ۗۦۚۨۘۚۚۜۛۙۢۤۙۙۤۚ۠ۗۗۤۘۘۗۡۘۘ۬ۘۧۘ";
                                while (true) {
                                    switch (str17.hashCode() ^ 659903703) {
                                        case -1926680829:
                                            str16 = "۫ۦۛۚۖۨۤ۟ۦۜۧۨ۫ۙۥۨۖۘۡ۬۟ۚۦۧۦۧۦۛۘۛ";
                                            break;
                                        case 945002100:
                                            str17 = !activity.isFinishing() ? "۟۫ۥۘۖۙۖۘۛ۟ۘۘۘۥۖۘۖۗۖۗۚۡۘۘۗۙۙۘۘۘۗۢۡۘۦۤۜۘ" : "ۚۥ۫ۘۛۙ۠۫ۧۖۧۘۘۖ۬ۙۦۙۡۛۚۦۘ۟ۜۡ۠ۡۥۘۖۥ۬ۤۨۘۘ۫ۖۘ۠ۛۜ۠ۤۖۤۜۨۘۖۘۖۘ۬ۧ۟ۧۘۘۘ";
                                        case 1138290544:
                                            str16 = "ۡۜۜۘۚۤۛۘۙۛۚۗۘۘۡۢۢۨۡۚۗۙۢ۠ۢ۫۬ۚۧ۬ۨ۟۫ۡ۫ۛ۠ۜۘ۬ۦۜۘۘۚۗۢۧۘۨۘۜ";
                                            break;
                                        case 2057942378:
                                            str17 = "ۡۜۗۢ۟ۥۘۤ۟۠ۜۧۛۡ۫۠ۧۨ۟۬ۜۜۤ۟ۦۘ۟ۨۜۘ۫۠ۢۨۛۡۘ۠ۢۡۧۤۜۘ۟۟ۜۛۡۘۤۢ";
                                    }
                                }
                                break;
                            case -1431349931:
                                break;
                            case 626604391:
                                str = "ۤۥۧۦۥۙۛۧۚ۫ۨۘۘ۫ۙ۠ۙۗۢۛ۫۟ۦۥۨۘۦۛۥۘ۟ۡۢۨۙ۫ۢۘۦۘۡۥ۟ۖۥۘۢۥۨۘ۬ۗۦۘۢۤۨۘۦ۬۬";
                                break;
                        }
                    }
                    str = "۫ۗۛۦۧۨۘۚۛۨۤ۠ۨۘۜ۬ۜۘۖۨۡۡۡۘۘۢۥۢۗۘۘۢۙۘ۠ۡۨۘۢ۬ۜۘۢ۫ۦۖۜۥۘۧۛۨۡۡۤ۠ۜۖۘ۫ۗۛ";
                    break;
                case 497380373:
                    k2.confirmPopupShown(dialog);
                    str = "ۤۦۜۘۘۗ۟ۤۛۘۤۜۗ۠ۨۦۛۖۧۛ۠۫ۡۖۢۨۥۥۘۧۢۖۥۚۜۙۘۥۥۖۢ۠ۖۘۡۘۦۗۖۛ";
                case 558408229:
                    k2.confirmPopupShown(dialog);
                    str = "ۚۢۗۗۡۦۘۜ۠ۚۗۚۘۘۨۘۦ۫ۡۥۚ۟ۧۚۦ۠ۤۥۨۥۘ";
                case 671173564:
                    String str18 = "ۤۛۜۘۢۜ۟۬۟۬ۗۦۤ۫ۡۧ۫ۨۨۚۚ۫۟۬ۘۘ۠ۨۨۘۡۖۘۦۘۙۜ۠ۢۚ۟ۛۙۥۡ";
                    while (true) {
                        switch (str18.hashCode() ^ (-1871907543)) {
                            case -1550795192:
                                str = "ۧۜۥۨ۟ۦۖۖۚۙۗۢۧۦۘۦۥۡ۠ۥۧۘۗۘۗۙۘۚۧۦۜۘ";
                                continue;
                            case -545971255:
                                str = "ۚۡۨۘۚۙۛۤۨۛۖ۟ۚۥۢۘ۫ۖۙۢۖ۠۠۫ۢۥ۫ۨ۬ۢۨۘ۠ۤۖۘ۠ۖۛۛ۬ۜۦۛۢۜۗۧۦۜۨ۠ۡۡ۬ۙ";
                                continue;
                            case 198774476:
                                str18 = "ۨ۫ۢۙ۫ۤۗۦۜۘ۬ۜ۬ۗۤۢۚ۬ۖۢۤۚ۟۟ۧۘ۠ۧ۠ۘۛ";
                                break;
                            case 1030354616:
                                String str19 = "ۜۥۥۘۤۢۘۘۧ۬ۖۘۖ۬ۖۡۗۧۚۤ۫ۗۖۘۤۘۚۦۦ۫ۛۛۦ";
                                while (true) {
                                    switch (str19.hashCode() ^ (-1883569966)) {
                                        case -876062825:
                                            str18 = "۟ۗۢۦ۠ۛۘۢۜۘۤۚۘۘۘ۫ۢۤ۟۠ۦ۬۠۠ۜۘۘۖۨۚۗۖۛۚۦۘۗۨۘۘۡۖۛۘۛۙ۠ۥۖۨۢۨۘۜۥ۟ۨ";
                                            break;
                                        case -687570139:
                                            str19 = z ? "ۥ۠ۜۘۤ۟ۥۗۥۥ۫ۥۡۘۤۙ۬ۦ۠ۥۘۦۡۘۖۧۜۘۗۤۜ۠ۜۖۘ۫ۛ۟ۢۢۘ" : "۟ۜۛۖۙۢۥ۫ۧۖ۠۟۠ۨۘ۟۬ۦۘ۫ۧ۫ۤ۬ۤۖۤۡ۫ۧۜ۬ۛۜۘۦۗۧۥۛۨۘۢۛۛۢۙۜۘۚ۫ۜۘ";
                                        case 445037737:
                                            str19 = "۫ۧۚۙۨۨۡۜ۟ۙۡۛۛۨۘۤۤۤۡ۟ۙ۬ۗ۫ۗۜۨۛۢۜۘۗۙۧۘۦ۫۠ۛۘۘۨ۠ۦۘۗۗۥۘۛۧۗۥۗۚۜ۟";
                                        case 848930492:
                                            str18 = "ۢۤۜۘ۫۫ۦۘۥۚۡۘۧۜۨۘۢۥۛ۠ۚ۠ۖۛۨ۬ۨۨۘۡ۬ۡۘۚۢۨۘ۠۬ۥۨۦ۠ۦ۫ۥ۟ۦۖۙۜۡۙۧ۟";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 735938966:
                    Utils.monitorDialog(dialog);
                    str = "ۨۘۧۘۢۘۖۘۨۨۙۧۙۦۘۗۛۡ۬ۜۗۦۡۘۤۤۡ۫ۡ۫ۖۘۨۘۧۗ۟ۗۚ۠۠۠ۖۗ۫ۘۘۙۜۗۛۤۡۘ";
                case 905095994:
                    new x0(dialog, activity).show();
                    str = "ۦ۫ۨۘۙۦۨۙ۠ۧۙۨۘۘۥۦۜۘۦ۫۫ۛۜۥۘۜ۬ۡ۫ۦۨۘۛۥۢۢۘۥۘۛۨۘۚۙۙ۬ۦۘ";
                case 938214557:
                    Set<String> set3 = k2.closedPopupIds;
                    str = "ۛۦۧۘۥۤۡۘۥ۟ۨۘۡۛۜۘۡۡۘۘۖ۫ۜۘۦ۬۟ۙ۠ۖۘ۠ۛۦۘۥ۠ۛۦۧۚۘ۟ۨۗ۟ۚ۠ۜ۫ۙۧۛ۫ۗۘ";
                case 960230129:
                    dialog.show();
                    str = "ۧۛۤۖۚۚۖۥۦۙ۫ۙۜ۟ۘ۫ۡۗ۠۟ۦۜۛ۬ۙ۬ۤۨ۟ۜۘ";
                case 966562164:
                    switch (this.a) {
                        case 0:
                            str = "ۡۗۨۛۗۘۘۥ۟ۥۛۨ۬ۙۨ۬ۙ۬ۥۘۘۘۘۗ۬ۜۤۦۘ۠ۘۡۧۘۧۘۛۨۗۥۢۡ۫ۛۤۚۤۖۘ۠۬ۗ";
                            break;
                        case 1:
                            str = "ۜۖۘۘۦۚ۠ۚۛ۬ۢۨۗ۬ۡۖۘۢۜۥۘۘۧۥۢ۫ۥۧۜۤۘۤۘۜۚۨۘ۠۠ۖۘۡ۬۬ۥۡۘ";
                            break;
                        case 2:
                            str = "ۦۛۘۦۛۢۚۖۜۗۘۜۘ۟۫۠ۧۧ۫ۖۜۘۥۧ۬ۨۚۥۧۚۨۘۚۤۡۘ۬ۢۨۘ";
                            break;
                        default:
                            str = "ۖۢۦۨۢۖۛ۬ۢۘۧۖۘۦۙ۬۟۫ۨۤۛۦ۫ۚۛۚ۬ۡۗۗ۬ۖۧۛۙۛۘۗۧ۠ۚۧ۬ۧۜۛ۬ۥۡۨ۠ۚۨ";
                            break;
                    }
                case 1144352126:
                    String str20 = "ۧ۫ۖۤۘۚۦۘۡۘۛۘۜۘ۠ۜۥۙۘۥۖ۟۫ۘۖۜۧۖۦۙۤۙۛۧۗۗۜۙۛۖۘۛ۬ۦ";
                    while (true) {
                        switch (str20.hashCode() ^ 908307174) {
                            case -837964274:
                                str20 = "ۖۖۧۘۜۡۖ۬ۗۨۘۥ۫ۘۘ۟ۙ۫ۨۖۙ۟ۨۨۦۗۗۢۙۨۢۨ";
                            case 437025601:
                                String str21 = "ۡۚ۫ۙۗۖۥۥۘۘ۫ۜۜۛۘ۠۫۠ۚ۫ۥۥۘ۫ۖۘ۫۫ۦۛ۫";
                                while (true) {
                                    switch (str21.hashCode() ^ 1711552647) {
                                        case -1287992875:
                                            str20 = "ۛۖۙۘ۬ۜۘۡۚۘ۬ۡۢۗۗۦۘۢۥۦۘۚ۟ۗۗۤ۟ۧۦۢۖۘۥۛ۟ۚۨۛۤۜۥۛۢۗ۬";
                                            break;
                                        case 891212067:
                                            str21 = "ۜۦ۫ۙ۟۬ۚ۫ۡۘۡۘۡۘۜۙۖۘۡۙۜۧۥ۟ۘۗۥۢۖۖۘ۬۠ۨۜۧۖ۠ۙ";
                                        case 1864950650:
                                            str21 = !activity.isDestroyed() ? "۬ۖ۬۠ۘۥۘۡۜۙ۠ۙۦۦۢۨۘۡۜۨۘۗۘ۟ۧۡ۟ۤۡ۟۬۠ۘۘۘۨۨۦۘۦۚۘۧۨۨۗۦۖۛ۠ۤۙ۟ۜۘۙ۠ۖ" : "ۗۜۥۘ۟۫ۢۘ۠ۢۧۨۘ۟۫ۦۖۜۗۘۚۡۘ۟ۧۧۛۦۤۤۧۡ۠ۡۘۖ۟ۙ";
                                        case 1913906034:
                                            str20 = "ۗۡۘۛۤۛۨۛۙۚ۟ۢۧۜۘۨۤۛۦۥۧۘۡۗۦۘۥۤ۟ۡ۫ۧۗۙ۫ۛۖۘۜۦۖۥۘۨ۬ۖۘۙۦۚ";
                                            break;
                                    }
                                }
                                break;
                            case 877242291:
                                str = "۟ۢۙۤۤۡۘ۟ۗۘۘۥۢۜۦۖۨۦۙۦۘ۬۬۫۠ۥ۠ۨۧۤۖۘ۬۠ۦۚۙۦۘ۬ۧۨۨۗۥۘۡۤۘۘ۫ۘۦۘۧ۠۬۬۟ۗ";
                                break;
                            case 1888270501:
                                break;
                        }
                    }
                    str = "۫ۨۖۘۙ۟ۖۘۦۤ۫ۚۥۡۙۨ۟ۗۜۧۘۗ۫ۥۚۥ۫ۘ۠ۨۘ۟ۜۙۨ۫ۥۘۧۙ۫ۙ۟ۛ۬۫ۡۘۜۡۧ۠۬۟۠ۤۥۧۖۘ";
                    break;
                case 1226465708:
                    k2.logToFloatingWindow(l2.decrypt("Bilfb+DGrBnQ+M++G0pXU4DegypwM3IZ2/POgSxKZHyC+6ThPDg=\n", "Z0orBpav2Pw=\n"), l2.decrypt("ZUMaow==\n", "EiJozeBtNIg=\n"));
                    str = "ۙۨۡۘۛۘۜۘۘۤ۠۠ۛۨۥۛۧۤ۟ۛۢۥۘۜۖۗۧ۫ۡۘۗۡۘۘۗ۫ۡۥۡ۬ۨۥۢ۠۫۫ۥۨۖۧ۟ۤۥۤ۟ۨ۠ۜۘ";
                case 1235358034:
                    String str22 = "ۗ۫ۘۜۡۖۘۜۚۨۥ۠ۨۘۤۗۘۤ۫ۖۘۖۛۥ۬۟ۤ۟ۡۤۙۜۘۤ۟ۤ۟ۧ۬";
                    while (true) {
                        switch (str22.hashCode() ^ 416805185) {
                            case -1275277918:
                                String str23 = "۟ۘۡۘۜۖ۫ۖ۫ۦۖۢۖۘ۬۬ۖۘۜ۠ۧ۠ۤ۠ۦۥۢۥ۫ۖۘۢ۬ۧ";
                                while (true) {
                                    switch (str23.hashCode() ^ (-2091196441)) {
                                        case -1713108985:
                                            str23 = "ۦۡ۬ۤ۠ۛ۠ۙۨۘۡۡۦۘ۟ۦۘۚۡۜۘۖۙۥۘۗ۠ۤۗۦ۫ۗ۠ۚۖۧۛۨۥۗۥۦۘۘۙ۫ۡۖ۠۠ۗۘۡ۠۫۠ۙۙۨۘ";
                                        case -813139668:
                                            str23 = z ? "ۦۨۡ۠ۥۨۦ۬ۥۘۘۢ۬ۧۨۧۘۢۜۤۗۛ۠۫۫۟۟ۦۦۦۧ۫ۨ۫ۦۧ۫ۛ۬ۨۙۙۨۤۡۛۖۘۜ۟۬" : "ۖۦۦۘۥۨۧۧ۫ۗۗۦۥۘۜ۬ۥۘۧۗۘۘۡۧۚۥۢۘۘ۠ۨۦۘۦ۫ۤ";
                                        case 1254104509:
                                            str22 = "ۦ۠ۥۘۖۧۜۘۧۢۚۤۙ۬ۡۦۘۨۧۖۘۖۖۨۗۥۤۘۛۚ۠ۚۡۛۜۧۢۤۦۥۧۨۘۙۚۖۖۥۥۘۧۛ۠";
                                            break;
                                        case 1331481675:
                                            str22 = "ۦۜۙۢ۫ۘ۟ۘ۫ۦۙۡۘۘ۟ۦۘ۟ۚۡۘۗ۠ۖ۫۟ۡۥ۠ۚۚۙۧ۟ۢۡۘۡۨ۬ۙ۫۫ۨۜۥۘ";
                                            break;
                                    }
                                }
                                break;
                            case 564894084:
                                str = "ۦ۫ۖۘۘۖۡۧۖۚۜ۠ۥۘۘۗۘۘۢۡۘ۫ۨۚۨۙ۬ۢۛۡۛۧۨ";
                                continue;
                            case 628266136:
                                str22 = "ۗۢۜۘۥۨۡ۠ۛ۠ۥ۫ۖۦ۠۫۬ۜۡۡۚۖۨۤۦۘ۠ۤۨۘۢۨۛ";
                                break;
                            case 783041017:
                                str = "۫ۘۥ۫ۛۘۡۡۛۦۖۥ۬۟ۙۤۡ۬ۘۗۜۘۗ۫ۨۚۚۘۘۦۡۘۘ";
                                continue;
                        }
                    }
                    break;
                case 1279519650:
                    k2.logToFloatingWindow(l2.decrypt("qLEocnCEDJNGfbuPrsGdynA326Hge/+TZEW7sZE=\n", "ydJcGwbteHY=\n"), l2.decrypt("Bzc72w==\n", "cFZJtaTct0o=\n"));
                    str = "۠ۘۨۘ۟۟۫ۤۚۘۘۥۖۜۘۡۖۢۗ۠۬ۜۢۗۚ۬ۙ۫ۗۥۘۛۜۛۤ۫ۢۢۦۜۘۚۧۨۘۗۜ۟";
                case 1307780032:
                    dialog.show();
                    str = "ۜۛۦۦۧۜۘۡۦۢۖۘۡ۬ۖۨۘۖۜۥۘۡۦۨۥۢۘۘۤ۫ۡۘۤۜۢ۫ۥۥۙ۠ۨۘۚۢۙۤۙۥۘ";
                case 1330828126:
                    k2.logToFloatingWindow(l2.decrypt("vDvM+xFNRTdS918GzwjUbmS9PyiClL43RuZfOPA=\n", "3Vi4kmckMdI=\n"), l2.decrypt("uCrJ4Q==\n", "z0u7jxMSFs8=\n"));
                    str = "ۢۧۗۙۦۤ۫ۖۢۡۤۖۤۖۧۜۙۥۘۜۤۜ۟ۙۗۧۥۤۦۘ۠۬ۢ۟ۨ۬ۗۨۦۘۢۦ۬ۨۘۥ۫۬ۡۘ";
                case 1629453030:
                    str = "ۖۢۤۗۙۖۘۡۧۦۘۤۖ۠۟۠ۦ۫ۛۖ۬ۗۖ۫۠ۘۘۡۙۖۘ۠ۙۘۘۦۧۗۖ۠ۥۘۘ۟ۦۧۙۧ";
                    z = this.c;
                case 1640775229:
                    Set<String> set4 = k2.closedPopupIds;
                    str = "ۤۖۖۘۖۡۥۘۘۡۨۘۤ۬ۨۘۡۥ۠ۢۦۘۢۗۥ۬ۢۘۙۗ۬ۛۙۛۛۤۧۚۗۢۙۡۦۜۧۛ";
                case 1794554776:
                    k2.logToFloatingWindow(l2.decrypt("1msbQfeEupAAuouQDAhB2lCcxwRncWSQC7GKrzsLWPJSpfjPK3o=\n", "twhvKIHtznU=\n"), l2.decrypt("ZWA+VQ==\n", "EgFMOxvyxt4=\n"));
                    str = "ۙۦۜۘۨۤ۫ۤۨ۫ۧۛۥۘۗۛۧۗۥۙۨۤۖۘۜۘۤۡۧ۟۟ۜ۟ۙۚۙۛۥ";
                case 1798254091:
                    k2.confirmPopupShown(dialog);
                    str = "ۚۙۨۘۦۡۤۗۢۤۖۛۛۤۗۥۘۙۖۤۚۡۙۥۥۥۘ۫۟ۘۥۙۧ۠ۥۚ۬ۧۜۘ";
                case 1821228514:
                    String str24 = "ۗ۠ۡۘۖۦۥۘۛۡۗ۟۟ۤۘۧۖۖۚۥۘ۟ۜۧۦۘۥۘ۫ۡۦۘۦۥۜ";
                    while (true) {
                        switch (str24.hashCode() ^ 836680956) {
                            case -1518723737:
                                break;
                            case -1256710243:
                                str24 = "ۡۧۖ۠ۜۜۘۘۙۙۖۛۘ۟ۜۘۡۜۜ۠ۙۗۡۜۙۨۡ۫۬۬ۜ";
                            case -283543793:
                                str = "ۨ۠ۡۘ۬ۗۡۘۧ۫ۥۢۥۤ۠ۥ۫ۘۜۚۖۤۙۘۙۥۡۨۡۘ۠ۚۘۘۧۢۦۘۨۛۤۛۤۢۙۢۡۘۤۡۧۥۖ۟۟۬ۦۨۚۛ";
                                break;
                            case -34239182:
                                String str25 = "ۜۜۦۛۤۘۚ۟۬ۙ۫ۦۘۡۢۨۦ۟ۦۘۢۚۜۨۚۨۘۥۢۧۜۡۦۦۙۤۙ۬ۥۘۤۜۜۘۤۡ۬";
                                while (true) {
                                    switch (str25.hashCode() ^ (-2056905665)) {
                                        case -462531161:
                                            str25 = "ۛ۫ۦ۫ۥۖۘۢۢۘۛۖۨ۬ۙۦۢۨۛۢۜۡۤۚۨ۬ۘۗ۠ۚ";
                                        case 616976584:
                                            str24 = "ۘ۬ۗۛۚۘۘۦ۟ۘۘۥۚۜۛۤۖۘۛۥۖۡۤۨۘۢۨۘۨۥۚۙۥ۠";
                                            break;
                                        case 1218347694:
                                            str25 = !activity.isFinishing() ? "ۖۨۧۘۢۛۘۥۛۤۛۡ۬۬ۛۢۨۦۡۧۨۚۖۨۦۘ۠ۚۥۧۨۢۦۖۖ۟ۦۦۘۘۤ۠ۖۦ۬" : "ۗۢۙۡۧۡۘۤ۟ۨۤۘ۬ۧ۠ۦۘۢۛۢۡۖۚ۬ۨۛۘۖۜۘۚ۠ۛ";
                                        case 1894376518:
                                            str24 = "ۜۗۗۦۤۡۥ۠۠ۡ۬ۘۘۢۖۗۖۘۧۜ۬ۖ۬ۚۢۤۡۗۡۛ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
            return;
        }
    }
}
