package core.pro.android.notify;

import android.view.View;
import android.widget.LinearLayout;
import android.widget.TextView;

/* loaded from: /workspace/unpacked/classes2.dex */
public final class g2 implements View.OnClickListener {
    public boolean a = false;
    public final TextView b;
    public final LinearLayout c;
    public final LinearLayout d;

    public g2(TextView textView, LinearLayout linearLayout, LinearLayout linearLayout2) {
        this.b = textView;
        this.c = linearLayout;
        this.d = linearLayout2;
    }

    @Override // android.view.View.OnClickListener
    public void onClick(View view) {
        boolean z = false;
        String str = null;
        String str2 = null;
        String strDecrypt = null;
        String str3 = null;
        String str4 = null;
        String str5 = null;
        String str6 = null;
        int i = 0;
        LinearLayout linearLayout = null;
        View childAt = null;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        int i5 = 0;
        int i6 = 0;
        String str7 = "ۘ۠ۤۛ۟ۡۘۥ۬ۦۤۦۘۜۖۙۨۥۦۘ۠ۢۥۥۙۤۥۖۘۖۜ۠ۜۥۜۛۘۜ";
        while (true) {
            switch ((((str7.hashCode() ^ 276) ^ 23) ^ 508) ^ 940763448) {
                case -2113802392:
                    str3 = "8sMAFVPo\n";
                    str7 = "ۚۗۛۤ۟ۦۘۖۚۥۚ۟ۤۘۨۥۦۜۤ۠ۜۖ۟ۡۘۘ۟۫ۗ۬۠ۡۘ";
                    break;
                case -2083895101:
                    return;
                case -1992758738:
                    str7 = "ۖۙۜۙۨۗۤۦۡۘۙۗۤۘۖۖۘۥۢۘۘۨۢۤۥ۫ۤۨۖۡۘ۫ۥۗۚۡۥۘۛۥۧۘ";
                    str6 = str;
                    break;
                case -1969582979:
                    str7 = "ۥۖۜۡۡۦۘۧۢ۫ۙ۬ۤۛۙۡۧۘ۬ۤۦۖ۠ۚۘۨۜ۬ۢۖۥۥۤۥۖۛۚ۬۬ۨ۫ۦۘ۠ۢۢۦۘۥۘ";
                    break;
                case -1955918904:
                    str7 = "ۥۖۜۡۡۦۘۧۢ۫ۙ۬ۤۛۙۡۧۘ۬ۤۦۖ۠ۚۘۨۜ۬ۢۖۥۥۤۥۖۛۚ۬۬ۨ۫ۦۘ۠ۢۢۦۘۥۘ";
                    i6 = i;
                    break;
                case -1887900270:
                    str7 = "ۚ۬۟ۖۘۧۧۤ۫ۜۜۙ۠ۨۘۚۧ۫ۛ۬۫ۢۧۨۘ۫ۥۨۘۙۙۨۘ۬ۗ۠ۜۡۜ";
                    i6 = i5;
                    break;
                case -1687008444:
                    str7 = "ۤ۫۫۟ۘۤۧ۟ۗ۟ۦۦۘ۟۟ۙ۟ۡۡۘۚۗۥۘ۫ۚ۬۫ۗۘۘۦۜۜۘۥۙۡۙۢ۟ۢۡۜۛۧۖۘ";
                    break;
                case -1554438119:
                    str7 = "ۦۛۡۤۨۡ۠ۥۦ۠ۨۧ۬ۚۨ۟ۥۘۘ۫ۖۘۜ۬ۚ۠۬۫۟ۘۘۜ۠ۡۘ۬ۖۛۘ۠ۤۘ۠۫ۗ۫ۗۢۗۘۘۛۧۦۖ۠ۥۘ";
                    break;
                case -1327232944:
                    String str8 = "ۖۘۥۗۤۦۡۛ۫ۤۜۜۘۙۨۨۘۡ۬۫۠ۥۢۚۦۨۢ۬ۛۙۢۖۤ۬ۡۢۦۦۢۜ۠۬ۤۘۖ۟ۜ۟ۨۘ";
                    while (true) {
                        switch (str8.hashCode() ^ 1810664527) {
                            case -13479694:
                                str8 = "ۡۙۥۘۖ۬ۧۚ۬ۡۚۡۛۧۙۥۧۤۥۘ۫ۨۧۜۦۘۧ۠ۢۚۨۢۙ۟ۚۜۘ";
                                break;
                            case 125013767:
                                str7 = "۟ۛ۬۟ۜ۬۠ۤ۠ۥ۠ۗۨۡۘۡۙ۬ۖۢۗۘۘۚۛۡۤۜۥۘۨۧۘۘۦۛۜۘۧۥۨۚۦۧۘۛۜ۟ۗۜۤۡۧۧۙ۫";
                                continue;
                            case 1506920774:
                                str7 = "ۚۛۜۤۙۥۘۖۚۘۥ۠۠ۜۦۜۙۛۤ۫ۦ۫ۢۛۚ۫۟ۜ۠ۨ۫۟ۡۢ۟۠ۥۘ";
                                continue;
                            case 1760107267:
                                String str9 = "۬۬ۛۥۘۡۢ۟ۨۚ۠ۡۘۤۢۜۘۦۧۖۙ۟ۖۘۨۨۛۜ۬ۖۢ۟ۢۙۗۖۘۨۨۜۗۤۦۗۡۜۘ";
                                while (true) {
                                    switch (str9.hashCode() ^ 380262871) {
                                        case -1474608648:
                                            str9 = !z ? "ۤ۠ۡۘ۫ۢۜۖ۠ۥۘۦ۬۫۫ۚۚۨۧۘۚۨۘۥۘ۫ۙۛۘۙ۟ۥۘ" : "ۢ۬ۘۘۥۚۧۗۜۥۧۤۧۡۙۨۨ۫ۚۘۚۦۘۖ۫ۛۛۛۢۥۧۖۙۦ۫ۙۨۥۘ۟ۛۙ۬ۚۤۚۡۘۗۦ۬";
                                        case -69599286:
                                            str9 = "ۡۘ۫۠ۡۡۘۧ۬ۧۛۤۦ۠ۜۧ۠۬ۤۥۚۖ۬ۖۖۙۥۘۤۧۡۘۢۤۧۨ۫ۗ۬ۖۤۢۢۧۡۙۜۚۦۘۘ";
                                        case -42687763:
                                            str8 = "ۥۢۗۚۥۧۘۛۥۤۗۡۨۘۖۡ۟ۚۙۡۗ۫۟ۖۘ۫۬ۘ۟ۜۗۥ۠ۛۥۘۗۤۛۛۛۧ۟۫ۙ۠ۢۙۛۨۧ";
                                            break;
                                        case 1977745018:
                                            str8 = "ۤۛ۫ۧۙۢۙۡۛ۟ۥۙۙۧۨۘ۬ۘۡۦ۟ۜۛ۠۫ۜ۫ۤۤ۠ۚ۠ۛۙۡۚ۠ۨ۬ۘۘۛۚۙۚ۬ۙ۠ۚۗۘ۫ۧۙۜۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1086813446:
                    str7 = "ۥ۠ۥ۠ۘۗۗۗۥۧۥۢ۫۠ۡۘۛۛۜۘۥۖۜۜۨۜۘۧۢۥۘ۟ۧۚ۠ۚ۬۫ۧۚۥۥۘ۟۠ۘۦ۫۠۟ۙۖ۟ۡۥۘ";
                    i4 = i2;
                    break;
                case -937925124:
                    i = 0;
                    str7 = "ۗۧۨۨۡۘۜ۬ۖۘ۠ۖۧۚۜۧۘۢۛۦ۬ۜ۫ۦۖۧۙ۟ۥۤ۠ۨۘۙ۠ۜۘۨۨۦۘۘۙۖۡۖۗ";
                    break;
                case -645997376:
                    i2 = 8;
                    str7 = "۬ۧۛۚ۬۠ۢۚۛۖ۠ۧۧ۫ۙۙۙۘۘۘۥۜ۬ۡۧۘۧۢۦۘ۬ۥۥۘۨۦ۬ۘۖۨ";
                    break;
                case -520168282:
                    str7 = "۠۟ۥۜۨۙۗۘۨۘۛ۫ۗۧ۠ۘۘ۠ۨۚۧۖۖۘۖۜۦۘ۬ۖۖ۬ۛۜۘۜۛۨۘۙۦۘۥۖۡۘۜۨ۫ۚ۬ۗۜۙ۟";
                    i4 = i3;
                    break;
                case -448598240:
                    String str10 = "ۜۡۖۘۢ۟ۜۘۥۚۥ۟ۖ۬ۥۘۨۥۡۖۖۚ۟ۦۥ۫ۦۤۛۤۥۜۙۘ۬۟ۦ۟۟۠ۘۚۘۖۘ۬ۜۧۘۨۦۨۘ۟ۛۘۨۗ۬";
                    while (true) {
                        switch (str10.hashCode() ^ (-712188446)) {
                            case -1660128236:
                                str10 = "ۥۥ۟۫ۛۥۘۤ۬۟۠ۥۘۙۙۗۢ۟ۨۥۘۧۘ۬ۛۜ۠ۚ۠ۚۤۖۘۗۦۥۘۘۘ۬۟ۥۖۘۗۧۡۘ";
                                break;
                            case -892607524:
                                str7 = "ۚۗۖۘۤۡۗۧۤۗۦ۠ۘۨۧ۟ۤۜۘۡۘۥ۫ۧۥۘۛۧۖۘۛ۬۠۬۫۫۠ۜ۬";
                                continue;
                            case -491756415:
                                String str11 = "ۢۙۤۜۙۖۘۛۧۤۨۧۘۘۚۙۡۥ۬ۚۚۥۘۤ۟ۡۧۘۤۚ۠";
                                while (true) {
                                    switch (str11.hashCode() ^ (-1408588018)) {
                                        case -2062899666:
                                            str10 = "۠ۨۨۛ۬ۥ۠ۛۛۛۚۡۨۦۢۧۦۨۥۥۘۨۤۡ۠ۦۥۘۚ۠ۛ۠ۜۜۢۨۧۘۢ۟ۧۤ";
                                            break;
                                        case -2036880252:
                                            str10 = "ۘۥۖۘۧۦۙ۠ۙۢ۬ۖۘۡۚۤۚ۟ۗۗۡۤ۠۫۬ۚ۫ۘ۫ۢۘۗۘۜۚۨۧۛۢۜۙۜۘ";
                                            break;
                                        case 527847450:
                                            str11 = "۠ۘ۬۟ۙ۟ۤۗ۫ۘۥۨۤۖۧۛۡۡۘۨۘۨ۠ۥۛۘ۬ۢۧۨۛۧۘۧۘۛۡۚ";
                                        case 1568121450:
                                            str11 = this.a ? "ۚۙۖۘۖۛۨۡۡ۫ۖۙۨۘ۟ۦۖ۟ۜ۬ۢۜۡۦۜۘۗۛ۫ۗۡ۟ۤۨۛ۠ۗۛۘ۫۠ۚۤۙ" : "ۧۡۖۘۚۢ۫ۙ۬ۦۙۚۥۘۧ۠ۢ۬۫ۖۘۥ۬ۜۘۖ۠ۥۘۜۖ۠ۚۜۨ۟ۘۘۘۚۡۘۗۚۨۗ۟۟";
                                    }
                                }
                                break;
                            case 1134643935:
                                str7 = "ۚۧۦۖۜۖۘۘۘۡۘۜ۠ۖ۫ۦۖۧۦۘۥۛۜ۠۠۟۫ۘۘۘۛ۬ۥۡۗۤ۟ۙۛ۠ۢۡۤۧۗۢۦۜۘ۟ۤۗۛۛۖۦ۫ۘۘ";
                                continue;
                        }
                    }
                    break;
                case -411659953:
                    this.b.setText(strDecrypt);
                    str7 = "ۥۙۜ۟ۧۡۘ۫۟ۦۡۘۖۘ۬ۖ۟۬ۘۗۧۚۧۤۧۚۜۛ۟ۗ۟ۙ۫ۢۙۢۙۨۘ";
                    break;
                case -206266185:
                    str7 = "ۙۗۨۘۦ۠ۤ۠ۖۖۘ۫۬۠ۚ۫ۥ۠ۚۘ۬ۙ۠ۥۘۙۙۘۘۘۨۡۘۡۨۘۦۜۡۧ۬۟ۤۢۤ";
                    str5 = str4;
                    break;
                case -107333949:
                    str = "68lIveUI\n";
                    str7 = "ۡۧۤۗ۟ۥۘۧۗۗ۠۬ۤۚۖ۟ۧۡۗ۬ۥۘۤۗۧۚۙۙۡ۫ۙ۠۟ۨۦۚۙ";
                    break;
                case 129633386:
                    String str12 = "ۥۛ۠۟ۗۡۙۚۦۘۤۤۧۡۚۥۜۧۗۜ۬ۜۢۛۦ۠ۖۘۖۥۡۘۧۥۥۘۤۖۘ۬۠ۖ۬ۤۥ۬ۜ۟۠";
                    while (true) {
                        switch (str12.hashCode() ^ (-211806696)) {
                            case -1165672730:
                                str12 = "ۛۥۡۖۙۨۖ۬ۦۘۢ۟۬۬ۤۜۘۨۜۚۥۖۛۨۘۦۜۜۘۥ۟۬ۛ۟ۦۘۖۨۚۦۜۧۢۖ۬ۥۗۥۛۢ۬";
                                break;
                            case 1552695984:
                                str7 = "ۙۚۗۘۘۦۚ۟ۘۜ۠ۤ۠ۦ۫ۧ۠۠ۖ۟ۡۘۚۖۢۧۚ۫ۤۦۥۡۛۚۡۗۧۨۨۨۘۚ۫ۧ";
                                continue;
                            case 1567101479:
                                String str13 = "ۗۨۜۗ۬ۘۘۦ۫۬ۧۖۖۘۤ۬۬۟ۥ۬ۗۖۚۥۚ۬ۚ۫ۜۘۦۧ۠۠ۜۧۘۡۙۖۘۢۧۥۘ۬۠ۖۘ۫ۚ۫ۤۡۘۘۨۜۖۦ۬";
                                while (true) {
                                    switch (str13.hashCode() ^ 817892884) {
                                        case -394838668:
                                            str13 = childAt != this.d ? "ۘۥۖۘۨ۟ۜ۫۫ۘۘ۠ۨۧۤۗۖۘۤۘۦۘۛۨ۬۠ۘۦۘۖۡۚ۫ۡ۟۫۟ۖۘ۠ۘۗ" : "۫۬ۙۛ۬۟ۢۦۘۘۢۤۡۘۙ۫۠ۖۧۛۥۡۦۘۢۧۘۘۖۦۘ۬ۚۨۘۙۗۖۘۨۜۖ";
                                        case 261511530:
                                            str12 = "۠ۛۚۤۛۙۚۦ۫ۥۧۛۘۘۨۘ۫ۢۘ۫۟ۖۛۗۦۘۨۙۙۦۘۜۘۡ۫ۦۘۛۖۙ";
                                            break;
                                        case 517759379:
                                            str12 = "ۖۤۧ۫ۛۜۘۗۙۘۤۛۛ۫۠ۙۦ۬۟۠ۗۙ۬ۤ۟۠ۘۙۛ۫ۘۤۜۘ۫ۡۜۘ";
                                            break;
                                        case 1402138046:
                                            str13 = "ۦۚۖۘۜۖۧۨۥۖۙۜۘۘۢۨۚۚ۬۠ۙۘۙۙ۬ۖ۟ۘۘ۬۫۠ۤۗۖۘ۟ۜۗ۟ۥۖ۠۟ۤۡۛۡۨۨۤۚۜۥۘۢۛۢ";
                                    }
                                }
                                break;
                            case 2054631604:
                                str7 = "۫ۨۥۘۥۤۖۚۡۖۘ۬ۗۢۨۚۘۘ۠ۤۡۜۛۡۚۖۧ۟ۜۥۘ۫ۗۗۜ۬ۤۡۜۘ۟ۡۤۗۜۗۘۖۧۘۦۡۘ";
                                continue;
                        }
                    }
                    break;
                case 170913997:
                    str2 = "A3bQWGuXbqg=\n";
                    str7 = "ۨ۠ۖ۠۟ۤۢۖۤۚ۟۟ۦ۬ۡ۠ۗۚۗۖۘۧۢ۬ۖۘۚۙۚۢ۫ۛ۬ۜۥ۬ۡۖۙۚۙۗۗ۫ۜۙۙۢۡۢۙ";
                    break;
                case 296347129:
                    str7 = "ۨۖ۬ۢۢ۠ۗۘۢ۬ۚۜۜۢۥۖۧۦۗۛۙۙۙۦۘۡۤۜۡۗۧۜۦۤۧۨ۟ۙۜۥۚ۬ۘۘۨۙۙۥۗ۬";
                    break;
                case 445691849:
                    str7 = "۠۟ۥۜۨۙۗۘۨۘۛ۫ۗۧ۠ۘۘ۠ۨۚۧۖۖۘۖۜۦۘ۬ۖۖ۬ۛۜۘۜۛۨۘۙۦۘۥۖۡۘۜۨ۫ۚ۬ۗۜۙ۟";
                    break;
                case 681316683:
                    str7 = "۫ۘ۟ۦ۫ۡ۬ۨۘۛۖۚ۬ۘۜۘۧۜۧۘۤ۟ۥۘ۠ۡۜۘۖۢۗۘۖۡ";
                    break;
                case 715420559:
                    linearLayout = this.c;
                    str7 = "ۗۘۦۘۛ۠ۧ۬ۘۙۡۘۖۘۖۨۧۘۤۥۤۢۘۨۘۜۨۡۘۦۦ۠ۧۗۗۗ۠۫ۧۚۜ";
                    break;
                case 922503003:
                    childAt = linearLayout.getChildAt(i6);
                    str7 = "ۦۧ۟ۙۤۤۖۧ۟ۗۜۖۘۛۙ۬ۤۥۨۚ۟۫ۗۧ۫ۜۙۗ۫ۡۛ۟۟ۚۚۖۧۘ۠ۧۢۨۥ۠ۗ۟ۜۘ۬۟۠";
                    break;
                case 946646937:
                    str7 = "ۤۡۙ۟ۦۛۦۖۜۘۧۜۖۙۜۥۘۦۥۨۘۡۧۡۘ۫۫۬ۥۧۥۘۨۤۙۡۚۨۘۜ۫ۡۘۧۚۗ۬ۖۧ";
                    str6 = str3;
                    break;
                case 1418227489:
                    this.a = !z;
                    str7 = "ۥۙۦۘۗ۬ۖۘۜۡۡۧۡۚ۫ۚۨۘ۠ۤۡۗۧۧۙۜۘۘۜۙۡۘۜ۫ۡۘۛ۬ۖۡۜۦۖۚۡۘۨۜۘ۬ۨۡۡۘۧ";
                    break;
                case 1453904452:
                    i5 = i6 + 1;
                    str7 = "ۖۗۘۜۖۤۜۨۧۚۥۦۙۨۨۘ۠ۚۤۡۤۖۚۧۨۘۦۗۜۘۥۖۨۘۙۥ۠ۨۚۤۤۗۡۧ۟ۘۧ۬ۛۙۙۘۘۦۥ۬ۛۡۨ";
                    break;
                case 1483832987:
                    str4 = "FX+p8ONnGSg=\n";
                    str7 = "ۙۦۦۘۘۨ۬ۤۘۜۢۜۢۡۚ۬ۖۘۜۖۧۙ۟ۙۥۖۦۘۘۡۙ۫ۘۡۘۧۤۘۘ";
                    break;
                case 1500817115:
                    childAt.setVisibility(i4);
                    str7 = "ۙۚۗۘۘۦۚ۟ۘۜ۠ۤ۠ۦ۫ۧ۠۠ۖ۟ۡۘۚۖۢۧۚ۫ۤۦۥۡۛۚۡۗۧۨۨۨۘۚ۫ۧ";
                    break;
                case 1595406752:
                    i3 = 0;
                    str7 = "۫ۦۛۨۦۘ۠ۨ۫ۜۗۢۖۘۗ۬ۦۦۚۢ۟ۤۨ۬۠ۖۚۢ۬ۜۘۗ۟ۗ۟ۙۥۘۖۘۥۥ۫۟ۢۨ۠۠ۧۖۘۜۡۗۡۥۢ";
                    break;
                case 1661742239:
                    strDecrypt = l2.decrypt(str6, str5);
                    str7 = "ۜ۠۟۟ۙ۬ۛ۟ۜۢۤۜۘۙۡۢۢۚ۬ۛۢ۟ۤۚۤ۟ۨۘ۬ۦۘ";
                    break;
                case 1700441945:
                    str7 = "ۤ۫۫۟ۘۤۧ۟ۗ۟ۦۦۘ۟۟ۙ۟ۡۡۘۚۗۥۘ۫ۚ۬۫ۗۘۘۦۜۜۘۥۙۡۙۢ۟ۢۡۜۛۧۖۘ";
                    str5 = str2;
                    break;
                case 1837882919:
                    String str14 = "ۗۜۨۦ۫ۘۘۤۚ۬۬ۦۜۘ۠ۜۢۜ۫ۘۤ۠ۙۧۧۗۖۡ۫ۚۛۤۛۧ۠۟ۚ۠۠ۧۘۘ۬ۚۤۙۖۡۚۗۥۥۥۘۘ";
                    while (true) {
                        switch (str14.hashCode() ^ (-432647073)) {
                            case -1998422173:
                                str14 = "۫ۘۚ۠ۜۡۦۙۡۜۢۤۧۙۙ۬ۗۛۥۧۘۖۛۦۘۛۚۘۘۧۘۨۘ۬ۨۚۤۨۗۤۛۜ۫ۖۜ۠ۖۘۧۥۘۛۜ۠ۚۖۘ";
                                break;
                            case -1117142743:
                                str7 = "ۦ۟ۧۘۘۧۘۘۗۚ۟ۜۦۚ۠ۥ۟ۜۜۘۗۤۢۦ۠ۜ۟۫ۤۖ۫ۙ";
                                continue;
                            case -482718515:
                                str7 = "۫ۦ۠ۥۧۢۥۚۥ۠ۙۤۖۖ۬ۧۘۦۤۤۛۧۜ۬ۖۢۙ۟ۛۙۘۤۥ۬۠۬ۛۛۗۨۙۚ";
                                continue;
                            case 468938849:
                                String str15 = "ۛۙۙۤۡۨ۟ۥۥۧۤۧۦۚۖۚۚۚۜۡۡۦۚۖۤۢۡۘۦۡ۠۠ۖۨۙۤۦ۟۬ۜ۠ۜۥۙ۬ۘۗۜۢۙۢۨۨۜۡ";
                                while (true) {
                                    switch (str15.hashCode() ^ 280398563) {
                                        case -2052259994:
                                            str14 = "ۙۘ۬ۥۙ۫ۛۧۜۘ۟۟ۖۘۨ۬۟ۙ۟ۜۤۚۚۗۗۚۜۛ۫۠ۡ۟۟ۧۙۢۜۖۘۛۖ۫ۥۧۛۚۛۤۦۦۗۚ۠ۗ۬ۤ";
                                            break;
                                        case -1456053117:
                                            str15 = i6 < linearLayout.getChildCount() ? "ۨۧۙۙۜۨۘۙۖ۟ۚۚۥ۬ۥۘۢۛۛۢۜۘ۠۫ۘۘۧۤۙۖۙۘۧۢۜۧۥۛۡۘۛۥۚ" : "ۦۛۤۛۨۘۚۚۖۨ۬ۖۘۦۤۜۘۛۖۡۜۙۙۥۢۘ۫ۛۛۤ۟ۘۢ۬۫ۚ۬ۤۡۢۜۙۦ۫ۛۖۧ۫۬ۡ";
                                        case -95221555:
                                            str15 = "ۙۗۜ۟۠ۜۘۖۘۘۘ۬ۚۡۘۦۦۛۚۜۡۘۢ۫ۡۘ۫ۗ۠ۡ۫ۨۘۘ۬ۥۘ";
                                        case 1194261056:
                                            str14 = "ۥ۬ۧۘۗۖۘۖۘۖۘۡ۬ۨۚۗ۬ۗ۫ۘ۬۟ۢ۬ۜۧۘۙۖۥۙۤۨۘۗ۫ۙۥۜۘۙۦۖۘۨ۠ۘۘۤۘۜۤۙۖۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 2130247145:
                    z = this.a;
                    str7 = "ۙۧۖۘۙۚۥۖۗ۟ۛۙۛۛۚ۟ۙۜۨۜۤۖۨۢۗ۫ۘۘۗۧۚ";
                    break;
            }
        }
    }
}
