package core.pro.android.notify;

import gTBLD.dev.XSSTG.free.MainActivity;

/* loaded from: /workspace/unpacked/classes2.dex */
public final class j0 implements Runnable {
    public final k0 a;

    public j0(k0 k0Var) {
        this.a = k0Var;
    }

    @Override // java.lang.Runnable
    public void run() {
        k0 k0Var = null;
        String str = "ۧ۬۟۫ۘۖۘ۫ۘۘ۫ۧۦۚۤۖۢۦ۟ۘۖۜۘ۫۫ۧۘۜۦۥۗۥۡ۠۬۬ۚۦۡۧۘۦۡۨۥ۟ۦۢ۠ۨ";
        while (true) {
            switch ((((str.hashCode() ^ 104) ^ 628) ^ 742) ^ (-839292715)) {
                case -2008282989:
                    k0Var = this.a;
                    str = "۬۠ۚۨۛۖۡۗۤۤۙ۠ۙ۫ۚۚۙۦۜۛۧۧۨۘۨۖۢۤۢۥۗۢۜۗۙۡ";
                    break;
                case -1806532520:
                case 387652036:
                    return;
                case -1582544746:
                    str = "ۥۘۖۙ۟ۘۖ۠۠ۡۗۛۘۛۙۜۤۖ۫۫۫ۡۥۘۡۥۦ۠ۥۗۥۧۢ۫ۢۥۥ۠۟۫ۥۘ";
                    break;
                case -1323941146:
                    String str2 = "ۤۙۜۤۢۥۘۧ۟ۦ۠ۜۧ۟۟ۥۘۜۚۘۘۤۦ۬ۥۜۡۨۗ۠ۖۥۡۦۘۥۘۧۜۘۨۤۧۛۗۤ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1707588375)) {
                            case -2063053693:
                                str = "ۡۦۛۙۢۤۦۤۛ۬ۖۘۖۙۦۘۚۡۥۚۦۙۗۙۥۢۛۥۘۚۘۙ";
                                continue;
                            case -910706403:
                                String str3 = "۫ۙۗۡۥۨ۫ۚۢ۠ۙۦۗۡۢۥۨۘۥۘۘۘۧ۟ۡۘۥۦۨۛۡۚۧۨ۠۬۬۬ۥۘۘۧۢۚ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1673914048)) {
                                        case -1147850915:
                                            str2 = "۟ۡۦۦۗۡۦۚ۫ۗۥ۠ۡ۬ۜۥۚ۟ۦۚۦۘۗ۫ۗۥ۟ۥ۫ۥ۬ۦۡۖۘ۟ۖۥۘ";
                                            break;
                                        case 376773508:
                                            str3 = "ۜ۠ۛۙۦۜ۟ۛۤۘۛۧۧۜۥۨۘۘۧۜۘۘ۠ۨۘۘ۫ۛۥۘۧۖۦۘۡۜۖۘۧۡۡ";
                                        case 2017361960:
                                            str3 = MainActivity.access$200(k0Var.a) ? "ۛۦۦۖۚۨۤۚۖۘۦۜۦۘۨ۬ۥۘۘۘۧ۬ۢۗۨۘۜۚ۠ۘۘۦۧۥۘۦ۬۟ۨۦۧۘۥۧۧۦۛۦۗۢۦۡۖ۟ۦۡۧۙۘۘ" : "ۥۧۗۖۦۗۨۡۜۘ۟ۘۙۙۤۜۘۜۛۧۖۗۜۘۖۜۙۚۛۡۗۥۡۘۗۢ۫۠ۧۡۘۨ۠ۖۘۢۧۗ";
                                        case 2058114385:
                                            str2 = "ۛۖۥۘۤۖۤ۟ۚۛ۟ۗۥۦ۠ۦۗۤ۬ۚۡۘ۬ۘۧۘۘۤ۬ۨۛۙۦۢۥۦ۫ۤ۫ۙ۟ۦ۫ۚۘۗ۟۫ۛۘۜۘۘ۠ۦۚ";
                                            break;
                                    }
                                }
                                break;
                            case 1039149322:
                                str = "ۗۥ۠۫ۘۢۦ۬ۥۘۡۧ۟ۡۜۖ۫۟ۗ۠ۥۜۘۜۧۦ۫ۢۨۘۡۙۗۧۢۥۘۧۢۗ";
                                continue;
                            case 1790687554:
                                str2 = "ۥۢۗۜ۠ۨۤۘۢۚۚۥۘ۬ۚۙۙۡۛۙۥۘۥۗۥۘۜۥۧۨۗۖۘۙۦۡۘۧۤۖۨۗۜ۠ۧ۟";
                                break;
                        }
                    }
                    break;
                case -590282475:
                    MainActivity.access$300(k0Var.a).post(MainActivity.access$500(k0Var.a));
                    str = "ۗ۟ۘۘۡۗۢ۟ۥۖۡۡۡۘۢۚۛ۬ۡۡۖۡ۠ۥۢۨۢۙۧۛ۠ۥۘۛۜۗۤ۠ۥ";
                    break;
                case -482365853:
                    MainActivity.access$600(k0Var.a);
                    str = "ۥۘۖۙ۟ۘۖ۠۠ۡۗۛۘۛۙۜۤۖ۫۫۫ۡۥۘۡۥۦ۠ۥۗۥۧۢ۫ۢۥۥ۠۟۫ۥۘ";
                    break;
                case 2112178185:
                    String str4 = "۟ۜۤ۠ۜۢۨۦۧۘ۟۬ۡۘۗۤۦۘۨۦۜۙۙۙ۫ۜۘۘۧۥۧۦ۟ۢۘۢۨۘۖۡۜۦۛۡۘۛۥۖۘۢۦ۠ۧۖۜۘۛۜۘۗۗۨ";
                    while (true) {
                        switch (str4.hashCode() ^ (-848742908)) {
                            case -1401701452:
                                str = "ۘ۫ۚۥ۬ۡ۟ۧۛۡ۫ۦۜۗۤ۬ۖۧ۫ۜ۫ۛۘۥۘۚۘۨۘۜ۬ۙۜۙۖۘۥۚۥۘۙۘۦۘ۠۬۟";
                                continue;
                            case 251270564:
                                str = "ۤۤۘۘۤۢۜۧ۟ۢۛۧۤ۫ۘۛۚۨۢ۟ۘۙۚۙ۫ۗ۟۫ۥۚۜۘۛۛۥۘۖۨۧ";
                                continue;
                            case 718093442:
                                String str5 = "ۢۜۚۡۚۦۘۛۨۨۘ۫ۗۡۢۥۧۘۦۧۚ۬ۚ۫ۤۗۨۘ۟۟۫ۙۢۙۥۛۖۘ۟ۨۦۙۘۜۡۙ۠۟ۜۧۡۥ۫ۚۨ۟ۛۙۜۘ";
                                while (true) {
                                    switch (str5.hashCode() ^ 2076666570) {
                                        case -908759523:
                                            str5 = "ۚۧۘۗۚۘۘۥۡۢ۫ۛ۫۟ۢۖۗۤ۠ۥۜۘۖۡۨۘۘۚۙ۠۫ۚۥۡ۬۫۠ۛۤۥۙۤۖۧۜۘۘۜ۬ۜ۟ۥۘ۠ۥۥ";
                                        case -634963679:
                                            str5 = MainActivity.access$400(k0Var.a) ? "ۛ۫ۜۘۡۥۥۘۡۨۘۘۡۖۜۘۘۦۚۘۧۧۥۙ۟ۛۗۜۧۤۥۖ۟ۜ۬ۤۛۜۚۙۛ۟۬ۨۗۡۘۥۛ۫ۚ۫ۘۘ" : "ۧۜۥۘۤۗۚۥۛۥ۬ۥۨ۬ۦۘۜ۬ۙۜۛۦۗۜۘۘۗ۟ۘۘۘۧۦۘۘۨۛۤۦۘ";
                                        case 53496072:
                                            str4 = "۟۫ۛۚۦۨۘۚۚۚۛۡۘ۫ۡۨۘۧۥ۠ۦۖۚۘۤۜۘۜۨۧۘۡ۠ۖۡۚۢ۫ۙۥ";
                                            break;
                                        case 740769628:
                                            str4 = "ۡ۟ۘۘ۟ۨۢۢۜۙۦۙۥۥۨۥۛۗۥۘۥ۠ۘۘۨۙۙ۟ۢ۠ۦۙۡۘ۟ۢ۬ۢۢ۬ۧۥۘۖۨۨۘۛۢۥۨۥۘۙۚۛۤ۬ۡۘ";
                                            break;
                                    }
                                }
                                break;
                            case 2089993483:
                                str4 = "ۖ۫ۡۘۥۧۥۘۖۚۛۗۡۦۘۡ۫ۜۘۦۚۙۦۥ۠ۥۢۥۘ۬ۚۡۘۦۨۛ";
                                break;
                        }
                    }
                    break;
                case 2125547940:
                    str = "ۛ۠ۥۗ۫ۙ۬ۗۖ۬ۗۚۙۖ۫ۛۙۖ۠ۤۤ۠ۚ۠ۗۚ۬ۧۢۜۘۖۚۜۦۥۜۚۦۤ۟ۥۗ۬ۥۚ";
                    break;
            }
        }
    }
}
