package core.pro.android.notify;

import java.nio.charset.StandardCharsets;

/* loaded from: /workspace/unpacked/classes2.dex */
public final class l2 {
    public static String decrypt(String str, String str2) {
        String str3 = "ۧۦ۠ۥۙ۠ۘ۫ۡۘ۟ۡۛ۠ۙۘۜ۬ۛۗۙۡۘۢۛۙۘ۟ۚۦۨۙۤ۫ۥۛۘۨ";
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        int i5 = 0;
        int length = 0;
        int length2 = 0;
        byte[] bArrA = null;
        byte[] bArrA2 = null;
        while (true) {
            switch ((((str3.hashCode() ^ 483) ^ 549) ^ 968) ^ 692125255) {
                case -2016319489:
                    str3 = "۟۠ۙ۟ۛۘۙۘ۠ۡۘۗۘۛۤۦۛۡۘۢۜۙ۟ۡۜ۟ۨۘۢۡۙ";
                    i5 = i;
                    break;
                case -1837216767:
                    str3 = "ۦ۟ۦۤۛۨۘۜۨۥۘۛۚ۫ۦۡۘۦۢۘۖۧۨۘۗ۫ۚ۫ۖۖۚۧۚ";
                    break;
                case -1834525199:
                    str3 = "۫ۖۛۗۖۜۗۢ۟ۨۤۗۥۧۜۨۧۘۘۤۨۦۘۦۙۙۜۡۦۘۥ۬ۘۦۙۖۘۙۥۖۘ۫ۗ۫ۦ۫ۜۜۜۛۘۘۜۘۥۗۧۤۗۗ";
                    i5 = 0;
                    break;
                case -1641991751:
                    str3 = "ۡۤۚۡۦۦۘۚۘۜۚۧۥ۫ۘۖۘ۠ۚ۟ۚۗۦ۟ۢۨۘۖۧۜۘۧ۠ۘۦ۬ۡۤۙۡۘ";
                    break;
                case -1478366207:
                    str3 = "ۨۤۖۘۨۨ۬ۥۨ۠ۦۢۘۘۧۖ۫ۥ۫ۖۢۧۚۨ۬۟۬۫ۨۥۖۘ۠ۗۖۧۘۘۘ";
                    break;
                case -1191810408:
                    length2 = bArrA2.length;
                    str3 = "ۥۡۙۗۥ۟ۘۨۗۜۡۘۤۢۨۘۦۦۛۡۗۧ۠۬ۘۘۢۗ۠ۚۨ۫ۢۘۧۤۨ";
                    break;
                case -1136837156:
                    String str4 = "۬ۖۨۘۙ۟ۡۘۧۛۜۘۖۡۘۙۥ۠ۢ۫ۗۚ۬۬ۜۙۥۛۢۘۘۤۜۡۘ";
                    while (true) {
                        switch (str4.hashCode() ^ 43851354) {
                            case -1612187746:
                                String str5 = "ۡۨ۬۟ۢ۫ۥ۬ۦۘۤۢۨۜۖۘ۟ۖۡۦۡۙۦۗۗۦۥ۟ۦۤۛ";
                                while (true) {
                                    switch (str5.hashCode() ^ 1453089589) {
                                        case -1479081633:
                                            str4 = "ۚۙۖۤ۬ۜۘۡۛۜۛۨۜۘۖۦ۬۫ۡۘ۠ۙۖۘۙۚۧۛ۬ۗۚۨۦۘۢۨ۟ۜۛۨۘۜۡۥۘۘۤۢ";
                                            break;
                                        case -33587007:
                                            str4 = "ۤۗۛۥۗۚۡ۬ۚ۠ۤۖۢ۫ۗۛۨۧۘ۫ۜۚۘ۠ۥۘۡۖۙ۠ۥۧ۬۬ۥ۟ۗ۟ۜۦۡۘ۠ۡ۠ۥۢۘۢۡۜۘ";
                                            break;
                                        case 1282769642:
                                            str5 = i5 >= length ? "ۦۗۜۜۛ۠۟ۘۜۚۘ۬ۧۜۡۘۖۥۢۚۨۘ۬ۘۚ۫ۖۛۦ۫ۡۘۦۜۡۘۗۡۡۘۤۨۖ۟۠ۜۤۢۨۘۘ۫۬ۜۥۜۚۤ" : "ۜۘۨۢ۫۫ۢۦۢۤۦۜۙۖۥۢۥۚۢۦۦۘۥ۠ۜۘۢۛۦۘ۬ۥۢ۟ۨۖۖۛۖۢۢۛ۫ۚۗۧ۠ۖۘۡۚ۬ۛۚ۬ۨۤۖۘ";
                                        case 1437554654:
                                            str5 = "ۤ۫ۥۙۧۤۖ۬ۡۤۜۙ۫ۨۤۖ۫ۡۘۧ۫ۥۘ۬۟ۘۘ۫۫ۦۜۧۤۜۚۥ۠ۧۜۘۚۡۛۧ۬ۜ۠ۤۘ۠۟ۖۘ";
                                    }
                                }
                                break;
                            case -1372849559:
                                str3 = "ۦ۟ۢۘۢۗۚ۫۬ۛ۠ۨۘۚۚۖۘۦۛۡۜ۬ۥۘۤۛ۫ۢۜۚۢ۬ۜۘ۠ۜۡۘۖۤۖۘۢ۠ۘۙ۫۬ۨۡۘۘۖ۫ۖۘۡۤ۬ۚ۠";
                                continue;
                            case -1010608568:
                                str3 = "ۨۜۦ۠۠ۦۖۡۥ۫۫ۖ۠ۖۢۤۨۘۨۙۜۡۦۡۘۛۤۧۗۘۖۘۘۡۥۥ۬ۙ";
                                continue;
                            case 665303709:
                                str4 = "ۢۤۥۛۥۛۘ۬ۘۘۛۙۥ۫ۧۖۘۖ۟ۙۘۙۨۙۡۚۤۖۖۡۛۥۘۨۥۤۥۤ۟";
                                break;
                        }
                    }
                    break;
                case -1113499162:
                    str3 = "ۗۡ۫ۙۛ۬ۗ۬ۥۧۖۘۚۘ۠ۡ۟ۖۘ۟ۙۖۖ۫۬ۨۜ۬۟ۡۧۡۦۚۨۙۖۜ۟ۨۘۢۢۜۘۤۚۖۚۖۘۘۦۦۘۖۗۖۘ";
                    break;
                case -784621879:
                    return new String(bArrA2, StandardCharsets.UTF_8);
                case -660697422:
                    str3 = "۠ۜۡۘۖ۟ۖۘۚ۟ۖۤۛۧۙۖۘۜۧۘۢ۫ۗۖۙ۫ۢۜۥۘ۬ۘۘۘۢۛۤۡۥۘ۟ۤۘۘۜۜۨۘۛ۠ۨۘ۫۠ۢ";
                    break;
                case -374792636:
                    str3 = "ۦ۟ۢۘۢۗۚ۫۬ۛ۠ۨۘۚۚۖۘۦۛۡۜ۬ۥۘۤۛ۫ۢۜۚۢ۬ۜۘ۠ۜۡۘۖۤۖۘۢ۠ۘۙ۫۬ۨۡۘۘۖ۫ۖۘۡۤ۬ۚ۠";
                    i3 = 0;
                    break;
                case 51353679:
                    str3 = "۟ۤۘ۟۫ۦ۠ۛۨۘ۫۟ۦۘۚۛۜۧ۟۬ۥۖۦۘۜۛۨۘ۫۟۬۠۟ۧ";
                    bArrA2 = g.a(str);
                    break;
                case 374622994:
                    str3 = "ۜۤۖۨ۬ۥۦۜۖۘۘۥۜۧۖ۫ۗ۠ۙۢۢۖ۫ۘۥۡۘۘۧۨۢ۠ۥۛۨۘۘ۠ۤۗۖۧۥۦۙ۟ۚۢۜ";
                    i3 = i5;
                    break;
                case 631147029:
                    i = i3 + 1;
                    str3 = "ۥۥۥۘۜۛۤۖ۠ۨۗ۬۟ۡۥۢۦۢۤۦۛ۟ۢۧ۟ۖۥۢ۬ۘۤ";
                    break;
                case 683584682:
                    String str6 = "ۡۨۚۨۗۢۜۖۦۙۛۤۜۘۡۥۜۗۥۚۦ۠ۡۥ۫ۢۡۘۗۙۦۘۢۜۛۛۜۜۛۜۦۥۙۖ";
                    while (true) {
                        switch (str6.hashCode() ^ 2040676260) {
                            case -1244869868:
                                str3 = "ۗۙۥۡۛ۬۫ۤۥۘۛۥۖ۬ۛۘۥۜۛۥۗۧۤ۬ۗۢۗۙۢۥۘۨۤ۠ۦۖ۬۠ۙۥۘۘۦۤ";
                                continue;
                            case 363063366:
                                str6 = "۟ۖۘۗۗۦۘ۠ۧۘۘۢۤۚ۠ۤۛۙۦۘۘ۬۠ۥۘ۫ۖۧۨ۫ۖۘ۬ۨ";
                                break;
                            case 1213801337:
                                String str7 = "ۖۧۜۢۗۢۡۚۖ۟ۡۦۘۘۖۡۘۢ۫ۖۘۢۥۖۥۡ۫ۤۡۘۘۖۘۙۨ۬ۤ۠ۜۘۛ۬ۡۘۡۛ۬ۗۨۚ۠ۖۜۘ";
                                while (true) {
                                    switch (str7.hashCode() ^ (-736433022)) {
                                        case -2117419906:
                                            str7 = i4 < length2 ? "۠ۛۢۡۢ۬۬ۘۛۤ۟ۦۘۤۘۘۧۘۖۘۛۢۙۛۨ۫۬ۨۥۨۤ۠ۗۤۥۜۧۦۘ۠ۧ۬ۗۢ۠" : "ۧۧ۫۫ۨۡۘۥۨۡۘ۟۬۟۟ۦۚۦۙۖۘۙ۠ۦۘۙۗۚ۠ۦ۟۬۫ۘۘ۫۫ۙۦۖۗ";
                                        case 604079148:
                                            str6 = "۬۠ۙ۬۫ۦۡ۟۟ۖ۫ۖۘ۬ۢۡۚۨۘۘۢۛۧۗۦۢۙ۠ۡۘۜ۟ۢۤۘۜۤۤۦۘۛۡۙۙۨۘ۟ۗۦۘۥۘۖ";
                                            break;
                                        case 611195440:
                                            str6 = "۟ۘۥۘۗۨ۟ۖۘۘ۫ۧۡۘۘۤۥۘ۫ۜۙۛ۠ۖ۠ۘۜۘۧۚۡۛۤ۬";
                                            break;
                                        case 944389117:
                                            str7 = "ۗۖۥۖۛۥۜ۬ۘۥۢۜ۫ۜۗۨۛۥۘۦۢۨۘ۠۠ۤۛۛۡۘۚۢ۬ۜۖ۫ۨۗۖۘۧ۠۟ۚ۠ۧۨۙۤۚۨ۠۟ۦۡۘۙۛۚ";
                                    }
                                }
                                break;
                            case 2131112444:
                                str3 = "۟ۢۙۘ۠ۨۘۜۜۡۘۢۥۡ۬ۘۖۨ۠ۢ۟ۥۨۚۘۦۢۘۛ۟ۥۦۘۨ۟ۖۙ۟ۥ۟۠ۨۘۧۢۖۘ۟ۜۛۚۘۨۘ";
                                continue;
                        }
                    }
                    break;
                case 805716948:
                    str3 = "ۦ۠ۘۘ۫ۙۖۘۙۥۜۘۙ۬ۨۙۢۙ۬ۜۜۘۤۙۥ۬۠ۤ۫ۗۛ۟ۢۗۥۦۦۜۥۦ";
                    i4 = i2;
                    break;
                case 878722304:
                    bArrA2[i4] = (byte) (bArrA2[i4] ^ bArrA[i3]);
                    str3 = "ۦۗۦۛ۠ۨۘۙۧۖۧ۟۠ۢۢۢ۫ۡۜۖۘۘۖۖۦ۫ۘۚ۬ۜۘۦۚۘۘۨ۠ۢ۫۟ۙۥۜۘۧ۬ۤۖۗۨۘۚۙۦۘۚۚۚ";
                    break;
                case 900687829:
                    str3 = "ۡۤۚۡۦۦۘۚۘۜۚۧۥ۫ۘۖۘ۠ۚ۟ۚۗۦ۟ۢۨۘۖۧۜۘۧ۠ۘۦ۬ۡۤۙۡۘ";
                    i4 = 0;
                    break;
                case 1325603195:
                    i2 = i4 + 1;
                    str3 = "۬ۘۜۛ۠ۤ۠ۛۤۤۨۛۨۙۚۤۥۖۘۡۢۚۖۧۥۘۧۛۥۜ۫ۧۨ۠ۨۘۥۗۛۢۨۜۘۖۗۖۘۡ۠ۡۢۙۤ";
                    break;
                case 1355208026:
                    length = bArrA.length;
                    str3 = "ۗۙۨۦ۠۬ۙۛۛۘۤۘۘۡۙۙۧ۬ۥۘۚۤۚ۬ۗۦۧۨۘۘۥۗۨۘ۫ۜۤۗۖۘ";
                    break;
                case 2079010458:
                    bArrA = g.a(str2);
                    str3 = "ۙۙۨۚۥۨۘۗۤ۫ۤۨ۬ۖ۫ۤۖۢۖ۫ۜۙۤۥۡۘ۟ۙۜۘۤۗۖۙۜۙ۟۬ۡۘۤۨ۠ۨ";
                    break;
                case 2108223997:
                    str3 = "ۜۙۨۖۨۡۘۥ۟۫ۗۨۜ۟ۦۙ۫ۙۘۘۦۡۦ۬ۦۢ۟ۨ۬ۥۦۙ۟ۨۢۧ۠ۡۗۨ۠ۡ۠";
                    break;
            }
        }
    }
}
