package core.pro.android.notify;

import android.app.Activity;
import android.view.View;
import android.widget.Toast;
import java.util.Set;
import org.json.JSONException;

/* loaded from: /workspace/unpacked/classes2.dex */
public final /* synthetic */ class j1 implements View.OnClickListener {
    public final int a;
    public final int[] b;
    public final boolean c;
    public final Activity d;
    public final Runnable e;

    public /* synthetic */ j1(int[] iArr, boolean z, Runnable runnable, Activity activity, int i) {
        this.a = i;
        this.b = iArr;
        this.c = z;
        this.e = runnable;
        this.d = activity;
    }

    /* JADX WARN: Failed to find 'out' block for switch in B:4:0x0018. Please report as an issue. */
    @Override // android.view.View.OnClickListener
    public final void onClick(View view) throws JSONException {
        String str = "ۘۛۨۘۤۦۥۘۨ۫ۖۥۛۖۘ۠ۗۢۦۤۘۘۚ۠ۘۘۜۖۥۘ۬ۗۜۘۥۥۡۘۤۥۘۚ۟ۦۘۖ۟ۛ۠ۦۤ۫ۘۙۧۜۦۘۘۜ۟ۤۗۜۘ";
        int[] iArr = null;
        boolean z = false;
        Activity activity = null;
        Runnable runnable = null;
        while (true) {
            switch ((((str.hashCode() ^ 771) ^ 479) ^ 961) ^ 1205418541) {
                case -2114080476:
                    Toast.makeText(activity, "请等待倒计时结束", 0).show();
                    str = "ۦۢۙۗۖۚۜۗۦۗ۟ۥۘ۬ۜۘۘۗۧۦۥۤۖۘۡ۟۠ۢۛۘۘۦۜۘۘۡۗۦۘۤۡۤۢ۫ۙۜ";
                case -1903006088:
                    str = "ۧۡۖۘۘۖ۬ۘۡۧۥۛۨۤۘ۬ۘۘۢ۫ۘۘۚۙۨ۟ۘۖۜۖۨ";
                case -1861664337:
                    Set<String> set = k2.closedPopupIds;
                    str = "ۧ۬ۚۡۥۖۘۙ۠ۥ۟ۛۡۘ۬ۥۤۦۙۖۡ۟۬ۢ۬ۗۙۦۥۘۡۡۜۘۡۨۡۘۦۡۗۦۦۥۘ۠ۢۗۖۧۚۨۗ۠۫ۙۗ۫ۛۢ";
                case -1860568790:
                    str = "ۛۖ۫ۚۡۖ۫ۛ۫ۤۨۚۖۜۖۛ۬ۦۢ۬ۘۘۡۢۦۖ۫۠ۖۤۖۥۧۦۢۦۙۛۜۘۜۚۤ";
                case -1410427890:
                    String str2 = "ۗۧۘۘۨۜۨۙۨۙۜۙۜۘۤۘۤۧۡ۟ۥ۟ۘۘۘ۟ۢۘۡۘۘۨ۠ۨۥۘۡۘ۬ۘۥۘۖۥۧۘۨۗۧ۟ۙۦ۬ۤۦۘ";
                    while (true) {
                        switch (str2.hashCode() ^ (-453929243)) {
                            case -363995096:
                                str = "ۚۤۥۘۙۜۖۘۧۦۘۙۦۥۘ۠۟ۙ۬ۤۖۘ۬ۚ۠ۘۛۥۘۡ۬ۦۘۗۥ۟ۜ۫۫۫ۘۛۧۡ۫ۜۢۖۧ۠ۡۢۦۘ۬ۡۜۘۛۢۨۘ";
                                break;
                            case 1252293098:
                                break;
                            case 1975069028:
                                String str3 = "ۙۨۜۘ۫ۥۖۘۥۙۥۘۗۙۡۘ۟ۤۛ۠ۧۤۗۤۖۥۧۘۛۢۦۗۙۙۛۘۛۘۥۖۘۚۡۡۘ۠ۗۗ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1063916047)) {
                                        case -657028498:
                                            str2 = "۟ۚۛ۟ۚ۬ۗۗۚ۫ۖۛۚۚۚۤۜۦۘ۫۠ۛۢۗۡۘۗۜۧۘ۟۬ۧ";
                                            break;
                                        case -189202471:
                                            str3 = iArr[0] > 0 ? "ۖ۫ۡۘۧۦۡۗۖۘۥ۟ۥۘۨ۟ۜۢۢۖۤۦۢۨۙۖۧۧۥۧۜۤۚۨۗۖ۬ۖۘۗۘۥۚۧۥۡۚۥۧۧۡۘۘۜۨۘۘ۟ۚ" : "ۛۦ۠ۘۜۧۘ۟ۨۘۚۥۖۚۚۨۘۧۥۗۛۚۦۘ۫ۘۧۜ۟ۡۘۦۥۖۧۛۙۥۘ۠";
                                        case -110876346:
                                            str2 = "ۢۚۨۘۥۨۖۘۦۢۚ۬ۨۙۦ۬ۘ۟ۚۜۘۗۧۧۤ۫ۙ۫ۗۖۘۨ۟۫ۧۧ۟ۤۡۚۥۖۧۡۦ۟ۜ۟۬ۤۤ";
                                            break;
                                        case 250559472:
                                            str3 = "ۘۡۡ۠ۖۢۗۗۦۘۖۛۤۨۥۖۘۨۗۘۜۖۖۘۡۨ۬ۛۛ۬ۥۙۗ۠ۖ۫ۤۘۘۡۖۖۘ۫ۘۙ";
                                    }
                                }
                                break;
                            case 2114852828:
                                str2 = "ۛ۫۟ۚۨ۬ۧۗ۟۠ۜ۠ۤۘۘۢۢۤۥۗۧۚۙۚ۬ۛۖۘ۟۫ۡۘۗۨۨۦۘۧۥۖۘۤۖۢۥ۫ۚ۠ۜۘ";
                        }
                    }
                    break;
                case -1359688640:
                    str = "ۨۗۧۚۜ۠ۛۡۡۘۡۙۖۨ۟ۦۘۧ۫ۥۘۖ۫ۙ۠ۘۘۘۢۧۥۘۖۦۜ";
                case -1355699315:
                    String str4 = "ۥۥۦۚۗۥۘ۟۠ۛۙ۠۟ۡ۠۬ۢۘۘۥۙۨۙۛۡۘۙ۫ۚ۬ۥۖۥۡۧ۠ۛۦۘ۫ۦۖۘ۬ۚۤۖۧۤ۬ۖۦ";
                    while (true) {
                        switch (str4.hashCode() ^ 1367491329) {
                            case -1813574135:
                                str = "ۤۤۥ۫ۘۧۜ۟ۦۛۘۜۘۥۚۜۜۡۦۦۦۘۤۗۛۖۢۜۘۙۢۧ";
                                break;
                            case -1252372826:
                                break;
                            case 624835280:
                                str4 = "۟ۡۡۛ۟ۜۥ۠ۧۡۜۙۗ۬ۡۘۛ۟ۜۘۖ۠ۜۘۘ۬ۦۘۧۙ۫ۤۜۤ۠ۦۛ۠ۜۡۘ۫ۨۤۧ۬ۤ۬۫ۧ۫ۥ۠";
                            case 1842213826:
                                String str5 = "ۧۥۤۢۦۥۘۢۜ۫ۤۜۧۘۦۦ۠ۖ۫ۖۗۖۛۚۙۥۘۡۨۘۘۨۢۦۢۗ۠ۡ۟ۘۥ۠ۤۘۙۤۗۜۘۡۜۨۘ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-1284669607)) {
                                        case -892709436:
                                            str4 = "ۘۥۥۘۤ۟ۥۘۢۦ۠ۘۘۢۥ۬ۙۗۖۘۘۦ۫ۖۜۥۤۖۜۥۢ۠ۢۙۛۥۘۥ۠ۨۘۢۖ۠ۤ۟ۦۘۚۧ۟ۡۛۦۘ";
                                            break;
                                        case -735141673:
                                            str5 = "۫ۨۧ۠ۘ۬ۚۚ۠ۡۦۖۚۦۖۨۥۦۘۗۨۘۗۛۜۗۦۜۘ۬ۘۥۖۦۜۥۡۦ";
                                        case -597306439:
                                            str5 = iArr[0] > 0 ? "ۚۚ۫ۛ۬۟ۡۥۤۘۜۛۤۘۗۤۖۧۘۖۥۤۢ۫۟ۢ۟ۘۚۗ۫ۛۡۛۚ۬ۖۥۦۦۦ۫ۥۘ" : "ۨۗۙۤۜۜۘۡ۬ۛۧ۬ۚۛۡۚ۟ۢۧۦۛۦۙۤۨۘۤ۬۠ۛۦ۫ۛۗۘۘ۠ۙۖۘۢۜ۬ۧۘ۬۬ۢۡۘ۟ۜۚ۬۫ۖۗۖۤ";
                                        case 652282564:
                                            str4 = "ۚۧۘۡۡۡۜ۟ۤۘۦۚ۬۬ۨۙۢ۫ۥۢۤۧۗ۫ۥۖۦۤۚۚۢۤۨۚۢ۬ۡۖۘۙۗ۬۟ۚۦۡۘۧۢۤۤۦۗ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    str = "ۛۖ۫ۚۡۖ۫ۛ۫ۤۨۚۖۜۖۛ۬ۦۢ۬ۘۘۡۢۦۖ۫۠ۖۤۖۥۧۦۢۦۙۛۜۘۜۚۤ";
                    break;
                case -984923370:
                    Set<String> set2 = k2.closedPopupIds;
                    str = "۟ۡۥ۟۬ۜۢۜۧۤۢۨۗۥۘۖۥۥۘۢۜۖۡۘۤۜۨۘۘۛ۠ۜۘ۟ۙۡۖۘ۟ۛۗۖۘۖ۠ۜ";
                case -575696810:
                    Toast.makeText(activity, "请等待倒计时结束", 0).show();
                    str = "۬ۖۘۘ۠ۗۖۘۤۨۜۢۧۘۘۘۙۡۘۘۖۖۘۥۙۘۘ۬ۦۡۡۗۘۘ۬ۛ۟ۖۚۗۢۘ۠";
                case -386316978:
                    ((y) runnable).run();
                    str = "ۤۨۨۥۜۚۖ۟ۨۚۘۧۘ۫ۨۥۧۚۤۢۧۡۘ۟ۢ۠ۡۤۙۛۥ۬ۡۘۘۦۤۦۘۘۖۦۗ۟";
                case -284574236:
                case 1407462883:
                    break;
                case -261747703:
                    iArr = this.b;
                    str = "ۘۘ۠ۗ۠۬ۗۚۧۤۛۦ۫۫۟ۖ۫ۡۛ۫ۘۨۘ۠ۘ۬ۛۧۙ";
                case -135996154:
                    switch (this.a) {
                        case 0:
                            str = "۫ۡۦۘۢۜۨۜ۬ۧۤۙۥۥ۫ۨۘۨۚۛۖۖۤۢ۬ۥۗۜۘ۠ۚۖۘۘۥۨۘۡۦ۫ۤ۫ۘۦۨۧۘ";
                            break;
                        default:
                            str = "ۘۦۡۨۛ۬ۦۤۜۘ۟ۧۥۘۚۨۘۖۗۥۚۜۙ۟ۥۘۥۤ۬۠ۚۖۙۚ۫۬ۧ";
                            break;
                    }
                case 114790503:
                    str = "ۘۗۨۘ۟ۥۢۥۧۖۛۛۧۡۨۦ۬ۛۗۤۨۛۤۚۡۥۜ۠ۗۤۛ۫۠۟ۚۜ۠ۡۘ۬ۦۦۘ";
                    z = this.c;
                case 166794677:
                    String str6 = "۬ۡۖۘۖۨۘۗۜۤۖۦۘۘۗۗ۠ۤۥۧ۠ۛۧۥ۬ۘۗۡۨۢۗۢۨۘۢۛۙۡۨۡۗۧۨۘ۫ۙۙۛۖۚۤۦۗۜ۬ۛ";
                    while (true) {
                        switch (str6.hashCode() ^ 445625166) {
                            case -1938304036:
                                str = "ۚۜۗ۠ۡ۠ۦ۫ۥۘۖۛۢۤۥۤۨۘۜۘۛۙۜ۠ۙۛ۫ۖۤۦۧۨ";
                                continue;
                            case -1332186520:
                                str = "ۙ۫۟ۛ۬ۙۘۙۛۚۢۡۖۘ۬۟ۥۧۘۘۡ۫ۥۧۦۚۧۢۚۢ۠ۛ۠ۢۤۦۘ۟ۥۗۗ۬ۛ";
                                continue;
                            case 295105824:
                                String str7 = "ۚۖۜۘۧۗۚۙ۫ۥۘۜۦۧۘۜۗۡۜۜۢۢۥۜۡ۫ۗۙ۬ۜۗ۠";
                                while (true) {
                                    switch (str7.hashCode() ^ (-820990629)) {
                                        case -1572765301:
                                            str7 = z ? "۟ۘۦۘۨ۫ۥۘۗ۬ۢۗۨ۬ۜۗۖۘۗۦۚ۬ۗۥ۫ۨ۟۬ۙۜۡۡۘۤ۟ۘۘۦۙۛۡۚ۫ۜۨۘۚۧۘۘۖۚۜ" : "ۨۧۢۜۥۖۘۤۥۘۚ۫ۜۧۤۚۥ۫ۜۘۦ۟ۜۡۖ۫ۡ۟ۢ۟ۡۙ";
                                        case -1353561856:
                                            str6 = "۠ۢۨۡۡ۟ۚۚۛۧۛۙۖۦ۠ۖۚۧۛ۬ۦۘۚۡۘۗۖۢۙۡ۠ۗ۟ۗ۠ۖۚۙۦۖۧ۠ۖۘ";
                                            break;
                                        case 1170477816:
                                            str6 = "ۛۖۥۥۦۥۘۜۛ۟ۢ۟ۨۘۙۢۢۗۜۘۥۙۘ۟ۨۙۛۤۜۘ۟ۦۧۘ";
                                            break;
                                        case 1933388239:
                                            str7 = "ۙ۫ۧۘ۫۬ۙ۟ۜۘ۠ۖۥۘۡۜۜۘ۟ۙۗۨۥۜۘۛ۠ۛۙۙ۠ۚۘۜ۬ۖۖۚۚۥۘ";
                                    }
                                }
                                break;
                            case 554280364:
                                str6 = "ۧۙۖۘ۟۬ۢۦ۬۠ۡ۬ۥ۟ۖۚ۫۫ۘۖۨ۠ۙۦ۫ۡۚۜۘۛۚۦۘۚ۟۬۟ۚۨۘ";
                                break;
                        }
                    }
                    break;
                case 646039913:
                    ((l1) runnable).run();
                    str = "ۨۗۧۚۜ۠ۛۡۡۘۡۙۖۨ۟ۦۘۧ۫ۥۘۖ۫ۙ۠ۘۘۘۢۧۥۘۖۦۜ";
                case 762031402:
                    str = "۬ۤۗۚۧ۬ۧۨۡۘۨ۬ۚ۟ۥۥۘۢۖۧۥۥۜۡ۫ۜۘۙۧۗۖ۫ۖۘۢۥۖۘ۫ۘ۬۠ۡۧۘ۬ۦۜۘۗۤۦۖۗۚ";
                case 804790171:
                    str = "ۧۙ۬۬ۦۧۡۛۧ۫ۖۥۥۜۥ۠۠ۡۙ۠ۧۗۨۨۘۘ۬۫ۘۤ۟ۙۧۙ۟ۙۨۥۡۢۜۗۡۛۗۢۧۘۗۖۙۛۨۦۧ";
                case 1175270110:
                    String str8 = "ۢ۬۫ۤۜۘۗۤۢۗ۠ۜۘۢ۟ۨ۬ۚۘۨ۠ۢۖۢۚ۟۟ۜۘۖۢۚۦۛ۫۫۠ۨۘ۬ۤۖۥ۠۫ۘۨۙ۬ۢۨ";
                    while (true) {
                        switch (str8.hashCode() ^ 1315966329) {
                            case -838197713:
                                str = "۠ۥۡۢۤۤۦۛۙۛ۫ۥۧۚ۬ۢۖۘۥۡۦۨۚۗۘۦۘۘۦۜۘۗۤۚۡۘۥۘۥۛۜۘۖۜۘۜۖۗ۫ۖۜ";
                                continue;
                            case 563648335:
                                str8 = "ۥۛۖۛۦۤۚۙۧۛ۠۫۫ۙۚۘۡۛ۟ۛۡۧۙۢۦۚۥۥۧ";
                                break;
                            case 627302386:
                                str = "ۗۖۡۜۜۘۥۦۢۘۛۛۧۖۧۙۦ۠ۖۢۚۘ۟ۛۦ۟۠ۗۙۥۘۥۦۗۨۛۨۘ";
                                continue;
                            case 788070555:
                                String str9 = "۬ۘۜۘۜۚۛ۠ۘۖۘۧۧ۠ۡۥۘ۫ۛۖۙ۬ۦۘۨۛ۫ۧۘۥۘۖۗۨۘۨۧۥۘۦۥۢ";
                                while (true) {
                                    switch (str9.hashCode() ^ (-1340966884)) {
                                        case -1232141261:
                                            str8 = "ۡۦۨ۫ۨ۠۫ۥۙۘۜۨۢۙۖ۟ۛۙۚ۬ۦۘۡۜ۟ۙۜ۠ۦۡۘۘۜۦۢۖۤۡ";
                                            break;
                                        case -1061099796:
                                            str9 = "ۦۖۗۖ۠۟۠ۘۘۛۨۜۗ۫ۧۗ۫ۡۘۤۤۙۚۘۨۘۛۘۡۘ۠ۢ۫";
                                        case -432904221:
                                            str8 = "ۜۙ۠۟ۦۚۧۨۘۘۖۛۚۡۢۡۛۧۥۘۡۢۤۥۗۖۘۤ۬ۨۤۥۛ۫ۨۨۗۦۘۤۜۡۘۡۤۜ";
                                            break;
                                        case -23570608:
                                            str9 = z ? "ۙۚ۫ۧۘۙۘۢۨۧۡ۠ۢ۟ۥۘۙۘۙۛۜۨۘۙۘۖۘۚ۟۟ۚۢۦۙ۬ۦۨۦۘۘۨۢۦۘۖۢ۟" : "۬ۙۘۘۘ۫۠ۦ۠ۜۘۢۨۖۘۧۢۚ۠۠۠ۦۚۦۙۚۧۨۡۘۡۗۜۘۢ۠ۧۦۨۤ۫ۨۗۤۢۦۘۦۢ۬ۖۢۨ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1274912911:
                    runnable = this.e;
                    str = "۟ۨۘۧۛۖۚۥۨۥۨۘۚۥ۬۠۠ۖۘۨۢۘ۠ۦۛۚ۫ۘۘۘۨۗۖۥۘ۬۫۟ۚۦۘۨۘۙ";
                case 1585136297:
                    str = "ۤۨۨۥۜۚۖ۟ۨۚۘۧۘ۫ۨۥۧۚۤۢۧۡۘ۟ۢ۠ۡۤۙۛۥ۬ۡۘۘۦۤۦۘۘۖۦۗ۟";
                case 2013087243:
                    str = "ۢۦۜۢۘۖۘ۬ۙ۟ۤ۠ۜۢۥۖۦ۟ۚۥ۬ۛ۬ۜۘ۬۬ۤۜۜۛ";
                    activity = this.d;
            }
            return;
        }
    }
}
