package core.pro.android.notify;

import android.content.SharedPreferences;
import java.io.Serializable;
import java.util.Arrays;
import java.util.HashSet;
import java.util.Map;
import java.util.Set;
import org.json.JSONArray;
import org.json.JSONObject;

/* loaded from: /workspace/unpacked/classes2.dex */
public class s implements SharedPreferences {
    public static String b = "";
    public final SharedPreferences a;

    public static class a implements SharedPreferences.Editor {
        public final SharedPreferences.Editor a;

        public a(SharedPreferences.Editor editor) {
            this.a = editor;
        }

        /* JADX WARN: Failed to find 'out' block for switch in B:4:0x0024. Please report as an issue. */
        public final void a(Object obj, String str) {
            JSONObject jsonResult = null;
            String strDecrypt = null;
            int i = 0;
            JSONObject jSONObjectOptJSONObject = null;
            JSONArray jSONArrayOptJSONArray = null;
            JSONObject jSONObjectOptJSONObject2 = null;
            Serializable serializableA = null;
            StringBuilder sb = null;
            Object obj2 = null;
            int i2 = 0;
            int i3 = 0;
            boolean z = false;
            SharedPreferences.Editor editor = null;
            String str2 = "ۗۢۛۜ۫ۡۤۡۖۘۥۜۛۨۘۥۘ۠ۨۘۗۥۛۤۛۙۦۨۚ۠ۖۢ";
            while (true) {
                switch ((((str2.hashCode() ^ 986) ^ 25) ^ 747) ^ 115619685) {
                    case -1877525907:
                        editor.putLong(str, ((Long) obj2).longValue());
                        str2 = "۫۬ۚۖۥۜۘۛۛۡۘ۟ۜۧۘ۠۠ۘۘ۠۠ۛۙۨۢ۫ۜۖۗۜۥۜۘۨ۠ۢۗۡۙ";
                    case -1846179785:
                        String str3 = "۬ۨۜۘۥ۟۟ۢۨۜۘۧۘ۫۟ۨۚۥ۫ۦۘ۟ۦۖۘۖۤۦ۬۟ۜ۠ۜۗۜۜۡۡۤ";
                        while (true) {
                            switch (str3.hashCode() ^ 1161282275) {
                                case -2067051914:
                                    str2 = "ۡۛۚۛۗۜۘۤۜۧۘ۫ۛۘۘ۫ۥۡۜۦۧۘۧ۠۫ۧ۠ۘۘۚۛۤۜۡۥۡ۫ۘۘۘۚۢۨۢۨ۬ۨۘۚۗۘۛۖ۠";
                                    continue;
                                case -1366591998:
                                    String str4 = "ۙۢۡۘۧۡۜ۫ۘۨۘۛ۬ۜۨۚ۟ۜۖۛۨۗۚ۟ۘۢۜۥ۫ۥۛۛۛ۠ۘۖۡۢۖ۠ۘۘ۠ۢ۠۟ۥ۠ۨۘۜۘ";
                                    while (true) {
                                        switch (str4.hashCode() ^ 1916812480) {
                                            case -1688299053:
                                                str3 = "۠۟ۛ۫ۥۧۘۙۘۙۚۛۧۛۗۥۥ۟ۨۤ۠ۦۘۘ۠ۦۨۤ۬ۛۛۨۧۘۜ۫ۛۨۤۤۥۜۜۘۖۦۦۘۘۥۚ";
                                                break;
                                            case 263642101:
                                                str3 = "ۥۖۡۘۨۤۨ۠ۦۤۜۗۦۘۚۡ۫ۜ۬ۙ۫ۘۡۘ۫ۖۧۘۢ۟ۢ۟ۛۜۗۜۙۗۥۜۘۡۜۖۦۘۚ۫ۘۘۧ۟ۧۛۧۜۘۖۥۘۘ";
                                                break;
                                            case 617886312:
                                                str4 = "ۨ۬ۗۘۙۘ۠ۜۜۘۢۨۚۘۧۗۡ۫ۜۗ۫ۘۙۨ۫ۨۡۨ۠ۜۖۛۦۘۖۤۘۜۦۘۥ۠ۘۘۘ۠ۛۙ۠ۨ";
                                            case 677772887:
                                                str4 = obj2 instanceof Float ? "ۚ۠ۖۖۨۜۖۦۦۘۦۧۦۘۥ۠۬ۨ۬۫ۙ۟ۖۘ۬ۢۦۘۤ۬ۙ۟۠ۦۢۘۘۘۤۧۜۘۘۙۛ۟ۚ۟" : "ۗۗۘۘ۠ۖۢۥ۠ۡۘۖۗۡۗۦۛۧۙۤۥۘ۫۟۟ۨۘ۫ۢۨۜ۫ۥۘ";
                                        }
                                    }
                                    break;
                                case 207471448:
                                    str2 = "ۜۥۖۡ۫ۛ۬۟ۖۗۚۤۤۡۥۘۢۛ۬ۦۥۘۥ۟ۦۙۥۦۡۛۖۢۜۦۘۗۛۜ۬ۛۤۜۘۗ۟۬ۘۘ۫ۚ";
                                    continue;
                                case 1295576700:
                                    str3 = "ۥ۠ۨۘۦ۟ۨۜۨ۠ۡۗ۬ۧ۠ۜ۬ۡۘۘۥۤۦۘۚ۫ۖ۬ۖۘۘۡۜۧۢ۬ۥۜۛۜۡۢۗۚۛ";
                                    break;
                            }
                        }
                        break;
                    case -1842835138:
                        str2 = "ۗۡۡۙۥۗۡۨۖۘۧۨۥۚۧ۟ۡۥۘۚ۫ۤۖۥۘۜ۫ۥۢۙۤ";
                    case -1819988856:
                        sb.append(jSONObjectOptJSONObject2.optString("type"));
                        str2 = "ۙۜۧۘۖۦۥۘۜۤۥۘۗۡۨۘۢۘۢۙ۠ۧۖۖۛ۟ۛۙۘۧۚۜۘۗۚۨۘۦ۟ۦۦ۬۫ۦ۫ۨۘۧۖۧۘۖۙۘۚ۫ۦۘۥ۫ۗ";
                    case -1818613757:
                        String str5 = "ۧ۠ۨۘۚ۟ۢۥ۟ۖۙۤۘۛۘۘۡۜۖۨۦۜۛۤۜۘ۬ۖۖ۫ۡۤۖۛ۫۬ۚۤۙۧۧۨۨ۠";
                        while (true) {
                            switch (str5.hashCode() ^ (-1917482681)) {
                                case -1553761001:
                                    str2 = "ۜۙۨۘۜۘۖۘ۟ۚۜۡۜۢۨۡۤۨۡۜۘۙ۠ۡۘۦ۬ۛۧۙۦۖۨ۠ۛۢۡۚ۫ۚۨۛۛ۬ۛۚۥ۟۟ۦ۬";
                                    break;
                                case -541645233:
                                    str5 = "ۖۜۘۘ۫ۜۥۧۥ۬ۡۢۖۜۨۡۤۖۚۖۨۡ۫ۜۥۜۢۨۘۜۥۖۤۜ۠۠۟ۥۘ";
                                case -61081701:
                                    break;
                                case -13617040:
                                    String str6 = "ۖۜۡۤۦۖۢ۠ۘۘۦۤۦۘۧۖۨۙۖۜۘۚۙۧۡۘۢ۠ۖۥ۬۬ۢۘ۬ۧۙ۬";
                                    while (true) {
                                        switch (str6.hashCode() ^ (-603153616)) {
                                            case -2038890890:
                                                str5 = "ۛ۟۬ۖۢۢۜۡۧۘۦۡ۬ۚۙۡۘ۫ۤۢۦۜۖۘۚۧۜۘ۬ۗۥ۟ۨ";
                                                break;
                                            case -1346074251:
                                                str6 = jsonResult != null ? "ۥۥۧ۠ۚۖۜ۟۫۫ۧۜۤ۟۬۫ۗۥۘۗ۠ۖۥۦۨۘۜۤۜۜ۠ۚ۟ۦۥۢ۟ۦۘۨۘۦۘۡۚۘ" : "ۨۖۗۦۜۨۦ۬ۜۛ۬ۗ۠۫ۢۜۧۖ۬ۧۨۘۖ۠۟ۦۘۥۘۜۢۖۜۛۚۦۙۗۧۧۘۗۦ۟ۙۖۧ۠۫";
                                            case 113118333:
                                                str5 = "ۢۡۘۘ۟ۖۧۘۛۗۜۢ۠ۦۖ۬ۖۢۤ۫ۦۢۖۘۜۗ۬ۦ۟ۖۥۛ۠";
                                                break;
                                            case 1844573341:
                                                str6 = "ۨۤۖۘۘۦۥۧۡۨۘۗۢۙۙۛۚۡۡ۟ۦ۠ۥ۟ۧۤۖۘۡۛ۠ۢۚۗۡۚۢۨۘۥۛ۟۫۫ۦۘۜ۬ۦۜ۬۫ۖ۫ۡ۬ۛۡۘ";
                                        }
                                    }
                                    break;
                            }
                        }
                        break;
                    case -1722537592:
                        editor = this.a;
                        str2 = "ۧ۟ۖۛۘۥۘۧۗ۬ۛ۬ۛۥۨۘۚ۠ۢۗۥۜۛۡۘۙ۠۟ۥ۫ۙۢۚۦۦۨۖ۟۫ۡۨۥۘۧ۟ۧۚۘۦۘ";
                    case -1378800541:
                        str2 = "ۧۖۖۘۚۛۛۥۢۧۘۗۗۧۘۜۘ۫ۥۖۘۦۢۗ۬ۙۡۘۨۛۗۖۥ۠ۡۤ۟ۥۧۗۛۤۖۘۢۡ۠ۖۘۜۢۙ";
                    case -1259511334:
                        editor.putFloat(str, ((Float) obj2).floatValue());
                        str2 = "۠ۜۗ۫ۨۘۘۗۙۙۤۗۦۘۥۥۖۘ۟۬ۥۘ۠ۡۧۡ۬ۤۛ۠ۗۗۥۚۡ۠ۚ۬ۙۡۘۚ۠ۘۡۢۥۥ۫ۡۛۨ";
                    case -1224165434:
                        sb = new StringBuilder();
                        str2 = "ۨۦۥۘۗۦۖۘ۠ۜۢۧۥۧۚۜۨ۬ۘۘۡۧۤۡۨ۟ۤۘۘۛۢۢۤ۟ۢ۟ۖۘ۫ۢۛۖۥۛۗ۫ۦۘۨ۠";
                    case -1223055569:
                        String str7 = "۬ۛۥۘۚ۟ۘۦۨۧۦۡۖۘۙۡۜۘ۟ۢ۟۫ۘۛ۠ۧۦۚ۬ۛۜۖۛۨۦۨۡۘ۬ۚۛۥ۫ۥۙ۫ۢ۬ۤۙۦۜ۠ۦۘۛۗۡۘ";
                        while (true) {
                            switch (str7.hashCode() ^ 60393856) {
                                case -741774277:
                                    String str8 = "۫ۢۖۘ۫۬۠۟ۖۛۙ۠ۨۦۜۘۤۗۖ۫ۘۦۘۜۦ۬ۦ۫ۘۨ۟ۜ۬۬ۧۖۢۦ۬۟ۘۦۢۤ";
                                    while (true) {
                                        switch (str8.hashCode() ^ 397288795) {
                                            case -1529247140:
                                                str8 = str.equals(jSONObjectOptJSONObject2.optString("key")) ? "ۚۚۙۗ۠ۘۘۨۚۡ۟۠ۧۛ۬۫۫ۚۜۘۨۜۧۨ۟ۦۘۨۦۥۘۦۨۜ۟ۦ۟ۖ۫ۛۜۧ۫ۙۖۗۘۚۚۘۘۘۥۧۘۘۢۖۖۘ" : "ۛۢۜۘۖۢۤۦۛۦ۫ۥ۟ۖۥۨۜۚۖ۬۠ۙۧ۬ۨۨۧۘ۟ۢ";
                                            case -620451354:
                                                str7 = "ۘ۠۟ۢۡۥۘۚ۬ۘۗ۫ۖۘۛۥۛ۟ۖ۠ۥۖۨۘۥۢۘۘ۬۬ۨ۬ۖۥ";
                                                break;
                                            case -389186099:
                                                str7 = "ۦۡۜۘۛۢۜۜۜۖۘۧۛۛۡۨۥۘۨۢ۫ۡۨۛۛۜۧۗۧۡۜۙۡۢۤۦۘۨۛۤ۬ۤ۫۟ۨۗ";
                                                break;
                                            case 1943265058:
                                                str8 = "ۨۨۧۚۗۦۛۖ۠ۢۘۘۜۦۙۛۜۘۧۦ۠ۧۚۧۘۗ۟ۜۗۡۡۨۥۘ۟ۡ۟ۘ۫ۖۘۥۗۥۘ";
                                        }
                                    }
                                    break;
                                case -647505796:
                                    str7 = "ۤۖۨۛۖۡۘۘۛۜۥ۫ۜۘۧ۬ۘۜ۬ۖۦۦۨۘۚۙۛۘۛۜۡۙۘۘ";
                                case 331631115:
                                    str2 = "ۨۛۢۙ۠ۥۘۛ۫ۢۜ۠ۦۘۗۧۤۨۘۥۘۖۥۨۘ۟ۗۜ۟ۜۘۘۜۦۚۡ۬ۖۘۡ۬ۘۗۨۙۥۡ۬ۡۧۥۢۥۨۘۛۛ۫ۚۙۢ";
                                    break;
                                case 646208803:
                                    break;
                            }
                        }
                        str2 = "ۖ۠ۨۘۙ۟ۤۚ۠ۜۜۘۦۘ۫۟ۡۘۥۖۜۘۤ۠ۖۢ۟ۤۨۜۧۘۢۦ۠ۧۨۥۘ۫ۘۤ";
                        break;
                    case -1112380505:
                        editor.putStringSet(str, (Set) obj2);
                        str2 = "۟ۥۦۧ۫ۛۗۖ۠ۦۛۡۘۜ۫ۛۦ۫ۜۘۚۜۧۜۨۘۢۚ۠ۗۦۛۧ۫ۖ۬ۧۡۘۘۖۗۜۥۖ";
                    case -1081024844:
                        editor.putInt(str, ((Integer) obj2).intValue());
                        str2 = "ۦۖۘۗۜۥۘۗۘۖۘۢۖۨۘ۫ۙۛۛۥۘۤ۟ۙ۟ۧۛۖۧ۬ۙ۟ۢۖ۫ۘۦۚ۠ۜ۠ۥۘۙۦۦۢۖ۬ۖۗۤۗۤ۠۫۬ۘ";
                    case -956444452:
                        String str9 = "ۘۢۘۘۛۧۧ۫ۚۡۘۦۨۡ۬ۨۘۥ۬ۦۘ۟ۢۜۘۗۧۡ۠ۙ۠ۢۘۚۙۗۢۡۦ۬ۚۙۛ۬۠ۖۘۜۧۖۘۤ۬ۦۜۤۛ";
                        while (true) {
                            switch (str9.hashCode() ^ 612523270) {
                                case -1420778742:
                                    str2 = "ۙۗۡۥۚۘ۫ۙۛۡ۟ۨۘۢ۫ۨۘۥۚۙۢۢۚ۬ۥ۬۬ۧۦۦۦۥۥ۟۬ۘۘۤۜۨۥۦۘۤۖ۟ۜۤۙ";
                                    continue;
                                case 238819927:
                                    str2 = "۠ۘۡۢۖۙۦۨۨۘۚۤۥۘۙۜۜۖۥۡۥۡ۬ۧۜۧۘ۬ۧۡۘۗۧۥ";
                                    continue;
                                case 1492075390:
                                    str9 = "ۖۖۢ۠ۖۜۗۚۙ۫ۦۦۨۥۨۘۧۜۙۤۥۨ۠ۦۗۤۢۗۘۤۤ۠ۖۘ۠ۛۘ۟ۨۗۜۦۗ۫ۖۢۢۘ۬۬ۦۘۗۙ۬";
                                    break;
                                case 1721090601:
                                    String str10 = "ۨۥۛۖۦ۠ۗۤۧۚ۬ۥۢۢۨۘۙۗۘۧۖۡۥ۟ۢۡۢۨۘۨۘۜۡۧۥۚ۟ۢۖۨۖۦۢۧ";
                                    while (true) {
                                        switch (str10.hashCode() ^ 743424403) {
                                            case 49861269:
                                                str10 = "ۨ۟۫ۘ۬ۦۜۘ۫۠ۥۘۘۧۢۛ۟ۤ۫ۜ۫ۜۗ۟ۡۘۧۤۜۙۜۢۙۢۤ";
                                            case 127228268:
                                                str9 = "ۥ۫۫۟۟ۘۦۜۘۦۢۖۘۜۦۤۢۥۡ۠ۧۜۤۢۢۖۚۘ۬ۖ۠ۧۙۗۨۡۨۢۗ۬ۚۖۘ";
                                                break;
                                            case 290530648:
                                                str9 = "۟ۛ۠ۨۖۦۨۧۢۧۥۥۚ۠ۗ۫ۨۖۘۖۛۜۢۖۡۥۖۨ۬ۥۜۖ۟۠ۖۥۧ۫ۤۚۥۥۧۢۖۤۡۛۨۚ۫ۘ۠";
                                                break;
                                            case 1659138936:
                                                str10 = z ? "ۙۤۥۘۙ۬ۙۤ۠ۦۘۚۨۘۘ۟ۗۘۙۗۘۘۦ۠ۙۛ۠ۥۘۨ۫ۖۘۧۧۙۜۖۘۘۥۚۘۘ" : "۟ۧ۟۠۬ۛ۫ۙۨۘۛۧۥۘۧۥۜۘۗۢۡۡۗۗۤۖۡ۠ۨۖ۬ۧۘۤۦ۠ۜ۠ۗۜۨ۟ۢۢۨۘۤۘۘۥۨۜ";
                                        }
                                    }
                                    break;
                            }
                        }
                        break;
                    case -947876563:
                        String str11 = "ۦۡۨۗ۟ۘۚ۫ۘۜۨ۟ۜۦۘۖۗۥۘۦۘ۫ۤۤۧۖۗ۫ۙۥۘۘۨۗۢۥ۟ۜۚۛۘۡۘ۠ۨۧۘۤۧ۬";
                        while (true) {
                            switch (str11.hashCode() ^ (-963546193)) {
                                case -1683277856:
                                    str11 = "ۘۨ۫۠۬ۥۘ۫۫۫ۨ۬ۦۘ۬ۙۘۚۡۦۘ۟ۖۘ۟ۢۘۘۨۧۛۗۤۡۜ۬ۖۨۙۚ۟ۚۡۖۜۘۗۘۥۦۗۜۘ";
                                    break;
                                case -662067092:
                                    str2 = "۠ۚۥۖۚۤ۬ۤۙۗۦ۬۬ۖۡۘۨۧۤۖۚۨ۟۫ۡۘۛۗۛۦۦۦۘۖ۟ۦۘۘۛۗۡۜۖۘۖۡۜ۟ۥۦۧۥۥۘ";
                                    continue;
                                case 143084401:
                                    str2 = "ۦۙۘۘ۫ۢۥۘ۟ۧۦۛۘ۫ۜۚۤۘۘۜ۠ۘۚۨۥۙۙ۫ۘۥۢۨ۠ۖ۟ۛۦ۬";
                                    continue;
                                case 1717337417:
                                    String str12 = "ۥۚۙۜۢۖ۟۬ۡۜۗۗۘۢۥ۬ۨ۠ۛ۫ۖ۫ۚۤۚ۟ۤۡۡۘۘۙۧۖۘۙ۬ۤۘۤ۬۠ۘۧ";
                                    while (true) {
                                        switch (str12.hashCode() ^ (-379265932)) {
                                            case -96178420:
                                                str11 = "ۛۦ۠ۜۨۜۘۡۢۜۘۙۧۖ۠ۧۖ۠ۘۦۘۧۡۡۘۚۖۘ۠ۛۢۙۦۛۜۤۨۘۖۛۘۨ۬ۚۖۛۘۘۢۦۨۜۜۦۘ";
                                                break;
                                            case 204813270:
                                                str11 = "ۧۨۦۢۛۡۢۥۜۦۥۧ۫ۖۤۙۗۘۢۤۙ۫ۥۤ۠ۡۨۘۜۡۘۢۦ۠ۗۦۧۘۜۨۚۙۦۙ";
                                                break;
                                            case 1746362593:
                                                str12 = "ۨۛۜۤۤۢ۫ۘ۟ۙۧۜۖۖۘۦۛۤۨۢۥۘۗۖ۫ۜۚ۬ۧۦۤۖۥۦۨۙۖ";
                                            case 1877033161:
                                                str12 = obj2 instanceof Integer ? "۟ۨۜۨ۫ۧ۬ۘۥۘۖۘۜۛ۬ۡۘۥۚۨۘۛۘۥۗۘۦۡۢۦۘۡۦۡ" : "ۘ۫۟ۥ۠ۡۘۥ۬ۦۥ۫۫۫ۜۙ۫۫ۖۘ۫ۦ۠۠۬ۖ۬ۙ۬ۗۖۖۚۛۚ۟ۨ۫ۥۥۜۘۧ۠ۜۘۜۧۦ۠ۜۥۘۦۖ۟";
                                        }
                                    }
                                    break;
                            }
                        }
                        break;
                    case -939381604:
                        str2 = "ۘۢۨۘ۬۫۟ۨۨۡۖ۬ۘۡۖۦۘۦۤ۠ۖۧۜۘ۫ۨۡۥۖۡۘۙۡۥۘۖۢۜۦۜۘ";
                        obj2 = obj;
                    case -906347835:
                    case -481211385:
                    case -146942661:
                    case 325224560:
                    case 1755209479:
                        str2 = "ۤ۠ۡۘۛۧۧۡۜۡۦۖۙ۠۟ۤۨۙۜۘۗ۫ۘۘۗۛۖۜۗ۠ۢ۫ۖۘۜۗۦۢ۬ۖۘۛۜۦۘ۠ۖۧ۟ۙۨۨ۫";
                    case -765385111:
                        String str13 = "ۡۖۦۦۢ۬ۚ۬ۘۘ۟ۨۙۡ۠ۨۦۙۧۜۜۜۗۗۘۘۥۥۦۖۨۨۗۨۘۥ۫۟ۤ۫ۥۡۡۡۘ۫ۛۡۘۛۥ";
                        while (true) {
                            switch (str13.hashCode() ^ 1052417571) {
                                case -1761506201:
                                    break;
                                case -1466697985:
                                    str13 = "ۜۖۛ۬ۨۚۦۦ۬ۖ۟۬۫ۘۨۢۘ۟ۖۡۜۘۖۘۖۙۧ۠ۡۦۦۘۨۨۥۛ۠ۖۘۗۚۤ۬ۥۡۘ";
                                case -1288357632:
                                    str2 = "ۛۘۧۦۧۘۘۥۚۤ۫ۖ۠۟ۡۚۘۢۥۦۗۗۧ۟ۛۜۢ۟۫۠ۡۘۤۙۗ۫۟ۘۘ";
                                    break;
                                case 1408482001:
                                    String str14 = "ۥۙۘۘۜۥۛۚۦۜۘۨۤۘۢۢۚۧۨۦۢۦۘۛ۬ۡۘ۬ۧۡ۫۫ۡۘۦۗۨۢ۟ۜۨۗۚۜۤ۠ۖۘۡۘ۟ۡۧۘ";
                                    while (true) {
                                        switch (str14.hashCode() ^ 923462488) {
                                            case -1351629118:
                                                str13 = "ۤۥ۬ۗۧۛۜ۫۬ۥۘۥۢۘۘۡ۠۫ۜۡ۟ۙۥ۟ۜۧۨ۠ۙۥۘۗ۬ۢۘۘۖۧۗۨۚۦۘ۫ۗ۠ۚۘۛ۬ۦ۬ۚۧۤ";
                                                break;
                                            case -1287040560:
                                                str14 = "ۚۧۥۘۥۖۦۘۘ۠ۖۢ۠ۡۘۜۘۙۡۢۢۡۤۛ۠ۘۤۘ۫ۦۘۖۖۖۥ۟ۘۡۛۙ";
                                            case -300209670:
                                                str13 = "ۘۨۘۘۢ۟ۚ۫ۖۘۢۦۗۖ۫ۖ۠۬۬ۜۘۛۚۙ۫ۢۗۢۘۨ۠ۧۢ۟۠ۗۖۙ۠ۤۛۚۙۚ۟ۘۧ۠ۦۘ";
                                                break;
                                            case 1731948155:
                                                str14 = jSONObjectOptJSONObject2 != null ? "ۥۦۡۛۗۙ۠ۨ۠ۘۚۛۦ۬ۧ۟ۗۜ۟ۡۘۘۡۛۘۜۖۦۘۨۘۧۘ" : "ۛۘ۬ۡۗۡۘ۠ۖۦۜۡۚۗۘۥۜ۟۫۠ۚۜۨۜۛ۟۫ۤ۫۬۟۫ۙۧ۫";
                                        }
                                    }
                                    break;
                            }
                        }
                        break;
                    case -521790089:
                        String str15 = "ۦۦۤۢۙۖ۬ۧۨۨ۬ۤۢۘۖۛ۬۬۟ۗۜۥۧ۠ۜۖۨۖۡ۫ۙۜۤۥۢۢۧۜ۟ۢ۬";
                        while (true) {
                            switch (str15.hashCode() ^ 1375159140) {
                                case -2038307641:
                                    str15 = "ۙۙ۠ۙۨۡۘ۫ۨۙۢۧۧۚ۟ۜۙ۠ۘۤۢۧۚۦۦۘۖۦۡۨۘۨۗۙۖۜۢۗ۟ۡۛ۠ۛ";
                                    break;
                                case -1177469557:
                                    str2 = "۫ۜ۟ۖۢۦۘ۠ۢۘۚۥۤۢۤۦۨۤ۬ۨۦۛۡ۠ۘۘۢۨۨۘۦۥۨۥۜۘۦ۠ۜۥۜ۟ۥۚۨۘ";
                                    continue;
                                case -430050625:
                                    String str16 = "ۡۚۨۘ۠ۦۡۘۥ۟ۨۧۘۨۘ۫۫ۨۘۘۗۖۧۤۚۜۥۦۘۙۨۨۘۙۘۦۘۖ۬ۜۢۧۧ";
                                    while (true) {
                                        switch (str16.hashCode() ^ (-818640928)) {
                                            case -1783000762:
                                                str16 = obj2 instanceof Long ? "ۙۘ۫ۤ۬۬ۦۛۦۖۜۜۖۤۦۥۡۦۖۥۙ۟ۙۖۘۢۨۨۛۧۜۨ۬ۨۘۖۗۜۛۖ۫ۤۥۘۚۨ۬۠۟۟ۢۖۢ۫ۘ" : "ۡۥۛۛۡۚ۠۟ۢۤ۬ۜۚۙۧۡۨۘ۟۟ۖۘۛۛۖۘۢ۟۠ۨۨۜۘۥ۫ۛۛۙ۟ۡۜۖۘۥۨ۬";
                                            case -1653653540:
                                                str15 = "۫ۜۡ۠ۨۘ۫ۛ۟ۧۗ۠۟ۚۙۨۚ۠ۚۧۜۘۙۛۨۢۢ۟ۥۚ۠ۦۥۦ۬ۤۧۛۖۨۘۚۛ۫ۛۖۚۡۨۖۥ۟ۨۗۡۘ";
                                                break;
                                            case -252088368:
                                                str16 = "ۚۖ۫ۛۤۜۤۧ۫ۢ۠ۨۘۗۥۨۦۨۜۨۤۖۥۨۜ۠ۤۢۖۘۘۘۖۥ۟ۗ۟ۧۤۜۛۙ۠۬ۖ۟ۚ۠ۥۙۜۧۘۧۘ";
                                            case 1179898235:
                                                str15 = "ۡۘ۫۫ۥۘۢۨ۟ۖ۟ۖۨ۠۠ۥۚۡۧۨۨۘۧۤۖۘۥۨۦۘ۬ۨۜۘۜۜۚۨۢۥۚۨۛۘۧۡۘ";
                                                break;
                                        }
                                    }
                                    break;
                                case 1134080459:
                                    str2 = "ۘ۫ۖۘۚۡۖۘ۬ۥۚۗۗۦۘۜۡۢ۫ۦۛۘ۬ۗۡۘ۬۫ۗۛۨۨۗۥۤۤۢۨۥ۬ۨۨ۫ۚۜۘۧۙۦۜۗۤ";
                                    continue;
                            }
                        }
                        break;
                    case -494463539:
                        z = obj2 instanceof String;
                        str2 = "ۘۘۖۡۛۘۘۙۧ۫ۧ۬۬ۤۚۦۘۤۤۖ۬ۖۥۜۥۡ۠ۚۛۢۙۦۘۡۧۙۢۤۘۚۧۢۡ۟ۜ";
                    case -410391422:
                        sb.append(serializableA);
                        str2 = "ۡۡۥۘۜۗۨۙۖۜۘ۬ۛۧۚۡۜۘۥ۬ۖۘ۟ۖۘۡ۟ۥۥ۠ۗۡۗ۫ۤۘۦۦۨۘ۬ۘ۟ۚۗۘۘ";
                    case -252599309:
                        k2.logToFloatingWindow(sb.toString(), "sp-hook");
                        str2 = "۟ۦۜۘ۫۠ۡ۬ۙۤۦ۬۬۠ۡۢۖۙۘۦۚۡۘۗۛۡۘۧۦ۬ۨۥۖۘ۬ۦۘ۬ۢ۟ۦۘۧۥۜۘ";
                    case -245146741:
                        i = 0;
                        str2 = "ۥ۠ۛۦۥ۬۟۟ۥۢۙۥۧۢۘۡۜۖۘۗۛۖۘۤۦۚۤۨۧۙۢ۬۬ۙۗۦۚۙ۫ۦۢۙۨۤۨۛۦۚ۫ۡۘ";
                    case -180098821:
                        str2 = "ۗ۫ۖۘۜۢۘۚۜۧۘۖ۠ۥۘۗۜ۫ۛۛۨ۫۬ۘۗ۫ۗۗۥ۠ۥۡۘۦۧۥۙۘۚ۫ۛ۠۬ۚۛۦۖۘۜۨۙ";
                    case -126608764:
                        String str17 = "ۨ۠ۖۘۗۖۢۨ۟ۤۗ۠۬۬ۚۤۖۧ۬ۦۘۨۘۢۙۧۛۖۤ۟ۖۙۥۢۡۙۥۘ۫ۡۧۘۧۡۥۧ۬ۧۘۖۙۚۛۢۨۘ";
                        while (true) {
                            switch (str17.hashCode() ^ 1972395448) {
                                case -1174058504:
                                    str17 = "ۜۨۢۡۗۦۘۡۖ۠ۨۦۤۧ۫ۧ۬ۨۥۘۜۘۖۘۥ۬ۖۥ۟ۨۖۡۘۤ۟ۢ۫ۨۖۘۜۙ۬۟ۖۧۚۥۜۦۛ۫ۨ۫۠ۡۨ";
                                case -854670649:
                                    String str18 = "ۧ۟ۛۖ۫ۗۡ۠ۚۥۨۗۤۢۦۘۤۨۖۘۙۜ۟ۤۢ۬ۨۖ۟۫ۡ۫۟ۥۜۨۤۜ۫ۜۤۦۨۘ";
                                    while (true) {
                                        switch (str18.hashCode() ^ (-1285754207)) {
                                            case -1700110736:
                                                str18 = i3 < jSONArrayOptJSONArray.length() ? "ۦۧۡۥۦۘ۠ۖۘۘۨ۟ۜ۫ۘ۠ۘۗۧۤۡۘۡۙۨۥۘۧۨ۫۠ۘۛۛۙۚۢۦۨۘ۟ۦ۠ۛۡۤۦۜۥۘۤ۟۫ۖۖۜۘ" : "۟ۡۚۖۤۘۘۦ۟ۛۗ۬ۥۖۖۦۖۡۦۘۥۦۨۘۥۙۨۘۨۗۧۥۤۚ۫۠ۦۛۨۜ۫ۛ۫ۚۛۢۥۢۡ۬ۡۜ۟ۧۡۘۤۛۘۘ";
                                            case 682160448:
                                                str17 = "ۗۨۘۘۚۘۡۦۡۙ۟ۨۨۘۛ۟ۘۘ۫۬ۚۨۥۙۢۥۧۨۘۚۗۦۗۤۧ۠۫ۜۘ";
                                                break;
                                            case 899556261:
                                                str17 = "ۙ۠ۡۘۥ۬ۛ۟۬ۘۖۥۧۚۧۛۨۖ۬ۦۧۘۚۗۦۘۦۨۘۦۘۡۘ";
                                                break;
                                            case 1921262525:
                                                str18 = "ۦۢۙۚۖ۫ۥۚۨۘۡۘۘۘۚۚۘۖۜۛۙۗۗۙ۟ۦۘ۟۫ۖۘۜۧۖۘ";
                                        }
                                    }
                                    break;
                                case 1029824020:
                                    break;
                                case 1149379383:
                                    str2 = "ۤۡۦۘۦۗۛۤۚۧ۠ۧۛ۟ۛۥ۟ۗۚۜۘۥۡۤ۫ۥۘۡۘۨۘۗۚ۟۫۬ۥ";
                                    break;
                            }
                        }
                        str2 = "ۧۖۖۘۚۛۛۥۢۧۘۗۗۧۘۜۘ۫ۥۖۘۦۢۗ۬ۙۡۘۨۛۗۖۥ۠ۡۤ۟ۥۧۗۛۤۖۘۢۡ۠ۖۘۜۢۙ";
                        break;
                    case -117063813:
                        jsonResult = s0.getJsonResult();
                        str2 = "۫ۛۖ۟ۧۡۘۜۤۘۜ۫۠ۖۤۡۗۨۧۤ۫ۜۘۥۚۘۜ۠ۨۘۗۛ";
                    case -92459627:
                        str2 = "ۧۦ۫ۥ۟ۜۘۢ۫ۨۙ۟ۙۥۘۤۤۨۧۘۘ۟ۚ۠۟۟ۥۛۘۚۨۜۛۗۚۡۗۥۘۙ۠ۤۛۤۙۛۥۛۦۘ";
                        obj2 = obj;
                    case -26668708:
                        String str19 = "ۨۜۛ۫ۚۢۜ۫۟ۜۧۛۖۗۜۘۜۛ۬ۜۖۖۘ۬ۢ۟ۨ۫ۤۗۖۥۘ";
                        while (true) {
                            switch (str19.hashCode() ^ (-166583472)) {
                                case -1669569998:
                                    str19 = "ۤ۠ۖۧ۠ۨۘۙۨۧ۫ۥۚ۟ۦۘ۫۠ۗ۫ۘۧۘ۫ۚۨ۟۠ۨۛۦۜۧۘۥۗۜۤ۟ۚ۠ۦ۬ۚۧۦۘۘۜۖۜ";
                                    break;
                                case -541340614:
                                    String str20 = "ۡۧۦۘۦ۫ۜۧۚۦۙۚۙۛ۫ۛۖۦۥۦۙۙۡ۫ۢۛۚۡۘۙۚۛۜۖۙۖۧ";
                                    while (true) {
                                        switch (str20.hashCode() ^ 1634341626) {
                                            case -1215941328:
                                                str20 = "ۘۘۜۘۜۖۛۨۡۨۘ۬۟ۦۘۢۡۧۘۦۨۧۜۙۥۖۖۘۜۘۘۧ۠";
                                            case -994256234:
                                                str20 = obj2 instanceof Set ? "ۖۥۧۧۧۚۙۙ۟ۙ۠۬ۤۘ۠ۗۥۖۘۧۘۨۘۚ۠۫ۗ۫ۥ۠ۨۚۥۨۨۙ۬۟ۤۜۦۘ۬ۢۦۘ" : "۟ۖۖۚۦۥۨۦ۬ۧۧۨۘ۠ۛۥ۫ۤۡۨ۬ۦ۫ۢۖۘۦۢ۠۫ۙ۬";
                                            case -266787559:
                                                str19 = "ۡ۬ۘ۬ۨۛۧۖ۬ۘۨۧ۫ۚۖۙۧۤۧۗ۬۟ۡ۠ۚ۟ۧ۫ۖۖۘۘۗۢۥۘۙۘۙۨۡۨۘۘۥ۬۬ۢۙ۟ۧ۫ۗۖۘۛ";
                                                break;
                                            case 1989738633:
                                                str19 = "ۢۙۨ۟ۤۨ۫ۤۢۖ۠۫ۚۗۨۡۘۚۗۘ۟۟۠۫ۚۨ۫ۗ۠ۥۡۗۢۖۘ۫ۢ۟۬ۛۨ";
                                                break;
                                        }
                                    }
                                    break;
                                case -141886224:
                                    str2 = "۠ۦۡۘۘۥۡۡۜۢۡ۟ۤۙۚۖۘۡۛۜۘۨۢۘۘۤ۟ۦ۬ۖۧۘۤۜۤ۫ۖۧۗۜۜ";
                                    continue;
                                case 1247942882:
                                    str2 = "ۥۚۘۖۖۜۘۗۗۖۡۡۨۘۨ۟ۥ۬ۜۚۦۥۧ۬ۗ۠ۥۘۡ۟ۡ";
                                    continue;
                            }
                        }
                        break;
                    case -10478786:
                        sb.append("，新值：");
                        str2 = "ۥۙۥۘۜۜۙۨۡۖۘۥۡۧۘۗۥۢۨۡ۠ۜۚۜ۠ۤ۬ۗۜۚۖۡۘ";
                    case 18837194:
                        str2 = "ۗۘۗۛۡ۠ۢ۟ۥۘۗۛ۠۬ۥۥۘۥۢۖ۠ۘ۫ۙۗ۟ۘ۬ۚۙۤۛۨۙۘۛۧ۬ۥۘۧۗ۫";
                        obj2 = obj;
                    case 159920073:
                        str2 = "۬ۨۥۘۗۥۗۡۥۖ۫ۡۛۨۡۨۘۜ۬ۨۘۖۥۡۘۧۗۜ۠ۚۥۗۜۨۡۨ۟۬ۖۙ";
                        obj2 = obj;
                    case 216852448:
                        sb.append("->");
                        str2 = "ۡۘۖ۟ۗ۬ۢۜۦ۠ۢ۫۠ۤۦۘۘۦۘۢ۫۬ۨۢۥۛۙۛۨۛ۟";
                    case 333136318:
                        jSONObjectOptJSONObject = jsonResult.optJSONObject("sp_put");
                        str2 = "۫۠ۧ۠ۤۜۘۧۚۖۘ۟ۖۨۘ۫ۧۥۘۚۢۡۚۗۤۦۦۦۥۘ۠ۜۤۗ۟ۥۦ۫ۚۗۤ۬ۥ۠ۨۜۘۥۢۘۢۙۨۘۦۦۧۘ۬ۙ۫";
                    case 370765599:
                        String str21 = "ۚۙۜۘۧۢۢۢۥۨ۠ۗۗۢۖۧۘ۬ۧۘۦۜۡ۟۬۟ۖ۫ۢۧۢ۟ۗۙۘۛۤۜۘۘۚۖۙۘۤ";
                        while (true) {
                            switch (str21.hashCode() ^ (-1701833560)) {
                                case -1697864236:
                                    break;
                                case -1552288224:
                                    str2 = "۫ۘ۬ۤۙۛۡ۠۟۬ۥۜۘ۟ۚ۬ۘۧۙۚۛ۠ۙۛۚۤۥۘۗۨۛۡ۬ۘۨۛ۬ۗ۠ۖۦۚۛۙۙۙۜۧۘ۬ۘۦۘ۫۟ۗ";
                                    break;
                                case -254491787:
                                    String str22 = "۬ۢۨ۫ۚۥۤ۬ۡ۟ۖۥۙۛ۠ۤ۬ۙۖۖۨۘۦ۟ۤۧۚۛ۫ۦۙۖۛۨۛۗۙ";
                                    while (true) {
                                        switch (str22.hashCode() ^ 737037881) {
                                            case -2097863727:
                                                str22 = "۬ۡۘۘۧۤ۠ۛ۫ۡۗۖۧۖۡۗۘۥ۠۟۬۬ۡۜۢۚۖۤ۬۠ۙ";
                                            case 26589478:
                                                str22 = jSONObjectOptJSONObject != null ? "ۨۙۚ۠ۗۥۙۜ۟ۥۦۚۧۘۥۘۖۖ۬ۤۤۘۘۧۥۚۡۜۜۘۦۜۘۚۗۖۢۤ۬ۤ۟ۖۘۗۚۙۢۢۜۥۘۡۛۙۖۘ۟۬ۚ" : "۠ۜۡ۫۫ۡۖۡۘ۬ۘۖۚۧۡۘۨۙۜۙۜۨۘۘۙۥۛۘۗۦۦۡۥۜۜۘۜۖۘۘۜۥ۟ۦ۟ۖۘ";
                                            case 486821987:
                                                str21 = "ۨۙۘۘ۬ۜۦۜۨۧۘ۟۫ۖۧۥ۟۟ۨۘ۬ۚۧ۠۫ۙۚۧۘ۫۟ۧۖ۬ۨۘۖۗۤۥۗ";
                                                break;
                                            case 1874138216:
                                                str21 = "ۨۤۤۢۥۜۘۡۛ۬ۙۚۗ۠۫ۤۘۥۜۘۤ۫ۦۡ۬ۜۘۢۢۙ۬ۜۨۘۨ۠ۦۚ۫ۤۧۦۖۘۗۗۡۗۜۤۘ۟۫ۛۙۤ۠ۚۛ";
                                                break;
                                        }
                                    }
                                    break;
                                case 41739353:
                                    str21 = "ۛۛۘۥۙۗۛ۟ۨۘۧۧۛۜۦۡۘۙۗۜۚۢۖۖۦۡۘۗۥۦۜۦ۫۫ۜۛۚۙۜۘ";
                            }
                        }
                        str2 = "ۧۖۖۘۚۛۛۥۢۧۘۗۗۧۘۜۘ۫ۥۖۘۦۢۗ۬ۙۡۘۨۛۗۖۥ۠ۡۤ۟ۥۧۗۛۤۖۘۢۡ۠ۖۘۜۢۙ";
                        break;
                    case 423976290:
                        str2 = "۫ۗۡۘۤۜۧۘۥۢ۫ۜ۠ۢۤۥ۬ۗۗ۬ۥۚۨۘۦ۠ۦۥۜۖۡۚ";
                        obj2 = obj;
                    case 429567079:
                        str2 = "۠۟ۨ۫ۦۥۘۗۙۢۜۥۘ۟ۦۥ۠ۤۥۘ۠ۥۙۚۖۦۗۚۦۘۛۙۨۘۥۖۛۗۤۜۙۚۜۧۤۡۘ";
                        i3 = i;
                    case 468118895:
                        str2 = "ۡۙۨۗۗۦۨۧۗۧ۬ۡۛۜۘۙۧۘۘۛ۟ۛ۫ۥۘ۟ۘۧۘۢۢۨۨۡۨ۟ۧۥۧ۬ۗۦۗ";
                        obj2 = obj;
                    case 502740773:
                        serializableA = s.a(jSONObjectOptJSONObject2.optString("value"), jSONObjectOptJSONObject2.optString("type"));
                        str2 = "ۢ۟ۥۘۨۨۦ۟ۗۦۤۤۡ۟ۘۚۛۘۨۘ۬ۗۥۘۚۡ۟ۥۜ۫ۙۦۗ";
                    case 640326417:
                        sb.append("✅ SP写入拦截：");
                        str2 = "ۤۜ۫ۘ۫ۛ۫ۤۛۘۡۖۦۦ۫ۗۛ۠ۢۙۤۤۡۜ۠ۡ۬۬ۘۨۘۚۚۜۙۢۘۘۖۤۜۘۛ۠ۗ";
                    case 663588242:
                        String str23 = "ۥۨۙۙۢۡۚۘۨۘۛۗۨ۟ۖۖۢۢۘۘۗۚۚۦۢۖۦۜۘۤۘۥ۫۫ۡۘۛۥۙۘۧ۠ۘۗۡۘۚۢۛۜۢۛ";
                        while (true) {
                            switch (str23.hashCode() ^ 1809374565) {
                                case -1289970830:
                                    str23 = "ۢۖۜ۟ۤۥۧ۬ۡۘۢ۟ۦۘۜۘۧۢ۠ۛۤۥۥ۫ۙۨۥۜۖۢۙۦ";
                                case 857891326:
                                    str2 = "۟ۦۗۛۘۨۧۡۦۛ۫ۚۤ۠ۡۧۥۘۧۜۥۘۤۛۥۘ۟ۦۘۢ۠ۤۘۖۧۘۗ۬۠ۨ۟۫ۖۛۛۧۡۦ۫ۛ";
                                    break;
                                case 1650601635:
                                    String str24 = "ۤۢۘۤۛ۫۟ۖۚۜ۠۫ۧۦۜۤ۫ۗ۠۟۠ۛۛۢۨۘۗۧۜ۟ۤۘۧۘۧۨۥۘ";
                                    while (true) {
                                        switch (str24.hashCode() ^ (-767037248)) {
                                            case -1409949129:
                                                str23 = "ۙۤۘ۬ۙۜۘۤ۟ۖۘ۫۠ۦۘۘۦۨۤۥۛ۬۬ۜۙۛۦۘۛ۫ۨۨۖ۠";
                                                break;
                                            case 547574221:
                                                str23 = "ۦ۫ۥۗۢۤۨ۟ۚۥۚ۠ۗ۠۬ۥۚۨ۬ۤۥۜۡۢۛۢۡۘ۟ۤۜۘ۬ۧۡۘۜۢۚۜۦۜۦۧۨ";
                                                break;
                                            case 1362090745:
                                                str24 = "ۤۨۗۙۤۨۧ۟۠ۥ۫ۗۜۡۘۨۦۙۡ۫ۥۘۤۖۧ۫۬ۥۜۜۚۗۥۘۨۡۦۘۗۗۛۡۙۤۗۨۨۘۤ۟ۜ";
                                            case 1670012494:
                                                str24 = jsonResult.optBoolean(strDecrypt, false) ? "ۧۗۛۖۖ۫۫ۢۛ۠ۡۦۦۛۢۦۚۥۡۗ۠ۨۖۧۘۚۜۖۘۢۡۤۡ۠ۨۗۗۦۡۗۛ۬ۗۥۘۚۧۡۚۦۙۚۖۦۦۥۦۘ" : "ۨۘۙۥۡۙۖۚۡۤۡۦۡ۫ۜۙۡۛ۟ۦۛۘۥۧۘۨۨۡۘۙۛ۬ۤۤۘۘۛۛۡۘ۠ۨۥۘ۫ۜۜ";
                                        }
                                    }
                                    break;
                                case 1977969013:
                                    break;
                            }
                        }
                        str2 = "ۧۖۖۘۚۛۛۥۢۧۘۗۗۧۘۜۘ۫ۥۖۘۦۢۗ۬ۙۡۘۨۛۗۖۥ۠ۡۤ۟ۥۧۗۛۤۖۘۢۡ۠ۖۘۜۢۙ";
                        break;
                    case 670015345:
                        sb.append("，类型：");
                        str2 = "ۚۥ۫ۗ۬ۖۘۡۡۦۥۨۥ۬ۚ۫ۛ۫ۧۜ۠ۨ۫۫۫ۘۨۖ۬ۥۨ۫ۦۢ۟۬ۜ۬ۨۖۘۛۡ۬ۡۚۦۖ۫۬ۤۦ۫ۤۨۥ";
                    case 725117450:
                        sb.append(s.b);
                        str2 = "ۜۙۥۘۜۦۛۢۘۨۘۨۜۢ۫ۙۘۘۙۜۥۘ۟ۘۖۘۜ۟۟ۘۗۥۘۢ۟ۥۘۢۖۥ۠ۨۥۡۛ۫۬۫ۙۤۥۧۘ۫ۦۘ۠ۘۧۘۧ۫ۖۘ";
                    case 1049333429:
                        jSONObjectOptJSONObject2 = jSONArrayOptJSONArray.optJSONObject(i3);
                        str2 = "۬ۜۡۘۗۢۜۘ۟ۘۜۧۖۙ۬ۦۘۗ۠ۡ۬ۢۜۛ۫ۤ۫ۗۤ۠ۥۜ۟۟ۢ۠ۡۗۚۨ۟ۖۙ";
                    case 1103103829:
                        String str25 = "ۛۡ۫ۦۧۜۘ۠ۥۙۘۡۧۘۜۘۚۧ۟ۨۙ۬۟۫ۗۛ۫ۛۨۖ۟ۦۘ";
                        while (true) {
                            switch (str25.hashCode() ^ 1258957682) {
                                case -1103555520:
                                    String str26 = "ۧۧۢۜ۬ۛ۠ۡۤۛ۠ۦۘۚۤۨۘۜۤ۟ۘۙ۟ۦۥ۫ۗۖۧۡ۫ۦۘۢۙۜۡ۟۬ۜۨۧۗۧۖۘۨۗۦۘۙۢۦۘ";
                                    while (true) {
                                        switch (str26.hashCode() ^ (-1942055886)) {
                                            case -640039516:
                                                str26 = obj2 instanceof Boolean ? "ۥۢ۫ۖۜۘ۠ۢۥۥۨ۬ۜ۟ۨ۠ۙۚۖۘۜ۬ۥۦۘۜۡۤۧۨۚ۬ۢۖۘۥۢۗ۬۬ۥۤۚۘۘ۫ۤۖۘ۫" : "ۢۜۘۘۚۚۥۥ۫۠۠ۨۦۗۙۛ۬۫۠۫۠ۙۜ۬ۦۦۧۘۘ۠ۚۨۘۘۧۘۘۖۤۦ";
                                            case 604470951:
                                                str25 = "ۙۙۗۙۢۨ۠۟ۚۖۙۘۡ۬ۨۘۜۤ۟ۗۛۡۘۡۜۖ۫۫ۙۛۙۜۘۜۗۗ۟ۤۘ";
                                                break;
                                            case 1486626851:
                                                str25 = "ۦۙۡۧۡۥۘۤۨ۠ۖۨ۫ۧۤ۫ۦۧۤۜ۬ۧۛۛۢۘ۬ۖۢۡ۫ۜۢۚۤۛۢ۫ۦۛ۬";
                                                break;
                                            case 1931161708:
                                                str26 = "ۗۙۢۙۢ۟ۗۜۚۢۤ۠ۚۖۜۨۨۗۙۤۖۦۘۘۨۘۨۘۧ۠ۤۨۨۙۥۡۛۦۛۖۘ۟ۦۚۗۘ۠ۗۙۘۡ۬ۚۥۨۦۘ";
                                        }
                                    }
                                    break;
                                case 279799191:
                                    str25 = "ۡۜۗۧۦۨۨۥۦۗ۬ۜۦ۫ۥ۟ۘۢۗۦۢۤ۫۟۠ۖۡۢۗۚۧۡۘۜۜۜۘۛۡۖۘۤۨ۟";
                                case 1734100862:
                                    str2 = "ۡۗ۟ۜۥۡۘۚۧۨۘ۫ۛۡۗۗۜۘۦۧۦۙۧۛۖۡۛۖۘۗ۫۬";
                                    break;
                                case 2051700502:
                                    break;
                            }
                        }
                        break;
                    case 1263636340:
                        sb.append(str);
                        str2 = "ۛۖۡۜۦۤۥۨ۬ۢۘۘۦۧۜۥ۠ۖۢۥۦۛۨ۫ۦ۫ۦۘۡۨۗۛۥۖۨۧۖۥۢۤۖۚۘۘۡۙۛ۫ۙۧ۬ۚۧۨۧ";
                    case 1302917148:
                        str2 = "ۧۦۘۘۡۡۡۘۖۨۘۘۚۨۖۘۡۘۡۜ۠ۡۥۚۦۘ۠ۦۧۘۘۗۦۘۧ۬ۡۘۨۥۨ۬ۛۘۘۡۙۥۘۘۛۜۘ";
                        obj2 = serializableA;
                    case 1427623896:
                        editor.putBoolean(str, ((Boolean) obj2).booleanValue());
                        str2 = "ۤ۠ۡۘۛۧۧۡۜۡۦۖۙ۠۟ۤۨۙۜۘۗ۫ۘۘۗۛۖۜۗ۠ۢ۫ۖۘۜۗۦۢ۬ۖۘۛۜۦۘ۠ۖۧ۟ۙۨۨ۫";
                    case 1480272060:
                        break;
                    case 1581438729:
                        jSONArrayOptJSONArray = jSONObjectOptJSONObject.optJSONArray(s.b);
                        str2 = "ۧۨۖۘۤ۬ۗۤ۫ۖۘۖ۠۬ۤۦ۟ۙۥۘۛۘۘ۟ۡۡۘۢ۠ۦۢۥۤ";
                    case 1665277660:
                        i2 = i3 + 1;
                        str2 = "ۡۘۜۘۙۢۘۗ۟ۙ۫ۤۡۘۨۨۗۗۚۛۡۛۖۘۤۗۘۘۢۛۖۜۥۘۖۥ۟۬۬۬ۖ۫ۦۙۦۧۘ";
                    case 1731892285:
                        str2 = "۠۟ۨ۫ۦۥۘۗۙۢۜۥۘ۟ۦۥ۠ۤۥۘ۠ۥۙۚۖۦۗۚۦۘۛۙۨۘۥۖۛۗۤۜۙۚۜۧۤۡۘ";
                    case 1870283477:
                        String str27 = "ۡۢۨ۬۟ۜۘ۟ۘۢ۫ۖ۟ۥۛۡۘۗۙۦۘۢۦۧۘ۬۟ۦۛۤۘۘۚ۬ۦ۠۫۟ۘۙۘ۠ۙۤۖۖۘ۟ۗۦۘۡ۠۬ۜۗۢۜ۟ۤ";
                        while (true) {
                            switch (str27.hashCode() ^ 1472260192) {
                                case -2028037573:
                                    str27 = "۠ۦۥۗۤۨۘۚۢۖۖۖۨۡۗۜۘۗۦۧۘۡ۫ۛۗۜۢۥ۫ۡۨۦۤ۠ۗۗۨۢۦۘ";
                                case -1470268947:
                                    str2 = "ۡۧ۟ۧ۠ۧۡۗۛۜۦۜۗۜۧۘۡۨۖۘ۬ۜۥۘۙۡۥۘۢۜۘۗ۬ۙۘۘۡ۫ۙۛۤۦۧۘۡۙۦ";
                                    break;
                                case 86305730:
                                    break;
                                case 801388766:
                                    String str28 = "۬ۖ۬ۧۙۡۘۧۖ۟ۖۜۦ۬۟۠ۘ۬ۦۘۖۖۗۚۚ۠ۡۡۡۘ۫۫ۙۨۗۜۡۨۢ";
                                    while (true) {
                                        switch (str28.hashCode() ^ 1307821102) {
                                            case -1975284285:
                                                str27 = "۬۟ۘۛ۫ۤۥۖۙ۬ۚۘۛ۠ۗ۬۟۟ۦۨۦۨۧۡۖۨۖۘۚ۫ۤۢۘۘۧ";
                                                break;
                                            case -1273603627:
                                                str27 = "ۧۗۢۢۦۤۢۗۧۥۘ۟ۢ۠ۜۢۘۡۨۜۡۘۙۤۘۥۡ۟ۚۗ۫ۜۜۚۡۨ۫۬ۚۙ۬ۚۘۘۦۙۡۖۡۧۘ۬۬ۨۡۦۜ";
                                                break;
                                            case -1112351327:
                                                str28 = "ۧ۬ۛۢۙۧۥۖۤۛۤ۟۬ۖۘۘۧۛ۟ۛۢۤۨۡۡۘۡۦۛۢۜۧۘۘۤۗۙۢۢ۫ۡۚۜۧۘۦ۫۫ۘۨۗۖۧۜۘۢۙۡ";
                                            case -253484671:
                                                str28 = jSONArrayOptJSONArray != null ? "ۢۘۥۤۤ۠ۘۜۢۜۚۦۘۥۤۡ۠ۙ۬۫ۚۤۦۨۥۘۚۢۘۛۨ۟ۛ۟ۙۨۦۘۢ۬ۧۥۥۙۙۗ۠ۢۨۘ" : "ۨۡۜ۠ۜۥۜۖۛۘۛۘۥۨۥۦۘ۟ۨ۟ۨۚ۫۬ۤۤۥۡۖۘۜۢ۠ۥ۟ۜۗۦ۫ۤۢۦۤۨ۫ۢ۠۟";
                                        }
                                    }
                                    break;
                            }
                        }
                        str2 = "ۧۖۖۘۚۛۛۥۢۧۘۗۗۧۘۜۘ۫ۥۖۘۦۢۗ۬ۙۡۘۨۛۗۖۥ۠ۡۤ۟ۥۧۗۛۤۖۘۢۡ۠ۖۘۜۢۙ";
                        break;
                    case 1878156784:
                        str2 = "ۚ۬ۜۘۜۨۖ۫۫ۚۤ۟۠۟ۛۢ۬ۡۡۘ۟۬ۜۘ۠ۡۦۘۢۙۡۘۖ۫۠";
                    case 1895770433:
                        str2 = "۟ۡۨۤ۟ۥ۟ۜۧۡۡۘ۠ۧۜۖۤۗ۟ۙۤ۫ۜ۟۬ۗۤۚۤ۫۠ۧ۠ۜ۟ۚ";
                        i3 = i2;
                    case 1912858143:
                        String str29 = "ۖ۠۟ۦۢۛۛۙۘۖۡۧۘۡۙۘۘۗۢۗۥۢ۠۫ۥ۬ۥۙۖۨۘ۟ۤۡ۠ۥ۟ۦۗ۟۠ۨ۫ۢ";
                        while (true) {
                            switch (str29.hashCode() ^ 1758748490) {
                                case -1746548290:
                                    String str30 = "ۥۖۡۘۡۨۦۘۙۥۢۤ۠ۗۗۧۜۘۖ۬ۘۘۗۢۤۖۚۗۦۦۨۘۢۧۥۘ";
                                    while (true) {
                                        switch (str30.hashCode() ^ (-1688570413)) {
                                            case -1234068954:
                                                str30 = "ۦۜۨ۠ۡۘ۟ۙۛ۬ۡۚۘۙۘۘۢۤۚۖۘۘۘۥۨۧۗۗۦۘۜۙۨۘۙۚۦۘ۫ۥۘۥۡ۬۫ۜۢۗۙ۠ۡۘ";
                                            case 432914511:
                                                str29 = "ۡۦ۟ۚۗۧ۫ۖۖۘۘۛۘۘ۫۬ۧۢۧۡۙۖ۠ۜۚۘۘۨۘۘۡ۬ۥۘۥۤۨۖۤۖۨۗۖۡۘ";
                                                break;
                                            case 1417081241:
                                                str30 = jSONObjectOptJSONObject.has(s.b) ? "ۘۜۘۘۙۜ۬۫ۤۡۥ۟ۜۘۙۙۛ۫ۨ۠ۚۦۛۢ۟ۚۘۙۨۘۨۛۖۘ" : "۟۬ۘۘۢۛۚۗۗۨۘۨ۫ۦۨۘۧۗۙۜۘۚ۠۫ۡ۬ۢۡۨۘ۫ۙ۫ۖ۫۫ۧ۫ۘ";
                                            case 2098539873:
                                                str29 = "ۗۛۢۥ۬ۖۘۧۨۖۘ۫ۘۡۖۗۥۘۗۥۧۘۨۡۜ۫ۚۜ۫ۢۚۗۧۘ۫۫ۘ۠ۧۡۡۡۥۘۧۦۦۛۨۢۗ۠ۥۘ";
                                                break;
                                        }
                                    }
                                    break;
                                case -1508662539:
                                    str2 = "ۛۦۨۘ۫۟ۢۡۜۚۘۡۦۘۧۨۤۜۥۡۦ۟ۗۘۜۘۘۤۧۘۘۜۛ۟ۙۦۘۘۢ۠۬ۥۦۙۚۘۧۘۛۤ۬ۢۜۤ";
                                    break;
                                case -1235861010:
                                    str29 = "ۚۦ۠ۦۜۘۘۦۡۘۥۢۨۙۦ۬ۗۢۗۨۘۨۘۡۖۘۘۧۚۢ۬ۤۘۘۘۨۤۗۥۧۘ۫۠۠ۘۨ۫ۧۢۡۘۧۦۦ";
                                case 241962593:
                                    break;
                            }
                        }
                        str2 = "ۧۖۖۘۚۛۛۥۢۧۘۗۗۧۘۜۘ۫ۥۖۘۦۢۗ۬ۙۡۘۨۛۗۖۥ۠ۡۤ۟ۥۧۗۛۤۖۘۢۡ۠ۖۘۜۢۙ";
                        break;
                    case 2062473754:
                        strDecrypt = "enable_sp_put";
                        str2 = "۟ۨۗ۫۠۠۟ۧۙۥۡۦۘۡۦ۬ۡۖۨۘۤۚ۫ۖۥۘۡۙۦ۫ۚۥۘۚ۬۟ۤۗۜۧۡۗۚۥۘۨۤۡۢۡۘ۠ۘۜۘ";
                    case 2140354135:
                        editor.putString(str, (String) obj2);
                        str2 = "ۤۤۨۘۤۧۡۦۡۚۙۥ۬ۗۗۚ۫ۖۢۨۚۖۘۨ۟ۥۜۗۜۡۨۥۘۜۥۜۘ۠ۘۦۘۚۙۜۘۢۚۘۘ۬ۡ۬ۘۘ";
                }
                return;
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public void apply() {
            String str = "ۘۤۨۘۨۡ۬ۤ۟ۥۘۢۙۘۖۨۧ۬ۨۡۛۙۘۘۘۜۦۘ۠ۛۥۨۜۢۖۡ۟ۡ۠ۡۗ۫ۜۘۙۜۘ";
            while (true) {
                switch ((((str.hashCode() ^ 189) ^ 694) ^ 907) ^ 1137435004) {
                    case -1005970897:
                        str = "ۨۢ۬ۜ۬۠ۨ۬۟ۦۡۘۙۘۘۘۖۜۨۦۖۥۦۦۤ۫ۦۡۗۢ";
                        break;
                    case -252695165:
                        this.a.apply();
                        str = "۠ۡۖۘۜۜۧۘ۟ۚۨۘۖۗۖۘۚ۟ۘۘ۟۬ۨۥ۠ۦ۬۠ۘۘ۫ۛ۫ۛۜۡۘۖۜ۟۬ۜۡۘۗۖۢۜۗۦۘ";
                        break;
                    case 241496356:
                        return;
                }
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public SharedPreferences.Editor clear() {
            String str = "ۤۖۢ۫ۧۘ۠ۨۥ۠۬۬ۡۙۗۗۨۘۜۧ۬ۦ۟ۛۖۧۨۛۡۖ";
            while (true) {
                switch ((((str.hashCode() ^ 609) ^ 822) ^ 514) ^ 1807077158) {
                    case -1829503764:
                        return this;
                    case -1445497931:
                        this.a.clear();
                        str = "ۖۥۦۘۡۤ۬ۗۜ۟ۗۗۨۘۛۛۗۥۤۨۘۦۨۚۢۗۦۘۢۦۥ۬ۥۤۤ۫ۦۘۜ۠۫۬ۥۢۙ۫ۧۗۗۚۖۙۧ";
                        break;
                    case 860132834:
                        str = "ۜۖۙۨۦ۠۟ۥ۟ۗ۬ۘۘۨ۟ۤۥۙۜۥۨۡۨۛۧۘۢۚۘۛۥۡۥۘ۬ۧۧ";
                        break;
                }
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public boolean commit() {
            String str = "ۢۡۡۘۥۖۨۦۘ۬ۨۢۖۨۡۦۘۨۜۨۥۧۜۘۤۖۨۛۧۥۗۘۜۗۖۢۤ۠ۢۗ۟ۗۘۢ۠";
            while (true) {
                switch ((((str.hashCode() ^ 786) ^ 552) ^ 490) ^ 1462354181) {
                    case 1062453995:
                        str = "ۘۙۨۖۘ۬ۨۥۥۚۨۦۘۢۡۗۥۚۙ۠۟ۡۖۧۡۘ۫ۥۜۢۛۦۘۨۜۥۘۤۘۧۘۘۧۘۚۤۖ";
                        break;
                    case 1746099190:
                        return this.a.commit();
                }
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public SharedPreferences.Editor putBoolean(String str, boolean z) {
            String str2 = "ۜۙۘ۫ۨۦۘۜۛۡ۫ۗۜۚۥۘۚۧۢۗۤۗۙۗۚۧۘۡۘۨ۬۬ۛۗۜۘۘۢ۬ۢ۬ۚۥۦۧۘۡۢۖ۠ۤۡۛۚۖۘ۟ۙۥۘ";
            while (true) {
                switch ((((str2.hashCode() ^ 392) ^ 845) ^ 959) ^ (-1695252158)) {
                    case -522674497:
                        return this;
                    case 37131912:
                        str2 = "ۢۖ۠ۗۢۘۘۗۗۦۘۗۤۧۙۗۜۘ۟ۛۢۛۨۙۥۡ۟ۦۨۘ۠ۚۧۖۥۗۘ۟ۦ";
                        break;
                    case 517782552:
                        a(Boolean.valueOf(z), str);
                        str2 = "ۗۡۘۜۛ۬ۜۢۢۜۙۨۘۢ۫ۗ۠۟۫ۙۗۨۨۧۡۘۨۥۡۘۗۦۨۢۗ۠ۛۘ۫ۘۡۗۚ۠۫";
                        break;
                    case 1509228396:
                        str2 = "ۤۢۢ۠ۡۖۜ۬ۦۤۨۧۘ۫ۦۤۘۥۦۘ۠ۘۜۡ۫ۚ۬ۦۦ۫۟ۨۙۙۤۦ۫ۦ۟ۘۚ۫ۘۡۖۚۜۘۥۨۧ۫ۦ۬ۧۘ";
                        break;
                    case 1997086404:
                        str2 = "۠ۢۡۘۥۡۙۜۤۧۥۘۢۚۢ۠ۦ۫ۜۢ۠ۨۘۦۡۨۦۤۨۛۥۚۨۤۥۘۡۥۙ";
                        break;
                }
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public SharedPreferences.Editor putFloat(String str, float f) {
            String str2 = "ۢۙ۠ۚۜۧۤۦۦۘۨۧۘۦۤۖۘ۠ۖۘۦۜۘۙۛۘۦۨۜۘۛ۫ۢۚۡ۟۫ۦ۠ۜۛۛۧۤ۟ۥۧۜۘۚۜۡ";
            while (true) {
                switch ((((str2.hashCode() ^ 680) ^ 672) ^ 269) ^ (-5645911)) {
                    case -1939823373:
                        return this;
                    case -709418101:
                        str2 = "۫ۤۢ۬۟۫ۤۚۙ۟ۡۧۖۧۜۘۤ۫ۡۘۢ۟ۢ۬ۥۨۘۚۡۜۘۖۘۨۘۙۛ۫ۜۘۨۥۖۖۧ۟";
                        break;
                    case -39390098:
                        a(Float.valueOf(f), str);
                        str2 = "ۡۢۜۨۗۚۢۖۦۡۨۙ۬ۘۧۘۛ۬ۘۚۢ۬ۙۙۧۜۡۘۢۘۖۘ۟ۙۘۘ۟ۖ";
                        break;
                    case 181671103:
                        str2 = "ۙ۫ۦۘۦۧۚۚۜۨۚ۫ۗۡۚۨۙۜۢۘۨۖۡ۟ۘۘۤۖۙۗۗۘ";
                        break;
                    case 791971964:
                        str2 = "ۢۖۨ۬ۗۥۘۗ۠ۖۢۡۨۧ۟۠ۛۦۨۘ۠ۢ۟ۜۛۛۥۗۤ۬ۧۚۖۡۢۦۨۗۢۥ۠ۙ۠ۧ";
                        break;
                }
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public SharedPreferences.Editor putInt(String str, int i) {
            String str2 = "ۚ۠ۖۖۙۥۘۤۢۨۗ۬ۗۢۤۡۘۢۢۜۘۡۛ۠۫ۖۥۜۡۡۘۤ۟ۜۘۤ۫ۢۨ۟۫";
            while (true) {
                switch ((((str2.hashCode() ^ 253) ^ 754) ^ 800) ^ (-1435860909)) {
                    case -1346490162:
                        str2 = "۠۠ۖۘۖۖۥۗۧۨۚۖۤۥۗۧۦۛ۟ۤ۠ۖۗ۟۠ۦ۫ۘ۠۠ۢۘۗۡۘ۟۫ۨۘۜۜۘۘۗۤۨۜ۬ۦۘۡۗ";
                        break;
                    case -654185936:
                        str2 = "ۙ۬ۜۡ۫ۨۢۚۖۦۦ۟۠ۖۦۘۤۖۦۤۜۧۘۨ۠۬ۢ۠ۡۘۘۨۛۤ۠ۧۜۘۧۥۦۢۨۚۧ";
                        break;
                    case 339302959:
                        str2 = "ۙۦۧۤۜ۠ۗۧۗۜۘۖۢۜۤۢۥۜۘۚ۟۟ۡۦۛۨ۬ۙ۠ۗۨۚ۬۠ۦۙۢۢۛۤ۬۠۫ۦ۬ۜۙۖۘ";
                        break;
                    case 654459465:
                        a(Integer.valueOf(i), str);
                        str2 = "ۦۜۡۘۧۛۘۛۜۘۘۙۨ۠۠ۙۥۘۖۨ۬ۖ۬ۖۘ۫ۦۧۘ۟ۢۗۘۨۡۛۗۜۘ۫ۡۖۘۗۛۗۥ۬ۡۘ";
                        break;
                    case 1364259095:
                        return this;
                }
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public SharedPreferences.Editor putLong(String str, long j) {
            String str2 = "۟ۡۧۘۢۦۛۙۥۨۛۥۘۘ۠ۨۥۘۜۛۗۖۖۨۘۚۤۧۙۛۗۜۘۘۘ۫ۧۙۨ۬۫ۗۛۡۤۗ۠ۦ۠۬۠ۖۘۧۡۢ۫ۜۘ";
            while (true) {
                switch ((((str2.hashCode() ^ 628) ^ 426) ^ 639) ^ (-1965248827)) {
                    case -1769350804:
                        str2 = "ۢۗۨۘ۟ۜۖۘۜ۟ۧۤ۫ۥۗۖۖۘۖۡۦۘۖۖۜۗۡ۟ۖ۫ۡۘۘۜۘۖ۠ۚۘۗۦۘ";
                        break;
                    case -1462475094:
                        str2 = "ۘۢۖۡ۫ۛ۟ۤۖۚۥۥۘۥۘۥۘ۟۟ۖۡۛۗۘۤۖۙۖۜۖۙۤۥۘۢۦۛۙۛ۟۫ۢۗ";
                        break;
                    case -993215695:
                        a(Long.valueOf(j), str);
                        str2 = "ۖۘ۬ۧۛ۫ۢۖ۫ۙۢۢۛۙۢۢۨۘۘۛۚۧ۬ۛ۬ۘ۫ۖ۫ۗۜۛۜۛۛۡۨۡۧۜ۬ۚۦۘۨ۟ۡۚۦۜۘۗۖۚۢ۟ۜۘ";
                        break;
                    case -143545002:
                        str2 = "ۖۤۦ۫۬ۨۧ۬ۨۘۘۛۨۘ۟ۨۖۘۗ۬ۛۨ۟۫ۢۨ۬ۥ۬۫ۛ۠ۨ";
                        break;
                    case 1853776631:
                        return this;
                }
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public SharedPreferences.Editor putString(String str, String str2) {
            String str3 = "ۢۗۥۘ۬ۦۨ۠ۚۧ۠ۡۘ۟ۘۥۘۜۜ۠ۧ۬ۡۗۤ۟ۖۖۦۘۛ۟ۨۘۤۥۡۘ۟ۤۙ۟ۛۤۢۘۙ۟ۡۘۖۥۦۘۚ۫ۚۦۤۧ";
            while (true) {
                switch ((((str3.hashCode() ^ 875) ^ 904) ^ 904) ^ 1015687738) {
                    case -1166945436:
                        return this;
                    case -220526063:
                        str3 = "ۨۧۚ۬ۦ۫ۨۢۡۘۚۖۜ۫ۡۨۘ۠ۡۘۘۡ۫۟ۥ۬۫۬۬ۡۨۨۡۘ";
                        break;
                    case 2065557048:
                        str3 = "ۥۙۙۜۡۖۖۤۚۜۤۢۥۨۜۘۖ۟ۡۙۘۢۨۧۧ۠ۗۜۘۡۗۥۘ";
                        break;
                    case 2087756971:
                        a(str2, str);
                        str3 = "ۜۡۧۧ۫ۥۨ۠ۛۗۥۡ۠ۚ۠ۚۦۨۥۛۖ۫ۘۙ۬ۜ۫ۗ۠ۨۘۖۜۜۨۤۗۗۦۘۛۢۖۙۦۚۥۧۘۘۢۧۥۘۤۤۜۘ";
                        break;
                    case 2109367761:
                        str3 = "ۗۛۦۙۖۨۛۗۤۗۚۘۘۙۢۜۘۤ۟ۨۘۦۗۥۘۜ۟۟ۨۘۥۘ۠ۙ۫ۢ۬ۘۘۗۧۨ۬ۚۥۘۡ۠۟";
                        break;
                }
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public SharedPreferences.Editor putStringSet(String str, Set<String> set) {
            String str2 = "۟ۦ۠ۡۧۨ۫ۥۜۦۚۙۖۥۗۢۛۤ۫ۖۗۥۘۗۘۛۡۧۚۡۗۦۖۦۧۜۢ۠ۙۦۙۤۡۤۤۢ۬ۤۙۛ۠ۚۢ";
            while (true) {
                switch ((((str2.hashCode() ^ 372) ^ 944) ^ 406) ^ (-1502813312)) {
                    case -1375843554:
                        str2 = "ۙۖ۟ۤۦۦۘۢۙۨۙۚۙۘۙۛۥۧۘ۠ۥۜۚۚۘۤۘۦۘۤۘۢ";
                        break;
                    case -1047945787:
                        return this;
                    case 421983246:
                        str2 = "ۖۥۦۘۖۗۨۘ۠ۨ۟ۡۡۧۛۜۛۦۖۧۘۥۙ۫ۢۢۗۚۡۥۘۖ۫ۜۥۛۚ۫۠ۚ۠ۛۡ۟ۨۘۘۤۗۛۨ۟۬ۡۘۡ۬ۥ";
                        break;
                    case 1012070108:
                        str2 = "ۧۡۦۘۢۘۧۜۘۚۛۘۖۘۡ۫ۛۧۨۙۢۗۘۘۜۧۡۘ۫۟ۤۜۚۖۘۛۨۥۥ۬ۡۘ";
                        break;
                    case 1602049262:
                        a(set, str);
                        str2 = "ۢ۬ۚۢۗۡ۫ۨۦۘۘۗۨۘۢ۟ۥۘۦ۬ۤۜۛۘ۫ۤۨۖۜۡ۫ۨۤۤۙۧ۟ۨۘۛ۟ۤۢۧۦۘ۫ۨۜۛۚۡ۠ۤۜۧۛۜ";
                        break;
                }
            }
        }

        @Override // android.content.SharedPreferences.Editor
        public SharedPreferences.Editor remove(String str) {
            String str2 = "ۡۡ۠ۥۚۜۛۛۘۘۘۨۗۢۚۤ۠ۚۤ۠۠ۦۤۥۗۖۤۢۛۗۗ";
            while (true) {
                switch ((((str2.hashCode() ^ 413) ^ 335) ^ 352) ^ (-42641192)) {
                    case -1225207617:
                        str2 = "ۙۗۨۘۚۚۘۥ۫ۥۘ۟۠ۘۗ۬ۗۘۨۧۘۨ۠ۖۘۙ۠ۘۖۚۤۛۢۥۘۖ۬ۘۘۗۢۤ";
                        break;
                    case -349022530:
                        this.a.remove(str);
                        str2 = "۫۟ۧۥۜۖۘۗۗۡۧۚۡۗ۬ۗ۠ۡۜ۟۟ۤۙۨ۟ۢۨۡۘ۫۫ۘ";
                        break;
                    case 528595547:
                        str2 = "۬ۨ۬ۢ۠۬۟ۢ۟ۥ۫ۡۚۧۡۢۗۡۦۜ۬ۚۨۤۧ۫۠۬ۨۛۡ۬ۙۚ۟ۢۡۦۤۨۥۚۚۙۨۥۨۧۘۤۧۖۡۚ";
                        break;
                    case 921764823:
                        return this;
                }
            }
        }
    }

    public s(SharedPreferences sharedPreferences, String str, int i) {
        this.a = sharedPreferences;
        b = str;
    }

    /* JADX WARN: Can't fix incorrect switch cases order, some code will duplicate */
    public static Serializable a(String str, String str2) {
        char c;
        try {
            switch (str2.hashCode()) {
                case -1808118735:
                    String str3 = "ۥۘۙۚۧۦۘۗ۫ۥۧۨۙۧۨۘۚۧۚۛۥۧ۟ۖۧۨۨۘۡ۠ۥۢۨۘۘۢۖۘۡۘۡۘۙۥۗ";
                    while (true) {
                        switch (str3.hashCode() ^ (-1982136701)) {
                            case -1943136036:
                                break;
                            case -1874664429:
                                str3 = "ۦۙۚۧۙ۫ۙۛۖۘۢۙۖۙۥۖۗ۫ۦۦۢ۬ۢۤۨۘۢ۠۠ۦ۬ۡۢۡۘۧۜۨۘۛۚۗۖۡۖۘۡۤ۬ۤۦۖ";
                            case -699038593:
                                c = 5;
                                break;
                            case -377990687:
                                String str4 = "۠ۗۗ۠۫۫ۥۗۛۨۨۘۘۦۙۘۜۛۧۖ۟ۚۨ۟ۙۗۙۙ۟ۢۧۦۧۘۗۖۖۙ۠ۖۘۚۨ۟ۜۙۥۘۨۜۥۘۗۙ۟ۧۢۦۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ 276142571) {
                                        case -1508369762:
                                            if (!str2.equals("String")) {
                                                str4 = "ۢۗۙۤۚ۬ۘۖۥۘۥۖۖۘۚۗۘۡۘۨۙۧۖۘۚۢۦۘۢۛۖۖۘۘۥۤۘۘۡۧۘ";
                                                break;
                                            } else {
                                                str4 = "ۛۧ۬ۧۜ۟ۚۛۙ۫ۤۘۖ۫ۘۜۘ۫ۖۜۥۖ۫ۦۘ۫۠ۗۧۖۜۘ۟ۖۥۘۢۥ۫ۥ۫ۖۘ۟ۜۤۢ۬ۖۘ۟ۜۡ";
                                                break;
                                            }
                                        case -918791889:
                                            str3 = "۫ۘۚۚ۠ۖۘ۟ۛۡۘۢۢ۫ۖ۟ۤۚۖ۬ۙۡۡۘۥ۫ۡ۟ۤۨۖۖۘۛۨۨۘ۬۟ۨ";
                                            continue;
                                        case 354446136:
                                            str4 = "۟ۥۘۘۗۘۥۧۥۨۘۙۖ۫ۡۙۡۡۢۡۘ۠ۘۡ۠ۜۘۘۜۦۢۙۘۥۤۛۨۘۚۚۨۨۘ۟ۢۖۘۗ۫ۛۡ۟ۡۘۨۘۡۘ۫ۥ";
                                            break;
                                        case 1903660048:
                                            str3 = "ۧۧۦۘۡ۬ۡۘۥۤۦۖۛۡۧ۟ۖۘۡۥۙۗۧ۟ۤۥۨۘۥ۟ۘۢ۟ۚۚۡ۫۟ۧۜۖ۫ۦ۫۠ۨۘ۬ۗۛۜۥ۟ۡۦۥۘ۟ۙۡ";
                                            continue;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -672261858:
                    String str5 = "۟ۥ۫۟ۙۢۜۛۨۘۙۛۖۡۖۥۖۘۘۡۢۥۖ۟۟ۧ۠ۦۖۜۛۨۘۨۙ۟ۜۘۥۦۤۜۤۡۘۧۚۨۘۥۤ۟ۨ۠ۡۙۦۤ";
                    while (true) {
                        switch (str5.hashCode() ^ 856790488) {
                            case -1399412903:
                                String str6 = "ۖۛۖۗۚۡۘۖۗ۟۫ۙۢۦۛۡ۠۫ۥۘۧۤۜ۫ۡۛۡۡۖۧۘۥۗۜۘۥۢۡۥۥۨۘۡۧ۬ۦۧ۫ۖۥۘ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-803899476)) {
                                        case -1483222405:
                                            if (!str2.equals("Integer")) {
                                                str6 = "ۢۙۚۘۙۖۘۖۦۖۘ۫ۦۘۘۚۜۤۚ۬ۡۘۖۦۙۦ۫ۛۚ۠ۤۖۛ۟";
                                                break;
                                            } else {
                                                str6 = "ۗ۫ۜۘ۠ۧۨۘ۠ۖ۟ۤۖۖۘۡ۬ۖۘۙۤۖ۟۫ۗ۬۟ۤۥۙۦۘۨۦۛۘۨۡۗ۠ۧۦۗ۟۬ۥۦۘۛ۠ۤۗۗ۫";
                                                break;
                                            }
                                        case -681959549:
                                            str6 = "ۖۥۤۛۚۡۘۢۚۖۘۧۡۨۘۡۘۦۥۜۦۘۗۙۜۘۢۦ۟ۥۘۗۥ";
                                            break;
                                        case 123346189:
                                            str5 = "ۨۖ۟ۡۡۦۘۤۚۡۥۘۥۥۤۥۛۥۘۛۦۧۘۚ۠ۡۘۛۘۖ۠ۖۜۛ۬ۚۧۚ";
                                            continue;
                                        case 1341790745:
                                            str5 = "ۡۥۖۘۛ۫ۦۘۗۚۨۘ۠ۗۧۤۗۜۘ۠ۖۡۨۥ۫ۥ۬ۧۚۥۛ۠ۡۘ";
                                            continue;
                                    }
                                }
                                break;
                            case -1114750788:
                                break;
                            case -195560872:
                                str5 = "ۤ۠ۤ۟ۡۧۗ۬ۤ۬ۛۘۘۤۖۡۨ۟ۡ۟ۗۖۚۥۡ۬۠ۡۜۖ۟ۦۨۜۖۖۦۘۚ۟ۥۢۨ۬";
                            case 642511678:
                                c = 1;
                                break;
                        }
                    }
                    break;
                case 2374300:
                    String str7 = "ۢۨۘۙۙۢ۬ۖۘ۠ۘۘۘۛۤۥۚۘۧۦۘۘۖۦۨۘۜۨۚۡۧۦ";
                    while (true) {
                        switch (str7.hashCode() ^ 1146312419) {
                            case 333797362:
                                break;
                            case 448977448:
                                str7 = "۬ۢ۟ۚۢۘۘۤۢۙ۠۟ۨۥۡۥۢۚۨۘۨۦۘ۬۟۠۠ۤۖۘ۟ۜ۠";
                            case 667456470:
                                String str8 = "ۦۥۦۘۤۤۖۤۥۙۜۡ۠۠ۨۥۘۧۥۛ۠۟ۨۘۖۘ۫۬ۖۘۖۗ۠ۜۖۥۘۘۡۛۥ۬ۦۦۢۗ";
                                while (true) {
                                    switch (str8.hashCode() ^ (-574865357)) {
                                        case -1715251098:
                                            str7 = "۟ۢۚۤۖۗۡۨۘۘۢ۠ۢۙۜۦۘ۟۬۟ۧۥۘۤۨۢۘۥۗۚۗۦ";
                                            continue;
                                        case -804170501:
                                            str7 = "ۢۗۘۘۜۘۥۘۧۨۧۨ۟ۘۘۗۚۦۘ۟ۛۤ۟ۢ۟ۙۚ۬۫۠ۖۘۤ۬ۨۘۜۘۙۘۚۘۘۡۙۜ۠۟۠ۧۘۥۘۨۥۚۙۗۧۨۡۘ";
                                            continue;
                                        case -7420587:
                                            str8 = "ۚۜۤ۬ۙۜۘۧۙ۠۫ۦۗ۟ۚۜۢۜۦۘۤۢۘۘۚۚۘۙۨۘۘ۬ۚۦۛۥ۟۟۫ۡۥ۟ۜۘۘۛۤ";
                                            break;
                                        case 1342896739:
                                            if (!str2.equals("Long")) {
                                                str8 = "ۨ۟ۙۦۤ۠ۢۘ۫ۖۥۖۘ۟۬ۜۘۙۚۙۖۥ۬ۨۦۦۘۖۥۦۧ۬ۘۘ۫ۥۨ۫";
                                                break;
                                            } else {
                                                str8 = "ۙۘۖۙۘۛۨۥۦۡ۟۬ۥۦ۬ۙۜۡۘۖۜۦۘۨۤۜۗۗۡۘ۠۬ۢ۬۬۫۫ۜۤۧ۫ۡ۫۬ۖ۠ۧۡۤۢ";
                                                break;
                                            }
                                    }
                                }
                                break;
                            case 1246110107:
                                c = 2;
                                break;
                        }
                    }
                    break;
                case 67973692:
                    String str9 = "۫ۨۨۘۥۥۘ۟۟۠۠۠ۜ۟ۦۖۘۖۜ۫۬ۤۨۘۘۚۨۨۥ۠ۧۧ۬";
                    while (true) {
                        switch (str9.hashCode() ^ 1138859256) {
                            case 879092426:
                                String str10 = "۟ۛ۫ۦۜۥۖۚۤ۟ۜۖۥ۬۠ۦ۠ۚOۢۚ۟ۨۘۘ۫ۨۗۢۨۘۖۗۦۜۥۡۡ۠ۘۧۜۘۘۡۗۛۙۥۘۧۨ";
                                while (true) {
                                    switch (str10.hashCode() ^ (-358639566)) {
                                        case -1967008448:
                                            str9 = "۠ۦ۠ۤۨۚۜ۫۫ۖ۫ۖۘ۟ۘۗۗۢۨۜۤۤۜۧۘۚۛۛۜۢۛۗۘۨۘۚۜۖۘۨۧۥۜۨۦۘۡۛۨۚۧۚ۬ۘۖۜۡۘ";
                                            continue;
                                        case 364847025:
                                            str9 = "۠۬ۗۚۨۨۦ۫ۖۙۙۧۥۜۘ۫ۘۡۖ۬ۨۘ۠ۨۖۘۜ۟ۨۘۙۧۡۘ۬ۙۤۧ۬ۗۙۘۢ۠ۨ۬ۥۡۡۚۚۜۚۘۙۛۗۥۘ";
                                            continue;
                                        case 1323984678:
                                            str10 = "۬ۗۥ۟ۛ۫۟۠ۦۙ۠ۡۘۖ۬ۥۘۗۥۙۥ۟ۗۛۥۘۘۨۗۨۨۧۘۤ۫ۗۢۢۢۙۚۤۚ۟ۘۘ";
                                            break;
                                        case 2123115241:
                                            if (!str2.equals("Float")) {
                                                str10 = "ۘۖۖۘۨ۫ۡۦۨۨۚۖۗۗۢۦۚۥۙۚۙۥۛۖۘۡۙۨۘ۠ۘۦۘۘ۠ۥۢۘۘۘۤۖۤ۠ۦۘۘۢۜۤۨ";
                                                break;
                                            } else {
                                                str10 = "ۘۛۖۘۤ۠ۢ۫ۡۗ۟۬۟ۤۥۘۨۧ۫ۨ۬ۛۧۖۜۥۡۢۧ۠ۡۙۛۢۤۖۨ۟ۥۤۜۢ۬ۦۥۧۛۙ۠ۤۛ۠ۦۘۘ";
                                                break;
                                            }
                                    }
                                }
                                break;
                            case 886935983:
                                str9 = "ۢ۠ۘۘۥ۟ۧۡۗۦۥۦ۬ۘۦۗۦۛۡۘۚۖۧۙۙۡۘۖۦۦۘۢۘ۟۬۬ۛۥۢۨۚۧ۫ۜۜ۟ۚۨۘۡۢۘۘۢۘۡۘۡۙ۫";
                            case 924327053:
                                break;
                            case 1924062564:
                                c = 3;
                                break;
                        }
                    }
                    break;
                case 569876659:
                    String str11 = "ۖۛ۟ۨ۫ۛۨۧ۬ۘ۠ۚۧۧ۫۬ۗ۬۬ۛۢۖۖۢ۟۬ۛۗۢۡۘۙۧۦۘۥۖۚۥ۠ۥۜۗۜۘۚۢۙ۟۬ۜۘۧۧۥۛ۠ۖ";
                    while (true) {
                        switch (str11.hashCode() ^ (-1023758927)) {
                            case -1772179433:
                                String str12 = "۟ۗ۫ۛۛۨ۫ۡۘۧ۬ۚۥۛۛۨ۟۟ۖ۬ۧۚۨۛ۠ۖۘ۫ۦۘ۠ۜۧۡۦۘ";
                                while (true) {
                                    switch (str12.hashCode() ^ (-1455089314)) {
                                        case -1468218252:
                                            str12 = "ۚ۬۠ۛۥۨۘۥۤۦ۠ۚۨ۬ۚۘۘۘۤۢۥۨۥۜۛ۫۬ۧ۠ۖۥ۟ۘۛ۫ۨۧۙ";
                                            break;
                                        case 589554622:
                                            str11 = "ۡۢۘۘۥ۠ۗۜۢۧۢۡۙۧۤۜۘ۫ۜۘۘ۬۬۟ۚۧۚ۬ۧۜۘۤۥۧۘ۟۟۠۬ۙۗۗۥ۟ۨۚۡۘ";
                                            continue;
                                        case 879889204:
                                            if (!str2.equals("Set<String>")) {
                                                str12 = "ۘ۟ۛۨۦۡۜۥ۫ۘۧۡۙۛ۟۫ۧۖۘۘ۟ۥۘۨۖۖۦ۬ۚۙۢ۟ۜۘۚۦۘ۠ۖۢۢۘۜ۫";
                                                break;
                                            } else {
                                                str12 = "۬ۘۖۡۦۗ۠ۢۜۘۥۡۜ۬۫ۡۘۡ۟ۗۨۖۚۨۙۤ۬۬ۥۚۛ۠";
                                                break;
                                            }
                                        case 1901751819:
                                            str11 = "۟ۥۙۘ۠ۗۥۥ۫ۗۡۧۘۦ۬ۚۘۗ۟ۨۧ۠ۢ۬ۙۤۧۦۤۡۘۖۘ۟۬۟ۢۥۚۚۖۛۦ";
                                            continue;
                                    }
                                }
                                break;
                            case 1611630059:
                                c = 4;
                                break;
                            case 1937498154:
                                str11 = "ۗۥ۠ۤۜۘۜ۫ۦ۫ۖۧۘۡۗۥۡۨۥۘۛۧۡۘۤۥۘۘۡۘۥ۬ۨ۬ۙۙۛ۟ۨۘۘ";
                            case 2032723643:
                                break;
                        }
                    }
                    break;
                case 1729365000:
                    String str13 = "۠ۙۨۘۘۛۜ۟ۤ۟ۗۛۢۡۚۦۘۡۘۖۘۛ۫ۥۘۖۛ۬۠ۨۘۖۨ۠ۦۥۙ۟ۨۛ۬ۡۚۤۧۖۘۡۘۖۖۛۦ۠ۡۜۛۥۘ";
                    while (true) {
                        switch (str13.hashCode() ^ (-19043761)) {
                            case -1402736231:
                                str13 = "ۡۖۘۘ۠ۦۙۤۖۘۚ۠۫ۜۜۦۡۥۧۢۧۘۘ۫ۛۛۚۚۛ۬ۡۨۘ";
                            case -1321008238:
                                String str14 = "ۖۖۡ۫ۖۜۘۘ۟ۥ۠ۘ۟ۨۨۜۘۥۖۘۘۧۘۙۦ۫ۨۦۥۨۢۦۘۘ";
                                while (true) {
                                    switch (str14.hashCode() ^ 33106229) {
                                        case -2066004448:
                                            str14 = "ۨ۠ۨۘ۟ۜۧۘۨۚۡۘ۟ۤۡۚ۬ۘ۟ۦۨۘ۟۬۟ۦۡۗۖۚۤۥۗۨۘۧۙۢ۫ۢ۬ۥۡ۬ۧۖ۟ۨۜۛۖۙ۬ۚۛۖ۟ۡۦ";
                                            break;
                                        case -469634627:
                                            str13 = "ۜۙۥۘۧ۬ۧ۠ۥۘۘۜۢۡ۟ۚۛۦۘۜۖۗۖۦۛۗۤۡۘۗ۫ۘۘۙۦۦۘۧۜ۟";
                                            continue;
                                        case 307161787:
                                            str13 = "ۘۨۜۘۗۜۘۨۘ۠ۖۨۤۚ۫ۨۙۚ۫ۛۦۘۜۘۘۘۗۦ۫۫ۛۘۨ۠ۚۡ۫ۢ۬ۗ۫۠ۜۤۗ۬ۜۧۜۛ";
                                            continue;
                                        case 451288193:
                                            if (!str2.equals("Boolean")) {
                                                str14 = "ۡۗۛۢۢۦ۫ۥۧۘۤۙ۫۬۬ۦۨۖ۠۠ۖ۫ۙ۫۬ۧۦ۟ۘ۟ۗ۠ۚۨۘۙۡۘ۟ۛۥۘۡۖۛۙۚۘۘۡۜۡۘۘۜۘۥ۟ۧ";
                                                break;
                                            } else {
                                                str14 = "ۥۜ۠ۘۧۢۢۦۜۚۘۥۛۨۘۜ۟ۧۡۗ۠ۦۦۢ۟۟ۧۨ۬ۖ";
                                                break;
                                            }
                                    }
                                }
                                break;
                            case -59759781:
                                c = 0;
                                break;
                            case 88782712:
                                break;
                        }
                    }
                    break;
                default:
                    c = 65535;
                    break;
            }
            String str15 = "۫ۛۡۙۦۥۚۡ۠ۘۤۡۘۛ۟۬ۧ۫ۖۘ۫ۛۘ۬ۜۘۙۥۖۚۢۡۘۚۨۜۘ۬ۨ۫ۖۧۡ۬۬ۙۛ۟۟ۨۘ۟";
            while (true) {
                switch (str15.hashCode() ^ (-416863665)) {
                    case -1529152298:
                        return Boolean.valueOf(Boolean.parseBoolean(str));
                    case -326732399:
                        String str16 = "ۨۥ۟ۛۥۢۧۤۖۘ۫ۡۦۢۛ۟۟ۧۙۛۡۘۘۨۨۥۙۜۙ۫ۡۖۘۖۢۖۘ۬ۢۥۘۘۖۚ۟ۦۥۘ۟ۛ۠۠ۚۦۥۡۦۜۛۖۘ";
                        while (true) {
                            switch (str16.hashCode() ^ 1071812046) {
                                case -2060496777:
                                    String str17 = "ۢ۬ۧۛ۬ۙۡۦۛۦۨۘ۫ۥۡۧۚۥۘۡۜۧۚۚ۬ۥۦۜۚۥ";
                                    while (true) {
                                        switch (str17.hashCode() ^ 80140601) {
                                            case -1852340579:
                                                if (c == 1) {
                                                    str17 = "۠ۚ۬ۘۛۛۨۢۦۥ۠ۦۖۚۡۘۢۤۜۛۨۘۙ۟۠۠ۙۧۦۗۨ";
                                                    break;
                                                } else {
                                                    str17 = "ۗۥۜ۫ۗ۫ۙۙۜۘ۫ۖۥۡۚۙ۠۬۠ۤۦۦۗۥۨۙۙۜۘۚۖۥ۬۠ۜۘۛۖۦۘ";
                                                    break;
                                                }
                                            case -1744192534:
                                                str17 = "ۜ۠ۜ۠ۗۚۙۛۡۨۜۘ۟ۚ۟۠ۙۡ۟ۨۥۘۥۨۘۖۙۜۘۗۨۦۘۧ۫ۙۘ۠ۘۜۥۘۥۗ۫";
                                                break;
                                            case 841024043:
                                                str16 = "۬ۨۧۘۧۘۧۘۡۖۘۧ۬۬ۖ۟ۗ۟ۧۦ۠۠ۙۡۗۚۙۧۘ۠۟ۘۘ۟ۨ۫ۦۦۧۘۨۗۛۖۜۡۡۜۚۘۖۘ۠ۘۘۚۘۨ";
                                                continue;
                                            case 1070071573:
                                                str16 = "ۨ۬ۘۤۚۛۙۥۜۘۨۛۗۦۤۘۜۖ۟ۤۜۜۘۜۧۥۨۘۜۘۧۢۡۘۤۙۚۢۧۡۧۤ۟ۡۤۜۨۛۖۘۤۦۢۡۡۧۙۘۡۘ";
                                                continue;
                                        }
                                    }
                                    break;
                                case -1509180864:
                                    str16 = "ۧ۟۟ۥۗۡۘ۠ۨۘ۠۟ۨۘ۠ۢۨۘۙۥۥۡۜۧۘۙۘ۫ۖۤۡۢۘۥۘۡ۠۟ۜ۬ۖۘۖۥ۟ۧۗۙۧۤۤۡۜۗ";
                                    break;
                                case 924576002:
                                    return Integer.valueOf(Integer.parseInt(str));
                                case 1638285090:
                                    String str18 = "ۥۦۛ۠ۗۢ۟ۨۧۘ۫۬ۨۧۛۚ۫۬ۦۖۥۛۖۗۤۤۘۜۧۖ۬";
                                    while (true) {
                                        switch (str18.hashCode() ^ (-80992139)) {
                                            case -1708642597:
                                                str18 = "۫ۥ۠ۥۥۧۡۤۢ۠ۨ۬ۛۧۚۢۧۙۜۨۘۧۨۡۥۜۜۢۦ۫ۧ۬ۛ۫ۨۚۡ۟ۦ۬ۚ۬۬ۦۥۚۦۘ";
                                                break;
                                            case 205112402:
                                                String str19 = "ۤ۠ۜۘ۬ۘۨۨۨۦ۟ۡۘۜۨ۟۟ۗۗ۫ۘۘۧۦۧۘۙۙۗ۟۬ۜۥ۫ۦ۫ۜۧۛۥۚۜ۬ۦۤۚ۬ۚۘ۠ۥۜۡۘ۫ۧ";
                                                while (true) {
                                                    switch (str19.hashCode() ^ (-1960241925)) {
                                                        case 1021807747:
                                                            str18 = "ۨۙۤۤۡ۬ۧۥۡۤۖۘۖۦۢۗۜۥۨۧ۬ۗ۠ۥۖۡۖۘۧ۟۟ۛۤۥ۠۬ۘ";
                                                            continue;
                                                        case 1601944174:
                                                            str19 = "ۗۢۦۘۨۘۥ۫ۖۦۘ۫ۘ۫ۡۜۨۘ۫ۧۙۤ۠ۢ۫ۢۦۦۢۥۢ۠ۗ۠ۡۜۧۢ۬";
                                                            break;
                                                        case 1959319126:
                                                            str18 = "ۧۧ۠ۡۤۢۗۥۗ۫ۜۗۥ۠۫۠ۢۥۥ۬۬ۚۖۚۚۜۨۧۧۜۘ۠ۙۥ۬ۡ۟ۦۦۡۘۙۡۜۘۗۚۘۥۧۚۖۚۙۢۘۖ";
                                                            continue;
                                                        case 2092942078:
                                                            if (c == 2) {
                                                                str19 = "ۚۚۤۛۗۡۢۖۚۖۖۘۧۗۨۘ۬ۖۧۥۢۘۘ۫ۙۘۘۚۜۘۘۘۡۚ۟ۨۜۘۧۛ۠";
                                                                break;
                                                            } else {
                                                                str19 = "۬۫ۘۘ۫۟ۗ۠ۚ۬۬ۢۜۚ۟۟ۖۖۘۢۢۨۘۙ۫ۢۚ۟ۙ۫۬ۡ۫۟۟ۖۖ";
                                                                break;
                                                            }
                                                    }
                                                }
                                                break;
                                            case 316249236:
                                                return Long.valueOf(Long.parseLong(str));
                                            case 932610773:
                                                String str20 = "ۧۢۥۘۢۧۡۘ۬۟ۖ۟۬ۚۗۦۖۘۗ۬ۦ۟ۧۘ۬ۥ۠۬ۡۧۗۗۦۘ۫ۘۡۗۡۧ";
                                                while (true) {
                                                    switch (str20.hashCode() ^ 555755744) {
                                                        case -1500075794:
                                                            String str21 = "۬ۚۖۜ۬ۛۤۚۥۤ۫ۡۘۗۜۤۦۤۜ۬۫ۜۗۜۦۘۜ۟ۚۗۙۚ۟ۗ۬۟ۙۡۘۛ۟ۤۘۛ";
                                                            while (true) {
                                                                switch (str21.hashCode() ^ (-1146474096)) {
                                                                    case -328417126:
                                                                        String str22 = "ۢۧۜۧۚۧۡۚۘۘۡ۠ۧ۟ۗۥۘۗۤۨۘۨ۟ۙۥۤ۠ۗۛۜۘۗۚۨ۠ۜۜۦۙۚ";
                                                                        while (true) {
                                                                            switch (str22.hashCode() ^ 1189833603) {
                                                                                case -2122519116:
                                                                                    str21 = "۫ۧۤۖۜۥۘ۟ۨۥۘۨۗۡۘۥۙۧۖ۫۟ۦۡۙۨ۬ۦۘ۬ۚۡۘۚۘۛ";
                                                                                    continue;
                                                                                case -484191568:
                                                                                    if (c == 4) {
                                                                                        str22 = "ۨۜۥۘۡ۫ۙۖۧۢۡۤۥۘۤۘۥۘ۟ۧۨۘۖۘۖۚۤۘۘۧۛۧۦۤۚۨ۟ۜۘۢۜ۟ۧ۟۬ۧۙۡ";
                                                                                        break;
                                                                                    } else {
                                                                                        str22 = "ۛۛۤۗۛۧۧۦۧۘۡۙۧۚۙۘ۟ۡۘۜۚۖۤۤۦ۠ۥۧۦۘۡۙۥۘۛ۬ۨ";
                                                                                        break;
                                                                                    }
                                                                                case -182473472:
                                                                                    str22 = "ۜۗۛۛۘۛۧۥۢۙۥ۬ۢۙ۫ۦۥ۬ۗۚۧ۬ۧ۬۟ۡۨۨۘۘۘۚۜۥۘۤ۬ۘۘ۫۬ۢ۟۠ۦۘ۬ۖۛۢۗۦۘ";
                                                                                    break;
                                                                                case -46274585:
                                                                                    str21 = "ۜۥۨۘۧۨۡۘ۠۟ۦۦۡۗۦ۟ۢۚۜ۫ۨۢ۫۫۫ۨۘۥۘۗ۠۟ۘۘ۠ۤ۟ۙ۫۠ۨۨۘۘۨۡۧۘ۟۟۫ۢ۫ۙۘ۬ۥۘۘۖۤ";
                                                                                    continue;
                                                                            }
                                                                        }
                                                                        break;
                                                                    case 581329861:
                                                                        String str23 = "ۜۤۤۢ۟ۘۘۢۥۛۗۢۡۦۛۢ۫ۜۘۤۢۨۘۥۜۙۜۢۦۜۡۧۧۗ۬ۢۘۘۘۡۖۜۜۡۜۘ";
                                                                        while (true) {
                                                                            switch (str23.hashCode() ^ (-1619784979)) {
                                                                                case -558948986:
                                                                                    break;
                                                                                case -2121390:
                                                                                    str23 = "۫۫ۘۜ۬ۥۢۨۘۜۚ۫ۧۛۚۘۖۖۢۧۨۘۨۛۥ۫ۨ۬ۜۙۛ";
                                                                                    continue;
                                                                                case 89356239:
                                                                                    String str24 = "۬۬ۘۥ۬ۗۤۥۤۢۖۦۘۗۙۨۘۛۥۧۖۦۗۖۛ۬۟ۦۘۘۚ۠ۦۢۡۘۨ۠۫ۚۘۛ۟۬ۛ";
                                                                                    while (true) {
                                                                                        switch (str24.hashCode() ^ 848222933) {
                                                                                            case -1844272334:
                                                                                                str24 = "ۗۘۘۡۤۤۡۤۤۧۙۨۥۖۘ۫ۚۨۘ۬۟۫ۢ۫ۥۘۧۗۜۛۘ۟ۦ۬ۖ۠ۧۖ";
                                                                                                continue;
                                                                                            case -1101372265:
                                                                                                JSONArray jSONArray = new JSONArray(str);
                                                                                                HashSet hashSet = new HashSet();
                                                                                                int i = 0;
                                                                                                while (true) {
                                                                                                    String str25 = "ۤۨۚۨ۟ۦۘۛ۫ۖۖۛۙۙۜۥۗۡ۠۫ۘۘ۟۬ۨۘ۠ۖۥۘۡۨ۠";
                                                                                                    while (true) {
                                                                                                        switch (str25.hashCode() ^ (-620536870)) {
                                                                                                            case -1208094989:
                                                                                                                str25 = "ۡۨۗۧۗۥۘۢۘۧۘۢۙۥۘۖۧۨۥۖ۫ۥۚۦۘۙۖۢۙۨۘۘۤ۟ۤۜۤۖ۟۫۠ۧۛۤ۠ۡ۫ۚۥ۫ۧۤ";
                                                                                                                break;
                                                                                                            case -825296096:
                                                                                                                break;
                                                                                                            case 247310877:
                                                                                                                return hashSet;
                                                                                                            case 821137363:
                                                                                                                String str26 = "ۥۦۜۢۧۗۛۤۥۘ۫ۨۢۨۖ۬ۨۥۘ۠ۙ۟ۙ۠ۨۖۙۤۡۙۜۙۘ۠ۡۨۘۛۢ۬ۧۢ۟";
                                                                                                                while (true) {
                                                                                                                    switch (str26.hashCode() ^ 1647065119) {
                                                                                                                        case 507128551:
                                                                                                                            str26 = "۠ۜ۫ۗۧۙۥۥۙ۫ۦۙ۠ۘۖۘۧۦۜۘۢۢۧۙۥۚۘۨۘۤ۬ۘ۬ۗ۫ۚۦۡۘ";
                                                                                                                        case 934745831:
                                                                                                                            str25 = "ۘ۟ۙ۠ۤۖۙۘ۫ۢۤۥۦۚۗۜۥۘۥۖۧۘۛۤۖۦۗۨۚۢۚۚۥۘۘۤ۠ۡۦ۟ۡۜۡۧۚ۫ۦۘۦۧۜ";
                                                                                                                            break;
                                                                                                                        case 939208863:
                                                                                                                            str25 = "ۤۦۤ۠ۦۖۧۥۧۧۡۗ۫ۡۨۘ۫ۡۛ۬ۨۥۘۢۚۦۘۨۡۚۧۥۘۘ";
                                                                                                                            break;
                                                                                                                        case 1377056227:
                                                                                                                            str26 = i < jSONArray.length() ? "ۚۧۨ۠ۥۡۙۦۧۘۘۙۙۗۘۙۘۗۙ۠ۨۢۦۧۧۧ۫ۜۘۘۡۨ" : "ۡۢۖۘۨۧۧۚۥۙۛۢۜۘۧۥۧۘۥ۫ۦۗۖۢ۫ۤۡۘۚۜۜۘ۬ۙۡ۬ۜۘۥۨ۟ۡۗۜۘۥۤۥ";
                                                                                                                    }
                                                                                                                }
                                                                                                                break;
                                                                                                        }
                                                                                                    }
                                                                                                    hashSet.add(jSONArray.optString(i));
                                                                                                    i++;
                                                                                                }
                                                                                                break;
                                                                                            case -419215433:
                                                                                                break;
                                                                                            case 1018688031:
                                                                                                String str27 = "ۧۢۖۘ۠ۚۚۦۨۛ۠۠ۘۘۛۨۦۜۧۖۘ۫ۥۡۘۙۘۢ۠۫ۢۢۗ";
                                                                                                while (true) {
                                                                                                    switch (str27.hashCode() ^ 294359424) {
                                                                                                        case -999609935:
                                                                                                            str27 = "ۗ۟ۙۜۤۖۘ۠ۨۜۘ۟۠ۛۙۥۨۘۤۧۛۧۖۙۘۨۨۘ۫ۦۦۘۚ۫۠ۖۘۛۘۜۧۘ";
                                                                                                            break;
                                                                                                        case 514317162:
                                                                                                            if (!str.endsWith("]")) {
                                                                                                                str27 = "ۘۛ۠۟ۜۛۜۛ۟ۚۚۗۡۥ۠۠ۙۡۥۥۥ۠ۛۜۘۤۡ۠ۡۖۤ۫ۛۥۗۥۘ۠۟ۢ۟ۗ۠ۘۨ۫۟ۚۘۘ۠۟ۦۧ۟ۢ";
                                                                                                                break;
                                                                                                            } else {
                                                                                                                str27 = "ۨۚۛۛۤۦۥۙۦۘۢۢۡۘۚۖ۟ۚ۠ۤۛۥۙ۫ۤۨۘۗۗۗۡۥۖۘ";
                                                                                                                break;
                                                                                                            }
                                                                                                        case 716946165:
                                                                                                            str24 = "ۖۥۦۘۛۨۜۦۗۘۘۛۦۦ۠ۢۦۦۤۦ۬ۨۘۥۢۤ۬۫ۡۢۢۨۘ";
                                                                                                            continue;
                                                                                                            continue;
                                                                                                        case 1138539291:
                                                                                                            str24 = "ۗۛۗۗۤۖۧ۫ۙۙ۫۠ۡۦۘۧ۟ۥۘۢۡ۟ۘۡۨ۬۟ۙۢۤۜ";
                                                                                                            continue;
                                                                                                    }
                                                                                                }
                                                                                                break;
                                                                                            default:
                                                                                                continue;
                                                                                        }
                                                                                    }
                                                                                    break;
                                                                                case 1909610678:
                                                                                    String str28 = "ۗ۬ۡۘۥۗۤ۫ۙۛۗ۬۫۫ۖۧۢۨۡۘۡۨ۫۟ۛ۬ۤۢۦۘۚۡۙۘۧۧ۟ۦۚۖۘۡۘۦۖۘۛۛۨۧ۟ۡ";
                                                                                    while (true) {
                                                                                        switch (str28.hashCode() ^ (-1753717679)) {
                                                                                            case -1863343993:
                                                                                                str28 = "ۖۜ۫ۙۡۙۘۤۜۘ۠ۨ۬ۘ۬ۨۘۚۢۦۨ۫ۖۜ۠۬ۙۡ۠ۚۘ۫ۦۙۜ۟";
                                                                                                break;
                                                                                            case -1578225541:
                                                                                                str23 = "ۗۙۡۘۨۨ۬ۚۧۜۘ۠۫ۚۗۖۧۘۢۖ۟ۤۜۛۢۦۡۘۧ۫ۦۘۦۦ۬ۛۦۨۘۤ۫۠ۢۢۧۚ۠ۦۦۦۜۢ۫ۦۘۢۙۢۦۜ۠";
                                                                                                continue;
                                                                                                continue;
                                                                                            case 125202437:
                                                                                                str23 = "ۤۙۡ۫ۘۨۙۛۘۡۧۡۘۖۗۨۘۜۜۖۙۛۦۘۙۥۡۘۢۙۛۡۗۗۗۡۥ۬ۡۡۥ۬۠ۘۥۜۘۙۛ۬ۖۧۥۗۖ۠ۗۙۨ";
                                                                                                continue;
                                                                                            case 1740712184:
                                                                                                if (!str.startsWith("[")) {
                                                                                                    str28 = "ۦۘۛۢ۬ۖۘۡ۬ۚۡ۬ۖۘۖ۫ۤۘۚۡۛ۬ۦۘۦۦۘۜۢۜ۬ۢۢۜۚۦۡ۠ۧ";
                                                                                                    break;
                                                                                                } else {
                                                                                                    str28 = "ۘۡۖۤ۠ۘۘ۠۟ۥۘۙۜۨ۟ۨۗ۟ۥۘۘ۬ۧۘۘۘۤۥۘۖۤۗۡۨۘۘۤۦۦۙ۟ۚ۬ۗۥۖۡ۟";
                                                                                                    break;
                                                                                                }
                                                                                        }
                                                                                    }
                                                                                    break;
                                                                                default:
                                                                                    continue;
                                                                            }
                                                                        }
                                                                        return new HashSet(Arrays.asList(str.split(",")));
                                                                    case 1667849102:
                                                                        str21 = "۟ۛۚۖۖۤۧۥۥۙۤۚۚۜۘ۫۟ۘۘۙۙ۬ۧ۠ۨ۬ۧ۠ۜۘ۠ۘۚۜ۬۬۠ۦۨ۟ۘۗ";
                                                                        break;
                                                                    case 1733297608:
                                                                        return str;
                                                                }
                                                            }
                                                            break;
                                                        case -478411318:
                                                            String str29 = "ۤۢۤۖ۫ۢۙۜۥۘۜۥۛۚ۠ۘۦ۬۠ۜ۠ۡۘۜۧۡۘۥۦۨۘ۠ۤۜۙۙۚۨۢ۬ۨۢۜۥۨ۫ۡۡ۬ۙۜۘ";
                                                            while (true) {
                                                                switch (str29.hashCode() ^ (-1404965391)) {
                                                                    case -1711272731:
                                                                        if (c == 3) {
                                                                            str29 = "ۧۛۘۚۖۧۘۙۖ۠ۚۨۧۘ۬۠۫۠ۜۡۘۜ۟ۥۘۧ۟ۙ۫ۛۚۛۗۡۘۘۚۙۨۡ۠ۨ۟ۦۘۢۖ";
                                                                            break;
                                                                        } else {
                                                                            str29 = "۟۬ۜۚۥۘۘ۫ۥۧۥۥۘۢۚۤ۫ۛۥۘۖۦۚۡ۫ۘۘۛۦۘۘۡ۠ۡۙ۠ۖۦ۠ۜ۬۟ۗۜۥۥۘ";
                                                                            break;
                                                                        }
                                                                    case -1022853751:
                                                                        str20 = "ۥ۠ۦۜۡۧۘۧۥۨۘۡ۟۫ۨۙۦۚ۠۠ۧۡۛۧۛۦۘۨۛۘۗۤ۫ۧۙۢۨۤۖۘ۬ۖۤۜ۬۬";
                                                                        continue;
                                                                    case 126336245:
                                                                        str20 = "ۨ۟۫ۨۡۗۜۦ۠ۥۡ۫ۜۙۤ۬ۡۡۤۤ۟ۜۛ۠۫۫ۡۤ۠ۜۘۗ۫ۜۛۚ۫ۡۗۘۖ";
                                                                        continue;
                                                                    case 1986908913:
                                                                        str29 = "ۨۖۤۧۥۘۙ۫ۨۦۡۥۧ۠۫ۚ۟ۙۛۛۛۗ۫ۖۘ۟ۗۡۘۚۖۖۘ";
                                                                        break;
                                                                }
                                                            }
                                                            break;
                                                        case -33574169:
                                                            str20 = "ۨ۟ۡۘۗۗۨ۫ۚۦۛ۫۠ۗۛۡۡۡۛ۬ۦۚۤۛۘۘۤۜۡۘۙۨۥ۫ۙۘۘ۟ۘۥۘۛۧۡۘ۬ۜۘۘ";
                                                            break;
                                                        case 182613587:
                                                            return Float.valueOf(Float.parseFloat(str));
                                                    }
                                                }
                                                break;
                                        }
                                    }
                                    break;
                            }
                        }
                        break;
                    case 49803226:
                        str15 = "ۢۨۥۡ۠ۗۧۙۜۦۧۗۤۜۡۡۜۘۨۖۤۡۨۜۥۖۖۘۚ۟ۢۤۢۡۘۥ۬ۚۚ۬ۗۢۡۜۘ۬ۨۘۘۖۗۤۜۧ۬ۦۢۨ";
                        break;
                    case 636721757:
                        String str30 = "ۦ۬ۖۥۚۥۢ۟ۘۗۤۨ۟۟ۢۥۦۛ۟ۥۡۢۧۚۧۛ۬ۛۨۙۜۢۖۙۗۖ۟۠۠۬ۢۢۗ۟ۦۚۢۧۡۗۛۜ۠";
                        while (true) {
                            switch (str30.hashCode() ^ 1759833858) {
                                case -1854647985:
                                    if (c == 0) {
                                        str30 = "ۢ۠ۡۘۧ۬ۜۙ۫ۦۘۚۨ۬ۨۦۜۙ۠ۡۦ۠۟ۤۛۚ۟ۦۚۥۙۢۜۚ۠ۜۜ۠ۥۛ۟ۛۖۥۘ";
                                        break;
                                    } else {
                                        str30 = "ۙ۟ۛۢ۠ۗۙۘۚۜۦۘۤۤۜۗ۠ۤۧۦۖۘۚ۟۫ۖ۬ۨۘۙۨۡ";
                                        break;
                                    }
                                case 1088960383:
                                    str30 = "ۜۥۦۘۘ۬۠۫ۥ۫ۖۜ۫ۚۙ۟ۧۤۘ۟ۘ۠۠ۤۘۗۨ۠ۙۨۜۘۛۗۥۘۘۖۜ";
                                    break;
                                case 1303236128:
                                    str15 = "ۨۨۢ۬ۢۥۘۛ۟۟۠ۚۛ۠۫ۨۜۛ۠ۡۖۛۙ۫ۥۘۖ۟ۗ۬ۡۥۦ۟۫۫۟ۤۧ۟ۘۘۗۦۥ۫ۢۜۜۡۖۡ۫ۘۘ۬ۡۨ";
                                    continue;
                                case 1793645038:
                                    str15 = "ۖۥۜۘۨۥۧۘ۫۫ۡۘۥۥ۬ۧۙۖۜۦۘ۬ۗۢۛۨ۟ۚۤۗۡۢۚ۠ۨۨۗۘ۟ۢ۫ۧۙۙ۬";
                                    continue;
                            }
                        }
                        break;
                }
            }
        } catch (Exception e) {
            k2.logToFloatingWindow(h.d("+U0yBFC6AxuqbHd1Y92eUP1aMA5MhMtIvjgucQ==\n", "G9eS6+g1I/w=\n", new StringBuilder(), e), "sp-hook");
            return str;
        }
    }

    public final Object b(Object obj, String str) {
        JSONObject jsonResult = null;
        String strDecrypt = null;
        int i = 0;
        JSONObject jSONObjectOptJSONObject = null;
        JSONArray jSONArrayOptJSONArray = null;
        JSONObject jSONObjectOptJSONObject2 = null;
        Serializable serializableA = null;
        StringBuilder sb = null;
        int i2 = 0;
        int i3 = 0;
        boolean z = false;
        SharedPreferences sharedPreferences = null;
        String string = null;
        Set<String> stringSet = null;
        Integer numValueOf = null;
        Long lValueOf = null;
        Float fValueOf = null;
        Boolean boolValueOf = null;
        Object obj2 = null;
        String str2 = "ۙ۫ۥۘ۟ۙۖۡ۬۫ۗ۫ۡۘۘ۠ۘۧۖ۫ۙۦۥۤ۟ۢ۬ۘۘۡۧۢۛۥۗۧ۫ۤۖۚ۬۫ۥۙۦۘۘ۠ۜۘۘ۬ۥۘۗۦۧۘ";
        while (true) {
            switch ((((str2.hashCode() ^ 3) ^ 734) ^ 492) ^ 75756413) {
                case -2114396002:
                case -2070213617:
                case 367701749:
                case 1421890421:
                case 1425929066:
                    str2 = "ۨۨ۟ۧ۟ۖۖ۫ۛۡۥۧۘۢۢۙ۟۫ۛ۠ۙ۫ۦۘۜۘۢۙ۫ۜ۠ۨۘ۬ۘ۟ۛ۟ۛۖۤۜۡۙۜۖۛۚۖۚۗۜۡۡۘۡ۟ۖ";
                case -2094481143:
                    str2 = "ۚۦۧۘۨ۟۬ۡۥۜۘۥۡۖ۬ۜۨۥۚۘۘۙۘۜۘ۟ۨۛ۫ۦۦۘۗ۠۠ۘ۬ۖ۟ۥۜۘ";
                    obj2 = numValueOf;
                case -2071635347:
                    serializableA = a(jSONObjectOptJSONObject2.optString("value"), jSONObjectOptJSONObject2.optString("type"));
                    str2 = "ۙ۬ۥۘۧۧۚۦۨۡۘۥ۬۬۟ۧ۫ۙ۬ۦۘۥۤۦۘ۟ۥ۟۬۟ۙ۬ۦۡۘۛ۬ۧ۫ۧۛۙۦۗۙۧۧ";
                case -1943956115:
                    sb.append(b);
                    str2 = "ۨۖۨۘ۠۟ۖۜ۬ۤۛۖۡۘۧۚۢۛۢۚۚۢۡۘۢ۬۠ۢ۟ۘۘ۠ۜۘ۠۫ۦۙۨۦۢۗۥۘۧۖۗۙۡۧۨۤۙۜۡۘۧۗ۬";
                case -1864486012:
                    fValueOf = Float.valueOf(sharedPreferences.getFloat(str, ((Float) obj).floatValue()));
                    str2 = "ۚۢ۠ۖ۟ۖۤۚۧۥۨۨۘۤۨۦ۫ۨۥۢۡۨۘۗۜۗۛۙۤۤۙۖۤۖۗۡۤ۠ۗۗۨۛۚۢ";
                case -1768093764:
                    String str3 = "ۜۡۚۧۢۥۘۘۚۢۖۗۤۙۦۘۘۥۘ۬ۢۙ۫ۧ۟۟۟ۤۥۥۛۡۘۥۙۖ۠ۚۦۘ";
                    while (true) {
                        switch (str3.hashCode() ^ 746378261) {
                            case -1035872497:
                                String str4 = "ۧۜۧۢ۠ۘۘۗۨۘۢ۬ۙۖۧۦۖ۬ۧۖۥ۫ۥ۫ۜۚۜۘۘۖۖۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1033810973)) {
                                        case -1289708113:
                                            str4 = "ۛ۬۬ۡۘۦ۟ۦۥۘۤۧ۠ۤۡۘۛۡۨۘ۠ۢ۫ۗۖۡۘۙۜۤۡۗۨۙ۟ۡۛۦۦۘۡۗۢۜۡۘ۠ۖۧۘۡۗ۫ۖ۟ۢۜۙۤ";
                                        case -105137560:
                                            str3 = "ۤۡۨۧۡ۫۬ۛۛۥ۬ۚۛ۠ۜۘ۟ۗۖۧۨۧۢۦۥۘۨۥۡۘۦۡۘۖۡۘۢۗۖ";
                                            break;
                                        case -33382549:
                                            str4 = obj instanceof Boolean ? "ۥۜۜۘۥۤۘۘۙ۠۬ۗۜۘۦ۟ۢۧۥۦۜۨ۟۬ۤۜۘۙۢۦ۫ۧۥۧۡۦۧۛۘ" : "ۚ۬۫ۘۨۡۚۙۡۛ۬ۛۜ۫ۛۜۦ۬ۙۦۧۦ۬ۦ۫ۤۜ۠ۖۤۜۛۘۡۨۤ";
                                        case 422478184:
                                            str3 = "ۨۤۘۘۧۨۨۘۗۦۥۘۜۨۡۘ۟ۤۜۡۥۢۜۖۚۡۨۗۙۧۛ۬ۤۧۦۖۥۧ۟ۘۘۡۨۨۘۜۘۧۘ۟۫ۢۢۤ۠";
                                            break;
                                    }
                                }
                                break;
                            case -744754651:
                                str3 = "ۛۚۥۘۖۥۜۘۘۙۡۘۗۙۜۘۖۜۡۢۗ۟ۛۨۦۧ۬ۦۗۙۦۛۨ۫۬ۚ۫۠۠ۖ";
                            case 1004140923:
                                break;
                            case 1025795432:
                                str2 = "۫ۥۘۘ۟۫۬ۛۥ۟ۢ۠ۧۨ۠ۜۘۤۙۦۢۡۥ۟۫۬۬ۗ۫ۚۗۛۜۜۖ۬ۛۨۘ۫ۚۖۤ۫ۜۘ";
                                break;
                        }
                    }
                    str2 = "ۨۨ۟ۧ۟ۖۖ۫ۛۡۥۧۘۢۢۙ۟۫ۛ۠ۙ۫ۦۘۜۘۢۙ۫ۜ۠ۨۘ۬ۘ۟ۛ۟ۛۖۤۜۡۙۜۖۛۚۖۚۗۜۡۡۘۡ۟ۖ";
                    break;
                case -1669295363:
                    String str5 = "ۡۧۨۤۦۧۙۚ۫۠ۢۘۛ۬۟۠ۙۛۜۙۥۚۤ۠۫ۤۢۢۡۘ۬۠ۢ۬ۛ۫ۖۦ۟۟ۦۘۘ۠ۧۚ۠ۢۙ";
                    while (true) {
                        switch (str5.hashCode() ^ 780828290) {
                            case -1948254551:
                                String str6 = "ۖ۬ۢ۠ۧۚ۟ۦۦۘۦ۫ۦۘۚۨ۠ۧۚۡ۠ۦۖۘۘۨۦۦۤۢ۫ۥۛۦۜۡۖۥ۠ۙۢۥۜۥ۫ۥۨۥ۟ۜۛ";
                                while (true) {
                                    switch (str6.hashCode() ^ (-69081029)) {
                                        case -1821200974:
                                            str5 = "ۥ۬ۦۘ۠ۖۖۡۨۡۘۗ۟ۛ۫ۚۡۨ۠ۛ۠ۚۘۖۖۘۘ۟۟ۙۥۦۖ";
                                            break;
                                        case -1124646475:
                                            str6 = "ۖۧ۫ۤۥۤۡۛۘۘۧۥۜۥۡۡۢ۟ۡۘۧۧۜۘ۬۬ۘۘۢۘۢۧۥۜۘۤۛۚۚۨۨۨۢ۠ۦۜۛۨ۬ۘۖۡۡۚۥۡۖۛۢ";
                                        case -988664965:
                                            str6 = jSONObjectOptJSONObject != null ? "۠ۡۛۥۛۨۘۢۧۨۘ۠ۦۗۗ۫ۚۢۨ۟ۜ۟۫ۜۜ۟ۜۤۦۗۛۖۘۤ۟۬۫ۧۧۡ۠ۥۜ۬۠ۦۤۗۦۘۥ۟ۧۗ۬ۢۗ" : "ۢۚۗۖ۬ۥۛۨۦۥ۠ۘ۬۬ۖۧۦ۬ۥۦۘۖ۠ۜۘۚۥۢۗۙۜۖۜ۫ۧۦۧۘۙۖۡۘۗۙۥۘ";
                                        case 1059260720:
                                            str5 = "ۗۗۙۢۛۦۥۥۤۗ۬ۘۘۦۢۥۧۤۡۢۨۘۚ۟ۙۤۤۗۨۘۥۨۥۡۖۚۛۘۛۤۙ۬ۗۗ۫ۗۨۛ۠";
                                            break;
                                    }
                                }
                                break;
                            case 920142018:
                                str5 = "ۥۛۥۘۡ۟ۜۛۖ۬ۧ۬ۨ۠ۗۦ۠ۨۛۜۢۢۚ۠ۦۘۙۧۖۘۧۡ۬";
                            case 1727668697:
                                break;
                            case 1818768379:
                                str2 = "ۘ۬۟ۚۦۚۤۙۤۥۛ۟ۚۨۢۢ۟ۨۨۥ۫ۥۘۤۛۘۜۥۧۜ";
                                break;
                        }
                    }
                    str2 = "ۖ۫ۤۙۛۖ۬ۡۖۘ۠۟ۚۧۖۨ۬۟۬ۚۚۢۗۜۚ۫ۜۖۘۧۘ";
                    break;
                case -1580612384:
                    k2.logToFloatingWindow(sb.toString(), "sp-get");
                    str2 = "ۙۗۜۘ۠۟ۙ۠ۤۡۧ۠۟ۖۨۘۘۘۧۡ۬ۙۤۚۗۘۥۦۤ۫ۧۡۘۦۧۜۘۧ۟ۜۥۤۚۡ۟ۦۘ";
                case -1578587373:
                    return serializableA;
                case -1489903340:
                    String str7 = "ۧۙۚ۟ۧ۠ۥۚۤ۟۫ۗۘۛۗۛۧۜۢۖۤ۠۠ۘۙۢ۠ۢۤۙۧ۫ۢۦ۟۟۟ۢۦۦۡۘۨۛۡۘۢۧ۠";
                    while (true) {
                        switch (str7.hashCode() ^ (-813118120)) {
                            case -1119534727:
                                str7 = "ۜ۫۬ۜ۬ۜۘۧۜۦۖۜۛۦۛۜۘ۬ۖۖۛۜۜۘۡۚۛ۫ۗۖۘۘۦۘۧۤۙۧۡۤۗۜۧۧۘۡۨۗۘۘۡۥ۠";
                            case -965144332:
                                str2 = "ۖۧۙۤۘۚۖۥۙ۬ۜۡ۠۟ۜۗۙۡۥۦۦۙۤۖۘۥۧ۫۟۟ۙۧ۫ۧۤۥۢۧ۫ۤۖۘۖۘ";
                                break;
                            case 1548394119:
                                String str8 = "ۨۚۨۗ۠ۨۘۦۧۧۘۤۧۘۨۧ۫ۜۖۘۜ۫ۖۘۙۧۚۚۚۗۗۜ۟۟ۚۛۙۚۧۗۡ۫ۤۨۘ۠۬ۡۘۥۖۤۜۛۥۘۧۤۙ";
                                while (true) {
                                    switch (str8.hashCode() ^ 1089245728) {
                                        case -1106173221:
                                            str7 = "۠ۢۖۘۨۧۛۖۧۤۘۖ۠۫ۧۦ۠ۡۚۨۛۙۧۖۚ۟ۖۘ۫ۥۖۘۤۧۜۥۜۜۘۚۥۖۡ۬ۚ";
                                            break;
                                        case -810190987:
                                            str8 = "ۦۡۗۤ۠ۧۛۛۘۥ۬ۥۘ۟ۛ۠۫ۛۡۗۨۦۗۧۡ۬ۧۖۘۚۚۥۙۖۖۚ۫ۘ۬۬۟ۚۛۘۘۡۚۘۥۘ";
                                        case -299803908:
                                            str7 = "ۖۗۥۛۧۖ۫ۙۧۨۧۡ۫ۘ۠ۗۥۨ۬۠ۗ۫ۙۦۚۧ۫ۧۡۘ۠ۖ۠۟ۥۘ۠ۙۗۙۛۛۛۨۨۘۧۛۢۜۧۘ۟۟۫";
                                            break;
                                        case 1620343883:
                                            str8 = jsonResult != null ? "۠ۖۦۘۙۗۜۘۢ۫ۙۥۥۘۧۖۨۥۨۡۨۦۘۘۢ۫ۜۨۛۦ۟ۚۢۖۡۥۗۗۜ۟ۥۡۘۢ۫ۗ" : "ۦۜۤۜۤۡۘۢۡ۟ۤۡۦۥۘۧۘ۬۫ۡۧۘۨۤۙۦ۠ۤ۫ۚۗۛۤۗ۠ۢۚۤۜۢۦۘ۫ۖۜۘۖ۬ۘۘۨۦۨۘ";
                                    }
                                }
                                break;
                            case 2030482838:
                                break;
                        }
                    }
                    break;
                case -1455204033:
                    str2 = "ۧۨۗۚۧۖۨۜ۫ۜۚۦۚۦۜۘ۬۫ۢۙۜۛ۠۬ۦۘۜۤ۬۫ۤۘۢۦۧۘۜۜۙۡۚۙۦۗۗ";
                    obj2 = obj;
                case -1454235243:
                    str2 = "ۛۢۘۘ۟ۗۧۢۤۗۖ۫۫ۥۡ۫ۧۥۗ۬ۤۜۙۤ۫ۘۥۜۡ۫ۖۖۦۙۗ۬ۗۧۖۧۘۤ۠ۦۚۦۖۥۘ";
                case -1387105846:
                    str2 = "ۖ۠ۦۘ۟ۨۘۢۨۥۗۦۦۚۥۨۥ۠۟ۙۢۖۘ۠ۘۘۦۚۗۨ۫ۜ";
                case -1353483364:
                    String str9 = "ۥۖۡۘ۬۫ۡۘۡۗۡۘۤۡۜۖۙۜۘۦۧۨ۬ۦۜۤ۠ۢۛۧۡۘۨۢ۫ۦۖۗۙ۠ۖۦ۟ۨۘۤۧ۫۬ۨۙۤۘۡ۠۠ۥۘۧۧۖ";
                    while (true) {
                        switch (str9.hashCode() ^ 432337248) {
                            case -1837105015:
                                str9 = "ۜۚ۬۟ۤۥۤ۬ۚۖۗۥۜ۠ۧۖۘۥ۫ۦۘۤۧۚۛ۫ۘۘۛۦۜ";
                                break;
                            case -439564878:
                                String str10 = "ۛ۟ۦۘ۬۫۟ۧۢۤۦ۟ۗۡ۬ۛۜۦۨۖۗۙۚ۫ۛ۟ۡۤۙۜ";
                                while (true) {
                                    switch (str10.hashCode() ^ (-1067866516)) {
                                        case -1892649873:
                                            str9 = "۬ۚۖ۬ۤۥۨۨ۫ۗۚۢۛۗۡۤۖۚۖۛۥۡ۟ۚۥۤۖۖۛۙۥۧۖۤ۟۫ۘۜۗۦۘ۟۠ۚۗۜ۬ۥۧ۬ۚ۠ۗ";
                                            break;
                                        case -1840255310:
                                            str10 = "۬ۙ۫ۛۨۧ۫ۥۜ۟ۚۥۚۘۦ۫۬ۥۨۤۤ۬۟ۦۘۘ۫ۘۤۢۙ";
                                        case -1308163173:
                                            str9 = "ۚۖۖۘۧۤۜۛۢۜ۬۫ۗۡۨۡۘۥۢۚۖۛ۟ۤۛۧۤۗۥۘۙۜۖۚۤۥۦۛۜۘۨۧۘۗۛۥ۟۬ۛۤۚۦۘۧۨۜۘۖۖۥۘ";
                                            break;
                                        case -969568950:
                                            str10 = obj instanceof Float ? "ۙۜۙ۬ۧۦۘۚۦۖۧۚۡۖ۠ۥۢۙۨۘۧ۫ۙۖۛۥۘۛۨۛۙۘۖۜۦۧ۬ۗ۫" : "ۢۧۜۘۦۧۜۘۢۚۦۗۖۙ۟ۥۘۙۨۜۜۜۜۙۨۦۘۡۙۡ۬ۗۛۡۨۘۘ۫ۜ";
                                    }
                                }
                                break;
                            case -232624722:
                                str2 = "ۡۨۜۗۤۡۡۤۡۘ۠ۚۙۘۦۘۤۢ۫ۦ۠ۡۘۦۤۥۘۗۗۘۘ۠ۥۧۘۥۢۨۥۤۨۘۗۚۙۜۢۨۘۡۗۛۚ۫ۖ";
                                continue;
                            case 952489731:
                                str2 = "ۧ۠ۨۘۡۦۛۧۡۡۘۦۡۜۘۙ۬ۜۘۘۘۙ۟ۡۘ۟۟ۘۜۚۢ۟ۚ";
                                continue;
                        }
                    }
                    break;
                case -1235193189:
                    sb = new StringBuilder();
                    str2 = "۬ۨۜۨ۠ۥۘۗۘۢۛۜۜۘۛۦۖۘۘۧ۬ۧۘۘۦ۠ۜ۟ۜ۬ۜۖۚ";
                case -1031964033:
                    lValueOf = Long.valueOf(sharedPreferences.getLong(str, ((Long) obj).longValue()));
                    str2 = "ۘۦۗ۟ۤۜۘۧ۬۬ۛۛۖ۠ۥۘۘ۬ۡ۬۠ۙۖۘۖۡۚۨۧۘ۟ۛۛۘۚۜۘۘۗۘۘۛۡ۫ۧ۠۬";
                case -945621754:
                    return obj2;
                case -917214176:
                    str2 = "ۗ۠ۦۘۖۥۦ۟ۛۜۖۚۗۡۨۛۡ۬ۨۜۥۨۤۘ۬۬ۨۘۡۚۤ۬ۦ۫ۙ۫ۢۖۡۘ۠ۙۡۘ۫۠ۨۘۘۘۦ";
                    obj2 = lValueOf;
                case -833231403:
                    String str11 = "ۤۙۛۤۡۖۘۘ۠ۡۘۙ۟ۘۜۢ۬۟ۧۤ۫ۚۘۘ۟۠ۨۘۜۘ۟ۥ۬ۨۦ۬۠ۡۖۢ";
                    while (true) {
                        switch (str11.hashCode() ^ (-1355515883)) {
                            case -1370347907:
                                str2 = "ۧ۫۬ۦ۠ۙۛ۫ۢۜ۬ۖۥۘۛ۠ۘۢ۬ۚ۬۠۫ۡۙۦۢۤ۬۟۫ۜۘۛۤۦۘ";
                                continue;
                            case 367554189:
                                str2 = "ۙۤۖۛۜ۟۟ۦۘۚۥۡۜ۬ۜۘۨ۬ۛۥۚۗ۬۠۟۠ۚ۟ۨۘۘ۠ۘۡ۫ۙۥۘ۬ۤ۟ۧۖۧۗۦۘۡ۠ۚ";
                                continue;
                            case 980525060:
                                str11 = "ۘۖۘۘ۟۬ۗ۫ۤۢۥۢۗۤۡۤۨۚ۫ۢۖۢۖۧۖۘ۫ۚۤۧۢۨۘۗ۠۟ۥۥۡۧۙۤ۠ۥۥۘۨۘۧۡۤۛ۫ۚۜۘۢۖۡۘ";
                                break;
                            case 1557630880:
                                String str12 = "ۧۥ۠۟ۚۦۦ۟ۨ۠۠۬۠ۡ۠ۧۥۦۘۡۖۜۡۤۥۗۘۡۜ";
                                while (true) {
                                    switch (str12.hashCode() ^ 915163305) {
                                        case -1761835031:
                                            str12 = z ? "ۘۚۙ۬ۜۦۡ۠۬ۖۚۘۖۡۙ۠ۤۤۧ۫ۧۦۜۡۜۨۙۢ۫ۜۘۚۚۥۘۖۤ۠ۚۥ۫ۦۜۛ۬ۙۦ۠۠۫" : "ۙ۬ۥۢۛۘ۫ۨۛۡ۫ۜۘۚۜۖۨۙۥۘۢۢۢۚۧۚۨۘۛۙۜۘ";
                                        case -1690263027:
                                            str12 = "ۗۤۢۘۚۘۘۖۘۧۘ۟ۡۧۘۘۢۛۡ۠۬ۜۚۛ۟ۛۙۧۙ۠۫ۦۚ";
                                        case -1686072193:
                                            str11 = "۫ۨۦۦۢ۟ۧۗۖۨۥۙۦۧۘۖ۬۠ۨ۟۬۟ۤۤۤۦۘۤۢۦۘۛۡۚۜۡۤ۟ۢۨۘ۬۫ۖۘ";
                                            break;
                                        case -1581543293:
                                            str11 = "ۤۧۦۤ۬ۦ۟ۢۦۘۜۥۥ۟ۢۡۘۖۨۦۡۚۘ۟ۤۡۘۤ۠۬۬ۨۦۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -727227970:
                    sb.append("->");
                    str2 = "ۤ۠ۛۛۖۦۘۧۘۧۘۚۤۖۘۥۘۨۘ۟۬ۤ۫ۨۘۢۦۥۜۜ۫ۖ۬ۨۥ۫ۨۘۡۤۘ";
                case -470445484:
                    str2 = "ۢۗۙۜۤۨۙ۟ۦۘۨۛۨۡۧۘۥۛ۟ۙۥۤ۫۫ۦ۫ۥۖۘۛ۬ۨۘۘۙۤۤۙۦ";
                case -402057094:
                    sb.append(serializableA);
                    str2 = "۠ۖ۠ۥ۠ۛۜۥۘۧۙۚۚۖ۟ۜ۠ۨۘ۟ۙۥۘ۫۟ۥۘۙۘۥۛ۬ۙ";
                case -378177434:
                    String str13 = "ۦۖۡۘۙۡۥ۬ۜۧۖۦۗۛۜۜۨۤ۬ۦۗۚۨۚۘۡۗۦۘۘۢۧ";
                    while (true) {
                        switch (str13.hashCode() ^ (-2062326140)) {
                            case -618640231:
                                String str14 = "ۡۚۡۤۛۨۘۗۚ۫ۙۛۡۚ۠۬۠ۖۥۚۛۜۥ۠ۨۧ۫ۨۘۨۜ";
                                while (true) {
                                    switch (str14.hashCode() ^ 77271969) {
                                        case -1967476545:
                                            str14 = "۠ۤۡۘۢۘۘۦۖۜۘ۫ۡۘۖۦۢ۠ۨۡۘ۠ۜ۟۬ۤۢۖۥۥۘ۟ۤۡۜۘ۬ۖۨۦ۬ۜۧ۟۠ۥۤ۬ۗۦۛۢ۬ۨۘ۫۬ۦ";
                                        case -1230992216:
                                            str13 = "۫۠ۡۥۡۡۘۜۥۥ۟ۜۘۢ۫ۖۘۤ۬ۘۘۛۢ۬ۛ۬۫ۜۢۜۜ۠ۨۘۤۧۡۜۡۥۚ۟ۚۡۦۥۘۥ۫ۧۚۥۡ";
                                            break;
                                        case -147403928:
                                            str14 = jSONArrayOptJSONArray != null ? "ۘۥۧ۫ۙۖۘ۫ۙۥۜۦ۠۠ۢۜۘۜۡۧۘۡۨۢۗۚ۫ۘۦۥۧۧۖۘۗۤۚۤۧۡۘۢۥۡۚۢ۬" : "۟۟ۥۗۦۡۘۨۛ۬ۦ۫ۚ۬۫ۡۧ۫ۜۘ۫ۦ۫ۨۧۨۗ۬ۤۤ۬ۡۘ۠ۦۘۘۘۖۛۤۘۨۘۚۢۦۘۥ۟ۢ۠ۜۚۛۧۛۤ۠ۡۘ";
                                        case 999840336:
                                            str13 = "ۦۜۧۛۙۜۜۥۘۘۦۜۘۡۜۖۘۧۦ۟ۗۚ۫ۨۨۘ۬ۙۢۙۡۥ۟ۤۘۨ۬ۡۘۘۦۢۗۘۧۘۢۨ۟ۧۜۧۡۧۖ۟ۢ۫";
                                            break;
                                    }
                                }
                                break;
                            case 186418200:
                                str13 = "ۙۧۜۘۗ۫ۥۖۖۥۨ۬ۤۥۛۚ۫ۙۖۛۥۖۘۜ۠ۤۜ۠ۘۘ۬ۜۗۦۧۖۛۖۦۖ۠ۡۘ۬ۛۗۜۧۥۘۛۖۖۗۧۡۘۜۦۦ";
                            case 439010448:
                                str2 = "ۗۤۡۖۘۨۙۗۨۘۜۙۡۘ۫۫ۡۘۚ۠ۖۘۙۙۨۘ۠۟۟ۖۡۛ۟ۖۨۘۥ۟ۗۦۤۙۧۥۨۨۤ۟";
                                break;
                            case 1718426812:
                                break;
                        }
                    }
                    str2 = "ۖ۫ۤۙۛۖ۬ۡۖۘ۠۟ۚۧۖۨ۬۟۬ۚۚۢۗۜۚ۫ۜۖۘۧۘ";
                    break;
                case -352467502:
                    jSONArrayOptJSONArray = jSONObjectOptJSONObject.optJSONArray(b);
                    str2 = "۠ۥۥۘۢ۟ۘۘۢۛۙۙ۬ۗۗۨۧۘۘۖۖۜۚۨۘۢ۫ۦۘۨۛۨۘۙ۠ۦۙۥ۠ۥۚۜۘۨۢ۫۬ۧۚۜۦ۬ۤۚۥ";
                case -311993004:
                    sb.append(str);
                    str2 = "۬ۦۢ۬ۛ۬ۦۙۤۤۛۧۖۖۦۥۧ۠ۖۨ۬۫ۗۗۖۘ۫۟ۤ";
                case -209963427:
                    String str15 = "ۡ۫ۙۤۗۦۘۖ۬ۛۤۜۡۜۡۡۛۘۙۚۜۜۜ۠ۗۗۙۥۤ۫۫";
                    while (true) {
                        switch (str15.hashCode() ^ (-253053707)) {
                            case -1614969378:
                                str15 = "ۜۚۧۢۥۘ۫ۤۛ۠ۚۖۘۗۧۜۘۜۢ۬ۡۥۜۘۤۢۥۨۛۦۘۥۖۡۛ۟ۥۘ۟ۙ۫ۖ۟ۖۘ۬ۙۥ۬ۥۖۘ۟ۡ۫ۖۡۤۢۡۖ";
                            case 131417048:
                                str2 = "ۦۜۘۥۢۦۥۡۜۜ۟ۥۘۚۜۙۥۡۗۧۥ۫۠ۘۨۘۚۢۜۗۤۗۦ۬ۖۘۗۛۦۘۡۧۥۤ۬۠ۨۘۤ۬ۦۜۜۙۡۥۜ";
                                break;
                            case 1009409511:
                                String str16 = "ۦۧۖۘۡۜ۠۬ۢۘۤۢۜۧۘ۬ۛۨۨۛۚۗۧ۠۫۠ۖۘۥۙۨ";
                                while (true) {
                                    switch (str16.hashCode() ^ 611178966) {
                                        case -1457529065:
                                            str15 = "۟۬ۘ۫ۤۘۢۤۥۘۧۖۨۘۦۚ۟۬ۨۘۚۙۜۘۚۗۤ۫ۖۛۥۧۘۘۙۧۡۘۢۡ۫۟ۖ۫ۡۡۦۘ";
                                            break;
                                        case -1137854938:
                                            str15 = "ۤۢۙۤۧۖۘۧۚۢ۠ۙۦۘ۠۟ۚۚ۠ۚۧۢۡۘۜۤۥۘۚۡۧۘۢۧۨ";
                                            break;
                                        case 1572137036:
                                            str16 = "ۡ۬ۥۢۢۦۘۖۤۜۗۘ۬ۘۖۜۘۚ۠۠ۥۦۜۘ۠ۙۘۖۖۥۤ۟ۙۘۡۢ۬ۜۧۘ۫ۖۘۦ۟";
                                        case 2059382236:
                                            str16 = jsonResult.optBoolean(strDecrypt, false) ? "۠ۧۡۦۧۖۥۚۚۙ۠ۘۘۖۖۚۡ۟۬۟ۖۗۗ۫۟۟ۖۨۢۨۘ۠ۙۨ۫ۢۜۘۨۖۘۛۚۖۘ" : "ۨ۫ۤۛۤۦۘ۟۟ۤۙۚۡۘۖ۠ۗۨ۬ۢۚۥۚۘۤۖۘۤۨۙۢۨۖۨۧ۫ۨۦۤ";
                                    }
                                }
                                break;
                            case 1882512459:
                                break;
                        }
                    }
                    str2 = "ۖ۫ۤۙۛۖ۬ۡۖۘ۠۟ۚۧۖۨ۬۟۬ۚۚۢۗۜۚ۫ۜۖۘۧۘ";
                    break;
                case -73879302:
                    z = obj instanceof String;
                    str2 = "ۜۛۖۘ۟۫ۘ۬ۤۗۘۖۘ۟۠۠۬ۛۧۙۥۧۖۦۖۘۚۨۗۛ۬ۡۘۥۘۥ۠ۗۖۘ";
                case -6727597:
                    str2 = "ۨۨ۟ۧ۟ۖۖ۫ۛۡۥۧۘۢۢۙ۟۫ۛ۠ۙ۫ۦۘۜۘۢۙ۫ۜ۠ۨۘ۬ۘ۟ۛ۟ۛۖۤۜۡۙۜۖۛۚۖۚۗۜۡۡۘۡ۟ۖ";
                    obj2 = boolValueOf;
                case 74157924:
                    sharedPreferences = this.a;
                    str2 = "ۧۡ۟ۖۧۨ۟ۢۚۥۚۘ۬ۜۖۘۘۤۡۧۛۘۚ۟ۤ۫ۚۖۜۡۥۘۜۗۜۢ۟ۖۢۖۧۚ۫ۦ";
                case 175972933:
                    sb.append("✅ SP读取拦截：");
                    str2 = "ۜۥ۫ۘۖ۟ۖۨۙۙۡۡۘۧۥۘۚۧ۬۠ۦۦ۟ۦۧۗۥۦۘۧۜۥۘ۠ۚۨۦۧۜ";
                case 390887602:
                    sb.append("，类型：");
                    str2 = "ۘۗۨۘۗۚۚۤۚۤۜۘۢۢۥۚۖۨۤ۠ۤ۬ۗۦۘۨ۫ۨۘۡۧۘۖۨۦۘۦۘۘۚۙۢ۟۬ۨۘ۬ۛۢۖۤ۟۟ۢۗ۫۠ۢ";
                case 464525405:
                    sb.append("，新值：");
                    str2 = "ۨۥۘۘۖۜ۬۬ۤ۫ۦۧۧۛۛ۟ۧۡۤۤۛ۠ۥ۫ۜ۫۟ۥۘۥۤۤۨۦۧۖۦۥ";
                case 596412439:
                    string = sharedPreferences.getString(str, (String) obj);
                    str2 = "ۚۗۖۤۘOۧۥۡۘ۠ۨ۠ۚۙۧۢ۟ۘۘۖۖۥۥۨ۟ۚ۟ۘۗۜ۫ۧۚ۟";
                case 689663826:
                    jSONObjectOptJSONObject = jsonResult.optJSONObject("sp_get");
                    str2 = "ۦۜۢۥ۫۟ۡۨۚۗۙ۟۟ۥۘۖۨۜۘ۠۬ۗۖۖۢۖۤۜۘ۟۟ۗۖ۟۫۬ۦۖۘ";
                case 729667100:
                    boolValueOf = Boolean.valueOf(sharedPreferences.getBoolean(str, ((Boolean) obj).booleanValue()));
                    str2 = "ۙۦۦۜۘۘۘۚۤۨۤۗۨ۬ۗۨۘۧ۫۟۟۫ۦۦۚ۠ۡۥ۬ۧۤۖۘۥۡۥۘۥۢۨۤۨۨۚۜۛۖۨۨۥۡۚۛۦۘۢۜۨۘ";
                case 756001932:
                    String str17 = "ۚۥ۠۠۠ۦۘۡۖۘۚۧۢۢۘ۬ۤ۫۬۫ۜۜۙۧ۫ۢۥۢۘ۟ۖ";
                    while (true) {
                        switch (str17.hashCode() ^ (-574837502)) {
                            case -1382995756:
                                str17 = "۟ۙۨۡۡۧ۠ۡۘۧ۫ۖۢ۫ۘۘ۟ۙ۬ۥ۠ۜۘۧۥ۟ۜۦۨۘۙ۟ۚۛۢۖۘۘۖۥۧۚۘۘۘۖۛ";
                            case -780891222:
                                break;
                            case 1819666899:
                                str2 = "ۗۖۨۘۢۖۚۡۥۗ۬ۛۜۘۚۜۢۧ۫ۗۙۖ۫ۚۥۘۤۗۡۗ۟ۥۜۖۧۘۡۙ۬ۨ۟۟۠۬ۨۘۦ۫۠ۡ۟ۛ۠ۖۜۤۗۡ";
                                break;
                            case 2023172840:
                                String str18 = "ۛۚۤۡۙۧۧۘ۟۟ۙۨۘۦ۟ۤۨۘ۫ۚ۠ۜۘ۬ۖۛۤ۬ۙۨۘ۫ۖۖۦۙۙۜۧۛۦۡ۬ۤ";
                                while (true) {
                                    switch (str18.hashCode() ^ 1039535099) {
                                        case -1733583592:
                                            str18 = "ۛۛۚۘ۬۠ۛۛ۠ۜۦۥۘۦۦۨۘۗۙۗۦ۠ۙ۫ۧ۫ۗ۠ۦۖۛۥۚۧۘۘۙ۠ۜۖۖۖۘ۫ۧۡۘۧ۠ۡۘۨۧۦۨۢۖ";
                                        case -429648285:
                                            str18 = i3 < jSONArrayOptJSONArray.length() ? "ۢ۟ۧۜۤۖۦۜۛۢۜۨۦۖۘ۫ۦۘ۠ۙۨۘۤۛۜۘ۬ۤۖۘ۟۠ۜ" : "ۤۗۢ۫ۜۢۗ۠ۜ۫ۗۛ۬ۙۖۤۜۛ۬ۢۖۨۙۡۘۨۡ۟ۧۜۖۥۚۖۘ۟ۥۚ";
                                        case -127459762:
                                            str17 = "ۢۧۦۘۢۨ۬ۦۘۡۘۦ۫۟ۗۙۜۘ۫ۢۘۘۥۖۧۘۚ۬۬ۢ۫ۖۛۢۧ۟ۙۨۙۛ۫ۘۨۖۜۜۨۙۤ۫ۜۦۜ۬ۤۡۤۘۜۘ";
                                            break;
                                        case 1575145609:
                                            str17 = "ۜۚ۟ۖۨۖۦۤۧ۬۬ۡۧۛۦۖۛۜۖ۫ۘۘۖۥۨۤۘۥۘۡ۬ۨۢۙۢ۟۠ۚۧۚۦۘۚۧۨۘۘۚۥۘۙۥۗۗۢۗ۟ۖۗ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    str2 = "ۖ۫ۤۙۛۖ۬ۡۖۘ۠۟ۚۧۖۨ۬۟۬ۚۚۢۗۜۚ۫ۜۖۘۧۘ";
                    break;
                case 790856075:
                    String str19 = "۬ۧۖۘۤۛ۬۫ۗۤۧۡۧۥۛۘۘۗۧۖۗۘ۫ۖۜۘۗۚۥ۟ۚۤ";
                    while (true) {
                        switch (str19.hashCode() ^ (-1482129799)) {
                            case -1829211478:
                                str2 = "ۛۘۨۘ۬۠ۙ۟ۢۖۘۗ۟ۧ۠ۤۦ۠ۨۤۧ۠ۜۘۨۤۛۘۙۜۘۨ۠ۗۙۧۖۢۗۖۛۧۥۘۢۧۖۘ";
                                continue;
                            case -1482488245:
                                String str20 = "ۤۛۢۡۗۘۘۗ۠ۨۘۨۡۦۨ۟ۦۢۧۙ۟۟ۘ۟ۙۧۧ۠ۤۡۦۘۛۘۦۘ۫ۚۢۚۙ۬ۜۥۨۧۙ۠۟ۗۙ";
                                while (true) {
                                    switch (str20.hashCode() ^ (-1351249714)) {
                                        case -654049481:
                                            str19 = "ۨۚۗۦۘۡ۠ۢۗۖۘۧۨ۟ۗۨۥۘۦۨۖۘۨۖۡۤۧۤ۠ۗۧۚ۫ۨۘ۫۟ۥۨۜۘۨۧ";
                                            break;
                                        case 1447327:
                                            str20 = "ۧۨۦۛۦۡۘۜۡۖۘ۟ۜۗ۟ۥۚۥۢۢۥۜۘۜ۫ۘۘۖ۫ۥۘۨۚۖۥۙۚۛۥ۠";
                                        case 1017373207:
                                            str19 = "ۥۜ۫ۥۥۖ۠۫ۘۘ۬ۧ۠ۚۛۨۦۘۡۡۥۖ۟ۚۖۘۘۚۨۤۙۘۦۧ۬ۦۥ۬ۖۢۤۜۘ";
                                            break;
                                        case 1846532794:
                                            str20 = obj instanceof Long ? "ۜ۬۠ۜۢۗۚۚۤ۟ۢۚۘۨۧۖۘ۟ۛۥۘۗۡۖ۬ۨ۬ۤۧۧ۟ۡۘۡۨۡۘۥۡۥۜۙۥۘ" : "ۛۤۜ۫ۖۤ۫ۦ۠۟ۛۡۘۖۧ۟ۤۦۤ۫۟ۗ۟ۤۚ۬ۘ۬ۛ۬ۥۛۜۘۙۡۡۘ۬ۚۖۘۘ۫۠ۦۜۘۥۘۡۘ";
                                    }
                                }
                                break;
                            case 570978399:
                                str19 = "ۘۖۢۜۜۤۨۘۧۘۦۦ۟ۢ۬۠ۨۦۡۘ۠ۤۥۧۗۦۘۤۚۚۥ۫ۘۘۚۘۚۦۘۥۤۛۢ۟ۥۙ";
                                break;
                            case 1290762661:
                                str2 = "ۛۡۜ۬۫ۡۗۦۖۘ۠ۦۘ۬۟ۤ۠ۤۡۘ۫ۚ۠ۦۙۜۙۥۧۖۢۛۙ۬ۦۘۗۢۥۘ۫ۧ۟ۛۦۘ";
                                continue;
                        }
                    }
                    break;
                case 792930271:
                    str2 = "ۤۗۜۗۦۘۘ۫۟ۥ۟ۦۜۛۗۨۘۛۘۜۘۚۦۛۗۢۡۘۙۦۥۧۘۤۤۚۢۤۦۖۗۧ۫ۦۖۘ";
                case 1018989571:
                    numValueOf = Integer.valueOf(sharedPreferences.getInt(str, ((Integer) obj).intValue()));
                    str2 = "ۘۥ۬ۦۡ۟ۤ۠۠۫ۡۘۦۖۧۘۦۢۛۘ۫ۗۧۤۦۘۙۚۖۚۡۡۘۡۜ۟۟ۦۢ۠ۜۥۘۥۜۖۘۚۛۘۤۡ۟";
                case 1267837095:
                    strDecrypt = "enable_sp_get";
                    str2 = "ۡۨۧۜۘۜۘ۠ۚۗۙ۠ۜۢ۠ۛ۟ۦۦۘ۠ۧۜۘۚۖۢۛۜۦ۟ۨۙۚۘۘۙۚۡ۫ۙۡۜۜۥۘۜۘۘۘۜۡۜۘۢۘۙۧۘۦۘ";
                case 1307059741:
                    str2 = "ۤۗۜۗۦۘۘ۫۟ۥ۟ۦۜۛۗۨۘۛۘۜۘۚۦۛۗۢۡۘۙۦۥۧۘۤۤۚۢۤۦۖۗۧ۫ۦۖۘ";
                    i3 = i;
                case 1371714654:
                    String str21 = "۟ۡ۟ۤۧ۬ۢۥۨ۠۬ۢۡۛۚۢۚۛۤ۠ۖ۠۫ۢ۠ۜ۟۠۠ۜۘۥۦ۫ۡۦۦۛۡ۟ۖۡۖ۫ۛ۫ۙۥ";
                    while (true) {
                        switch (str21.hashCode() ^ 2130503151) {
                            case -2115358684:
                                str2 = "۫۟ۖۘۥۢۨۘۡۖۨۘۗ۠ۚۧ۟ۙۖۘۧۘۛ۟ۨۡۘۚ۫ۖۘۜۡۖۘۦۦۙۘۗۢ۬ۦۨۖۚ";
                                break;
                            case -1416962014:
                                str21 = "ۢ۬ۤ۠۠۠ۧۚۛ۫ۘۜۖۘۨ۬ۡۘۚۥۜۥۧۖۘۤۥ۫ۛۖۥ";
                            case -1279821485:
                                String str22 = "ۜۘ۟۫ۚۘۘۢۥۛ۠ۦۙۚۜۘۚۢۚۡۘۢۧۥۚۚۘۥۘۢۗۨۦ۫ۡۧۢۗۤ۫ۦۘۢۡۗۖۘۘۙۜ۫";
                                while (true) {
                                    switch (str22.hashCode() ^ (-1678935724)) {
                                        case -1853330694:
                                            str21 = "ۢۚۧۤۨۤ۫ۡۜۘۨۢۤ۫۫ۨۘۢ۟ۨۘۨۙۨ۟ۘۨ۫ۥۚۤ۠ۘ";
                                            break;
                                        case -61075582:
                                            str22 = "۟۬ۤۢۛۤۖۧۡ۟ۖۘۘۘۜۡ۟ۜۚۢۢۙۤۨۘۨۖۛ۟ۦۘ۠۟ۦۘۤ۟ۨ۬ۥۗۡۙۗ";
                                        case 915299069:
                                            str22 = jSONObjectOptJSONObject.has(b) ? "ۗۛۚ۫ۡۧۛۛ۠۬ۢ۫ۦۙ۬۠ۚۜۖ۫ۡۘۖۘۙۥۘ۬ۜۙۨۘۨ۫ۗۢۡۘ۬ۢۚۘۛ۬۟ۨ۫ۥۦۡۧۦۘ۬ۥ" : "ۛۖۧۘۨۗۘۘۘۗ۠ۤۖۙۖ۬ۡۖۗۚ۠۫ۨۢۚ۫۟۟ۨۖۦۡۙۨۢۨۗۢ";
                                        case 1783599391:
                                            str21 = "۫ۨۥۢۖۙ۠ۨۙۖۢ۟۟ۛۥ۫ۚۢۗۦۢۦۜۨۜۧۨ۟ۢۥۘۡۘۤۚۨۘ۟ۖۨۚۦۦۘۛ۫۠ۖۘۘ";
                                            break;
                                    }
                                }
                                break;
                            case -721558441:
                                break;
                        }
                    }
                    str2 = "ۖ۫ۤۙۛۖ۬ۡۖۘ۠۟ۚۧۖۨ۬۟۬ۚۚۢۗۜۚ۫ۜۖۘۧۘ";
                    break;
                case 1420515138:
                    String str23 = "ۦۤۢۗۨۜۘ۠ۖۜۘ۬۟ۧۛ۫ۡۘۜۡۦۥۙۤۧۜ۟۠ۨ۫ۢۤۜۘ";
                    while (true) {
                        switch (str23.hashCode() ^ 1509407687) {
                            case -917972135:
                                String str24 = "ۚۗۘ۬ۤۜۘۥۚۡۘۚۦۜۜۨۤۙ۠۫ۤۘۘۖۖۥۘۤۛۦۘۙ۟ۖۘۛۙۥۘۙۗۧ";
                                while (true) {
                                    switch (str24.hashCode() ^ 108534405) {
                                        case -258489411:
                                            str23 = "ۙ۟ۡۘ۫ۡۘۦ۠۟ۙۖۧۘ۬۫ۢۦ۫۬ۙۤۨۖ۫ۗ۬ۤۜۙۛ۫۫ۘۙۦۛۥۧۥۨۘۥ۠ۚۨۜۢۥۜۗۛ۠ۘۢ۠۟";
                                            break;
                                        case -84070236:
                                            str24 = "ۥ۠ۡۘۛۥۧۧۛۛۦۘۚۨۡۜۦۦۡ۫ۧۢۨۜۘۜۡۖۘۜۥۛۤۨۘۧۗۥۘۖ۟۬ۡۨۘۘۡ۠ۨۦۦۜۘۦۜۧۜۤ";
                                        case 719599700:
                                            str24 = obj instanceof Set ? "ۙۜۨۦۥۖۘۧۘ۠ۘ۠ۚۨۥۥۛۧۛۘۜۨۛۥۦۘۢ۫ۖ۟ۡۖۘ" : "۟ۖۘۗۚ۟ۘۧۛۖۧۡ۫۫۫ۜۦۡ۠ۧۚۢ۬ۖۦۙۗۦۤۗۥۡ۬ۨۧۗۘۜۙۙۘۘۙۜۛۦۖۛ";
                                        case 1767765295:
                                            str23 = "ۨۘۥۘۛۖۘۘ۠۬ۖۘۢۛۥ۟ۛۚۢۘۖ۬ۥ۠ۜۥۡ۫ۚۢۡۚۨ";
                                            break;
                                    }
                                }
                                break;
                            case -734034538:
                                str2 = "ۨۜۚۙۗۖۘۡۧ۟۟ۦۘۦۤ۠ۥۦۥۘۖۥۦۘ۠ۤ۟ۦ۟۠ۦۖ۠۬ۡۜۘۘۘۨۖۙۘۘۧۜۦۘۛۖ۠ۢۥۚ";
                                continue;
                            case 496712616:
                                str23 = "ۧ۟ۙۘۙ۫ۚۡۨۘۨۗۚۨۡۖۖۗۘۘۚ۫ۥۘۡ۬۟ۙۛۖ۟۠ۡۢۡۨۘۦۦۧۘۤ۠ۘۡۤۧۛ۬ۜۛۡ";
                                break;
                            case 1384108743:
                                str2 = "۟ۨۥۖۗۘ۫۟ۥۘۙۛۗۘ۠ۖۖۙۜۤۤۨ۬ۙۜۘۘۛۦۘۢۨۧ۟ۧۜۘۧۛۦۘ";
                                continue;
                        }
                    }
                    break;
                case 1438085867:
                    i2 = i3 + 1;
                    str2 = "۟ۢۥۘۜۘۧۘۡۙۧۖ۟۟ۧ۫ۜۘۥۙ۬ۨۗۜۘۨۘۤۖۜۗۘۖۖۥ۟ۗۢۙۤۨۥۘۨۧۤۖۥۢۧۚ۫ۙۙۦۘۙۧۥۘ";
                case 1465866612:
                    sb.append(jSONObjectOptJSONObject2.optString("type"));
                    str2 = "۟ۡۢۨۧۘ۟ۢۙۡ۫ۧۨۨ۬ۡۜ۫ۘۤۜۘۧۜۘ۠۫ۥۘۢۘۗ";
                case 1547896180:
                    String str25 = "ۦۗۗۢۚۘۘ۫۠ۥ۠ۧۧۖۦۖۘۢۜۘۚۢۚۡۧۘ۠ۤ۟ۤۘ۠۠ۜ۟ۗۤ۬ۙۢۨۘ۫ۥ۟";
                    while (true) {
                        switch (str25.hashCode() ^ (-780679752)) {
                            case -2057494734:
                                str25 = "ۦۜۦۘۘ۫ۘۘۚۗۙۙۡۥۖۙۧۦ۠ۗۘۘ۬ۖۧۗۜۗۧۨۥ";
                            case -1274687134:
                                str2 = "ۦۘۜ۟ۡۜۘ۠ۦۥۘۤ۟ۥۦ۫ۤ۟ۚۖۘۖۛۢۗۛۢۙۚۖۦۚۗ";
                                break;
                            case -708080775:
                                String str26 = "ۘۥۡۛ۫ۘ۟ۤۦۧۘۦۘ۟ۗۨۡۘۛۛۜ۟۟ۢۨۘۚۨۦۚ۠ۘۘ۫ۤۙۤۜ۬ۛۦ۠۠ۖۛۚۥۨۚۧۨۤۦۘ۫ۘۨۘ";
                                while (true) {
                                    switch (str26.hashCode() ^ (-1550582875)) {
                                        case -2009923230:
                                            str26 = "ۗۡۥۗۜۦۘۗۧۜۘۡ۠ۡۛ۫۬ۥۚۖۖ۫۫ۚۥۧۘۨۤ۟ۥۙۨ";
                                        case -1814860251:
                                            str26 = jSONObjectOptJSONObject2 != null ? "۬ۨۘۘۜۛۢ۬ۗۜۖ۠ۜۘۗۚۙ۫۫ۧۚ۠ۢۢ۬ۙۦۛ۫ۡۤۛۢۡۨ۠۬ۦ" : "۟۟ۖۘ۬ۤۤۥۗۦۘۚۘۘۘ۫ۥ۫۫ۢۡۗ۠۟ۘۨۛۨ۬ۦۘۜۘۦۘۙۘۘۙۤ۬";
                                        case -275559901:
                                            str25 = "ۨۡ۟ۙۚۧۙ۬ۢۢۤۨۘۙۡۛ۫ۧۧۚۡۙ۬۬ۘ۟ۜ۠ۖۦۖۘۧۖۛۥۦۖ۟ۧ۫۬ۘۥۘۡۡ۠۟ۨۖ";
                                            break;
                                        case 1387269855:
                                            str25 = "ۢۖۤ۟ۧۜ۟ۦۚۧۧۘ۬ۢۥۡۥۛۧۙۖۖ۠۬۟ۡۜۚۙ";
                                            break;
                                    }
                                }
                                break;
                            case 1780873352:
                                break;
                        }
                    }
                    break;
                case 1556422670:
                    String str27 = "ۤۥۜۢۦۖۘۤ۟ۥۘۧۢ۟ۛۘۚ۫ۚۜۡۜ۟ۥۢۥۘۦۤۖ۫۟ۧ۬ۖۘۧۙ۟";
                    while (true) {
                        switch (str27.hashCode() ^ (-1320501362)) {
                            case -1949783388:
                                str27 = "ۥۖۖۡۜ۟ۦۦۤۢۖۜۥ۫ۤ۬۠ۦۘۖ۫ۡۢ۫ۛۖۘ۟ۥۧۘۖ۫ۜۘۖۖۜ";
                            case -1932562745:
                                break;
                            case 555855237:
                                str2 = "ۙۢۙۤۡۡۘۖۗۘۢۤۡ۠۟ۨۘۚ۬ۦۘ۟ۗۧ۠۟۠ۗۙۛۚۡۦۘ";
                                break;
                            case 1916187559:
                                String str28 = "ۗۚ۠ۚۦۨ۫ۥۨۘۘ۟ۙۡۡۛۥۢۘۘۖۘۗۨۤۙ۠ۢۢۥۥۚ";
                                while (true) {
                                    switch (str28.hashCode() ^ (-1112170366)) {
                                        case -2143226656:
                                            str28 = "۫ۙۨۘۢۡۖۦ۟ۜۛ۠ۛۤ۫۠ۤۡۜۦۖۘۦۡۜۘۢۛۘۘۘۙۘۘ";
                                        case -912612594:
                                            str27 = "ۨۜۘۜۛۖۘۙ۫ۧۘۢ۠۠ۦۡۘۨۡۘۦۨ۟۠ۗۨۘۥۙۖ۠ۥۢۥۘۜ۠۬ۡۘ";
                                            break;
                                        case -600567867:
                                            str27 = "ۤ۟ۡۘۙۘۡۘۚۚۧۦۢۥ۫ۧۧۧۤ۟ۧۧۗۚۥۖۨۧۗۦۜۧۘ";
                                            break;
                                        case 951068755:
                                            str28 = str.equals(jSONObjectOptJSONObject2.optString("key")) ? "ۙۛۢۨۢۦۜۧۖۘۢۨ۠ۤۛۚۜۦۘۚۦۦۧۦۜۘۢۦۛۢ۫۬۠ۤۘۘۘۡ" : "ۤۢۧۥۦۗۨۥۦۘ۫ۢ۫۫ۡۖۥۘۨۘۗۜۘۜ۟ۡۖۤۖۡۢۘ۫ۨۢۦ۬ۜۚۚ۟۟ۤۥ۟ۜۦ۬۫۠ۜۘۚ۟ۜۘ";
                                    }
                                }
                                break;
                        }
                    }
                    str2 = "ۢۛۚۘۨۦۙۦۗۡۘۦۘۧۡۧۜۢۢۢ۫۟ۨۤۧۤۤۦۘۚۦۡۜ۬۠ۧۜ۟ۥۥ۬ۨ۬ۜ";
                    break;
                case 1604795055:
                    stringSet = sharedPreferences.getStringSet(str, (Set) obj);
                    str2 = "ۤ۬ۢۥۤۜۘۧۘۘۛۚ۫ۛۛۛۦۛۦۘۥۨۜۗۖۦۘۨۡۗۚۥ۟ۢۦۡۘۤۧۥۘۧ۠ۨۥ۠ۨۘ";
                case 1710608641:
                    jSONObjectOptJSONObject2 = jSONArrayOptJSONArray.optJSONObject(i3);
                    str2 = "ۙ۟ۡۘ۟ۨۜ۫ۢۜۘ۬ۘ۟ۥۙۤۤۛۙۢۚ۠ۚ۟ۢۖۧۚۗۥۘۢۤۘۢۥۧۘ";
                case 1725719024:
                    str2 = "ۥۢۜۘ۟ۛۖۧ۬ۡ۟ۨۘۦۡۡۘۘۛۙۖۤۥۘۡۡۧۨ۬۟ۙۦۙۚۨۘۜ۠۠";
                    obj2 = fValueOf;
                case 1800134738:
                    str2 = "۬ۗۦۖۧۢۛۡۧۘۙۖۘۜ۫ۨۘۤ۟۫ۛۥۗۦۗۖۦۚۢۙ۟ۙۤۤۛۗۛ۫۠۠۫ۗۛۧ۫۠۠ۘۜۤ";
                    obj2 = string;
                case 1936235709:
                    i = 0;
                    str2 = "ۤۘۥ۬ۦۡ۠ۤۜۤ۫۠ۤۚۤۛۙۚ۫۟ۜ۠ۜۚۨۥۘۘۙ۫ۤۖۨۡۜۨۖۧۚۗ۫ۦۡۗۥۘۨۦ";
                case 2010750941:
                    str2 = "ۤۜۨۡ۬ۤ۬ۨۘۘۚۨۘۧۦۖۘۜۘۨۘۘ۬ۥ۫ۛۚۥۢۖۤۖۘ۫۠ۖۘۚۡۚ۬ۛۜۤ۬ۗ۟ۜۥۘ۬ۥۡ";
                    obj2 = stringSet;
                case 2074359748:
                    String str29 = "ۘۚۥۘ۠۟ۧ۟ۢۜۘ۫ۨ۫ۛۘۜۘۢۘۗ۫ۦۚۡۛۖۛۡۛۡ۫";
                    while (true) {
                        switch (str29.hashCode() ^ 1237681843) {
                            case -798439619:
                                str29 = "۬۬ۘ۬۟ۛۘۚۦۧ۠ۘۦۖۘۥۤ۠ۛۚۘۘۘۨ۠ۖۤۗۦۢۜ۠ۥۨۢۚۘۘۖۧۚۚ۟ۗ";
                                break;
                            case -268590555:
                                String str30 = "ۖ۟۠ۛۘۢ۬ۧ۟۬ۘۘۚۧۦۤۥ۬ۤۤۘ۬ۢۚۚ۫ۡۘۘۧۦۚۦ۫ۙۥۘۘۜۙ۟ۘۦۦۘۜۘۘۘۘۛۢۥ۬۫ۜۛۜۘ";
                                while (true) {
                                    switch (str30.hashCode() ^ (-102320537)) {
                                        case -872412298:
                                            str29 = "ۛ۫ۜۘۗ۫ۜۘۨۛۦۢۨۚ۫ۚۘۡۚۦۘۜ۠ۡۖۘ۠ۡۜۘ۬۠ۦۘۢۨۘۨۡۙۚۘۥۦۤۦۘۤۢۖۧۦۧ";
                                            break;
                                        case -194333175:
                                            str30 = obj instanceof Integer ? "ۦۤ۬ۚۛۧۡ۠۬ۖۥۦۘۖۨۢۙۨۨۙۗ۫ۢۗۘۘ۠ۤۙۗۤۗۜۗ۠ۚۡۤ" : "ۥۛۚۙۧۖۨۘۧۘ۠۟ۦۤ۫۟۠ۨۜۘ۠ۤۙۛۥۤ۠ۡۙۜۥۡ۬ۙ۬ۢۦ۟۟ۨۘۜۨۥۘۛۦۜۨۘۧۜۤۙ۟۫ۜ";
                                        case -1653473:
                                            str29 = "ۧۧۚ۬ۤۗۚۥۘۘۘۘۘۘۚۡۖۘۘ۬ۗۤ۬ۙ۫ۧۖۘۚ۫ۜۢ۬ۖۘۗ۫ۗۧ۬ۦ۬ۖۡۘۜۗۨۘۙ۟ۖۥ۠ۥ";
                                            break;
                                        case 54211223:
                                            str30 = "ۧۖۨ۬ۛۢ۠ۨۘۛ۬ۖۘۢ۬ۨۘ۠ۢۡۘ۫ۗۥۘ۟۬۬ۤۥۘۘۗۤۗۚۥۘۘۧۨۘۘ";
                                    }
                                }
                                break;
                            case 1460752485:
                                str2 = "ۨۜ۫ۤ۫۬ۨ۬ۘۙۛۙۦۘۡۢ۫۬ۧۖ۠ۛۦۘ۟ۛۡۡۖ۠";
                                continue;
                            case 1977419635:
                                str2 = "ۧ۫ۦۗۛۥۡ۟ۖۘ۬ۢ۠ۘۧۜۘ۟ۧۘۧ۬ۡۘ۫ۨۗ۬ۡۡۘۧ۬۬ۚۧۥۦ۫ۙۧ۟۫ۨۙۤۚۤۙ۬ۧۦۥۥۘۢۤۚ";
                                continue;
                        }
                    }
                    break;
                case 2127549560:
                    str2 = "ۘ۫ۡۘۡۥ۠۫۟ۡۙۜۜۘۡۨۤ۬ۧۤۘۤ۠ۥۧۨ۬ۜۖ۬ۦ۟ۛۖۘۜۦۦۘۘ۠ۘۧ۫ۥ";
                    i3 = i2;
                case 2134195005:
                    jsonResult = s0.getJsonResult();
                    str2 = "ۡۤ۠۫ۡۘۨۜۘۖۙۜ۟ۧۡۘۙۢۖۘۤۨۡ۟ۦ۬ۧ۬۠ۖۦۡۘۜ۟۠ۛۙۥۘ";
            }
        }
    }

    @Override // android.content.SharedPreferences
    public boolean contains(String str) {
        String str2 = "۟ۦۜۘۚۨۙۖۢۨۘۙ۫ۧ۫ۛۡۘۨۘۧۘۙۢۡۡۧۧ۫ۧۚۦ۫ۦۘۦۖ۫ۥۥۥۘ۟ۖۙۜۘۡۦۡۨۘ۬ۛۛۘ۠ۨۘ۫ۘۦۘ";
        while (true) {
            switch ((((str2.hashCode() ^ 649) ^ 737) ^ 103) ^ (-2010173502)) {
                case 826150679:
                    str2 = "ۚۘۛۡۥۙ۟ۤۤۢ۠ۧۢۚۡۥۜۢۜۥۘۤۙۧۜۡۚۘۙۖۨۗۦۗ۫ۧۢۦۘۘۘۥۧۛۜ۬ۡ۟ۤ";
                    break;
                case 1055393184:
                    return this.a.contains(str);
                case 1815240803:
                    str2 = "ۧ۬۫ۧۧۦۨ۠ۥۦۥۚۙ۬ۧۦۥۘۢ۟ۜۢۡۦۨۡۘۚۙ۬ۦ۫۟ۤۢۜ";
                    break;
            }
        }
    }

    @Override // android.content.SharedPreferences
    public SharedPreferences.Editor edit() {
        String str = "ۥۧۥۘۙۜۙۙۤۦۜۧ۟۬ۡۘ۫ۨۙۙۨۥۘۙۗۦۘۜۗۦۤ۟ۡۘ۟ۥۧۧۚ۟ۧۛ۬۟ۗۤۚۖۥۘۨ۟ۦۘۤۘۛ۫۫ۦۘ";
        while (true) {
            switch ((((str.hashCode() ^ 573) ^ 71) ^ 350) ^ (-1988859486)) {
                case -658481044:
                    str = "۫ۙۖۘۚۜۗۨۢ۟ۢۘۦۧۤۗۢۢۡۘۘۨۧۘۗ۬ۖۘۖۚۦۘ۬ۗۘۜۙۘۘۤۥۜۛۢۦ۟۟ۜۘۛ۟ۛۢ۠۬";
                    break;
                case 66154900:
                    return new a(this.a.edit());
            }
        }
    }

    @Override // android.content.SharedPreferences
    public Map<String, ?> getAll() {
        String str = "ۙۧ۫ۛۥۘۖ۬ۡۢۦۦۥۧۖۨۧۦۘ۠ۛۖۜۢۨۘۡۥ۠ۖۖ۟ۡ۬ۢۘۘۤ";
        while (true) {
            switch ((((str.hashCode() ^ 122) ^ 71) ^ 192) ^ 1500865279) {
                case -423782364:
                    return this.a.getAll();
                case 126945030:
                    str = "ۥۙۦۘۧۙۘۨۢۡۨ۟ۗۛۖۡۘ۬ۧۥۧ۫ۛۡۘۡۖۙ۟ۚۚۛۤ۬ۜۘۥ۟ۡۘ";
                    break;
            }
        }
    }

    @Override // android.content.SharedPreferences
    public boolean getBoolean(String str, boolean z) {
        Object objB = null;
        String str2 = "ۛ۠ۡۘۖۤۢ۠۫ۥۘۨۡۙۨ۟ۖۘۨۨۨۧ۟ۨۘ۫ۘۖۖۜۡۖۡ۠۠ۖۖۚۥۡۘۥۜۘۙۜۥ";
        boolean zBooleanValue = false;
        boolean z2 = false;
        while (true) {
            switch ((((str2.hashCode() ^ 96) ^ 533) ^ 626) ^ (-1303961419)) {
                case -2141820769:
                    str2 = "ۛۖ۟ۖۜۧۖۜۖۧۡۦ۬ۙۨۘ۬ۨ۬ۖۖۤۡۥۨۗۢۦۘ۠ۧۚۖ۠۫ۙۜۨ۠ۡۧۧۤۗۧۜۤ۫۟ۧ";
                    break;
                case -1692193912:
                    objB = b(Boolean.valueOf(z), str);
                    str2 = "ۨۙۥۘۗۘۗ۫ۥ۬ۛۘۘۛۙۡۘۥۨۨۗۘۨۛۨۡۘۡۧۖۜ۟ۧ۫ۤۢ۠ۜۥ۫۟ۛۛۥۘۘۚۡۜۗۨۦۛ۫ۤۤۥۨ";
                    break;
                case -160167619:
                    return z2;
                case 8668392:
                    str2 = "ۢۢۥ۫ۖۨۘۜۚۦۘۛۜۛۘۜۤۘۘۘ۟ۥۗۧ۠ۥۘۢۙۛۡۜۦۘۧۧۡ۟ۨ";
                    z2 = z;
                    break;
                case 78835110:
                    String str3 = "ۛۦ۠ۙ۠ۘۘۘۧ۟۬ۧ۠ۛۥۖۛۡۨۤۢ۠ۡۢۤ۠ۨۘۜ۟ۧۢۚۜ۠ۗ۫ۦۤ۬ۤۡۦۧۢۢ۟ۨ۫ۙ۫ۥۧۙ";
                    while (true) {
                        switch (str3.hashCode() ^ (-1062594366)) {
                            case -544081151:
                                String str4 = "ۛۥۡۘۚۚۥۙۡۥۘۜۥۢۤۗۥۘۡۖۖۧۙۥ۬۬ۦۖ۠ۚۖۘۘۘۥۨۡۛۧۘۘۢ۫۠ۘۨۙ";
                                while (true) {
                                    switch (str4.hashCode() ^ 1170051583) {
                                        case -177535357:
                                            str3 = "ۙۢۧۖۤۜۘۜۦ۬ۨ۫ۖۦۨۥۘۘۛۘۘ۠ۖۤۡ۠۬۠ۨۘۘۤۡۨ";
                                            break;
                                        case -8203128:
                                            str3 = "ۛ۟ۥۗ۫ۥۛ۫ۘۛۗۘ۫ۡۢ۟ۦۖۘۥ۫ۘۙۢۖۘ۬ۘۧۘۡۙۛ";
                                            break;
                                        case 397680353:
                                            str4 = objB instanceof Boolean ? "ۨۢۘۘۤۛ۠۬ۘ۠ۦۧۥۙۘۚۖۜۦۤۗۡۚ۬ۨۘ۠ۨ۟ۨ۫ۡۘۘۛۘۜۘۜۦۖ۠ۜ۬ۘۜ۬۟ۙ۫" : "ۗۨ۠۬ۖۢۥۤ۫ۚ۟ۜۤۦۢۦۨ۫ۜۚۡۜۗۖۚ۫ۨۘۘۗۧۚۚ۟۠ۚۛ۠ۗۖۤۜ۟ۡ۠ۦۘۡۛۘۘۦۦۘۘۚۜۥ";
                                        case 1540227462:
                                            str4 = "ۢۙ۫ۥ۫ۥۗۢۙ۟۠ۜ۫ۨۘۧۢۖۘۜ۬ۦۘۜۡۥ۫ۤۧۘۧۘۖۦۚۙۡۜ۬۠ۖۘۙۙۤ۬ۢ۫ۛۥ۫";
                                    }
                                }
                                break;
                            case -311767432:
                                str3 = "ۜۘۜ۠ۛۜۢۦۡۢۤۡ۠ۥۦۘۢ۬ۨۘۖۧۘۙ۬ۗۧۖ۠ۦۗۖۘۢ۬ۦۡۢۡۦۥۙۘۨ";
                                break;
                            case 368410705:
                                str2 = "۬ۚۛۗ۠ۗۤۢ۟ۗ۬ۨۘۨۙۡۘ۟ۥۦۘۨۡ۬ۢۥۜۜۥۥۘ۠ۤۡۘ۬ۧۥ۟۫ۗۦ۠۫ۧ۠";
                                continue;
                            case 920012849:
                                str2 = "۫ۥۡ۬ۛۧۨۢۡۘۙۧۥۡۦۧۘۖ۟ۜۘ۟۟ۢ۫ۚۜۡۖۥ۟ۥۥۘۙۥۦۢ۫ۧۥۥۡۚ۫ۙۧۖۘۛۤۨ";
                                continue;
                        }
                    }
                    break;
                case 241156999:
                    str2 = "۫ۥۡ۬ۛۧۨۢۡۘۙۧۥۡۦۧۘۖ۟ۜۘ۟۟ۢ۫ۚۜۡۖۥ۟ۥۥۘۙۥۦۢ۫ۧۥۥۡۚ۫ۙۧۖۘۛۤۨ";
                    z2 = zBooleanValue;
                    break;
                case 583120693:
                    zBooleanValue = ((Boolean) objB).booleanValue();
                    str2 = "ۢ۠ۡ۬ۚۘۘۛۙۥۥ۠ۡۘۤۛۡۨۤ۟۟ۧۖۦۤۢۚۧۦۙ۬ۘۘ";
                    break;
                case 1017120074:
                    str2 = "ۛۛ۟۟ۘۥۘ۫ۧۗۛۦۨۘ۟ۡۦۨۖۜۘۤ۠ۗۘۛۚ۟ۙ۫۠ۗ۬ۨۢۢ۫ۘۘۘ";
                    break;
                case 1551099904:
                    str2 = "۫ۖ۠ۤۧۢۨۖۜۙۙۖۖۡۛۢۙۘۘۘۚۧۦۗۙۘۘۢ۫ۤۢۛۡۘۦۘۢۜۚۛۘۨ۫ۦ۬ۙ۠ۜۥۢۧۖۘۗۙ";
                    break;
            }
        }
    }

    @Override // android.content.SharedPreferences
    public float getFloat(String str, float f) {
        Object objB = null;
        String str2 = "ۥۧۢ۬ۢۢ۫ۜۘۤۨۜ۫۠ۦۗۥۗۨۜ۟ۡۖۡۘۗ۬ۜۘ۫ۖۦۜۛۦۥۗۥۘۙۚۡۡۦۘۨۡۧۘ۟۠ۦۘ";
        float fFloatValue = 0.0f;
        float f2 = 0.0f;
        while (true) {
            switch ((((str2.hashCode() ^ 437) ^ 628) ^ 123) ^ 1514350361) {
                case -2082256044:
                    str2 = "ۧۖۦۘۧۙۜۡۨۚۗۤۘۘۛ۠۠ۤۥۛ۟ۢ۫۬ۤ۬۠ۜۦۛۦۧۘۙۥۜ۠ۨۨۘ";
                    f2 = fFloatValue;
                    break;
                case -884710617:
                    return f2;
                case -493821703:
                    str2 = "ۙ۫ۜۘۜۛۖ۟۟۟۫ۗ۬۠۠ۗۦۗۡۘۥۦۦۘۨۢۥۘۙۘۙۙۚۤۚۥۡ۬۠۠ۥۖۡۤ";
                    break;
                case -241579459:
                    objB = b(Float.valueOf(f), str);
                    str2 = "ۛۦ۫ۥۘۦۘۥۡۥۘۨۨۥ۠ۙۚۢ۫ۡ۫ۦۧۡۤۨۥۗۢۘۧ۟۬ۘۘۤۢۜۘ";
                    break;
                case 399068167:
                    String str3 = "ۧۡۤ۬ۦۖۘۖۗ۬ۘۜۥۦ۠۠ۙۘۘۙۘۡۤۗۖ۠ۨۦۘۘۧۢۦ۬ۘۘۢ۫ۛۤۡ۠۬۫ۛۨۥۨۡۛۤ";
                    while (true) {
                        switch (str3.hashCode() ^ 223201155) {
                            case -1802809169:
                                str3 = "ۧۛۘۙۥۘۤۚۗۙ۟ۡ۟ۦۥۦۨۡۚ۠ۡۧۢۥۙۨۢۜۡۢۖ۟ۜۘۚۧۜ۟ۜ۠۫ۢۘۘۡۖ۬ۖۨۥۥۚۤۘۤۙ";
                                break;
                            case -1780552321:
                                str2 = "ۧۖۦۘۧۙۜۡۨۚۗۤۘۘۛ۠۠ۤۥۛ۟ۢ۫۬ۤ۬۠ۜۦۛۦۧۘۙۥۜ۠ۨۨۘ";
                                continue;
                            case 300005765:
                                str2 = "ۖۘۢۧۛۥۖۢۡۚ۫۬ۤۢۦۗ۫ۦ۬۟ۗۥۖۘۘۤۙۘۤۨۘۖۦۥۡۙۧۧۜۜۖۨ۬ۛۤۗۦۛۘ";
                                continue;
                            case 1746534872:
                                String str4 = "ۖۢۛۨۧۘۘۨۤۢۘۜۥۢ۫۟ۗ۠ۙۡۤۦۘۚۧ۬ۜۛۧ۬ۥۧ۠ۜۘۜۥۜ";
                                while (true) {
                                    switch (str4.hashCode() ^ 1880040826) {
                                        case -1867312051:
                                            str3 = "ۖۘۧۜ۬ۘۘ۟ۦۨۘ۠ۤۛۘۢۖۖۤۨۘۗۚۦ۟۟ۜۥۡۥۘۛۨۡۘۦۤۡۘ۠ۖۡ۠ۗۤ۠ۜۖۘۘۗۥۘ۬ۤۦ";
                                            break;
                                        case -1606373763:
                                            str3 = "ۛ۟ۦۘۥۛۘۘ۟ۗۦۘۦۡۜۛ۟۟ۗۢۖۜۨۥ۫۠۟۟ۜۘۗۧ۫";
                                            break;
                                        case -651700002:
                                            str4 = objB instanceof Float ? "۟ۤۙۧۙ۬ۥۨۜۗۤۚۨۨ۬ۡۤ۫ۙۗ۬ۚۧۥۘۨۤۖ۟ۖۡۜۨ۠ۘۤۧ۠ۥۘ۬ۖۘۚۨۧۛۛۘۘ" : "ۥۡۡۘۥۨۧ۫۫۬ۙۤ۠ۢۧۤ۬ۦۛۙۚۖۘ۠ۖۡۨۧۡۨ۟ۢۘ۠ۙۖۘ۬ۤۙۙۨۤۜۨ۟ۥۛۘۘ";
                                        case -398733035:
                                            str4 = "۫۬ۛ۠۫ۡۘ۫ۖ۠ۤۢۜۘ۟ۡۙۘۤۘۧۡۘۘۙۡۘۛ۫۬ۢۗۚ۬ۧۨۗۙ۟";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1413897510:
                    str2 = "ۨ۫ۤ۟ۧۚ۟۫ۡۘ۬ۚۦۢۨۢۚۥۖۘۚۘ۟ۢ۬ۜۘۖۗۖۘۦۛۜ۫ۡۥۘۦۗۥ۫۫ۥ۠";
                    f2 = f;
                    break;
                case 1467281892:
                    fFloatValue = ((Float) objB).floatValue();
                    str2 = "ۗۤۛۗ۫ۖ۬۫ۜۘۙۤۜۘ۠ۘۜۘۥۡۧۖۡۘۜۨ۫ۡۙۛۚۥۜۘ";
                    break;
                case 2002713803:
                    str2 = "ۖۖۢۢ۠ۤ۠ۨ۫۟۟ۥۗۙۗۧۧۚۛۦۘۥ۫ۡۘ۫ۙ۫۬ۦۖ";
                    break;
                case 2144879063:
                    str2 = "ۚۧۘۙۜۛۧ۟ۧۦۢۘۘۧۥۖۛۢۛۗ۟۠ۡ۫ۨ۫ۛۧ۠ۛۡ۬ۧۗ۠ۛۢ";
                    break;
            }
        }
    }

    @Override // android.content.SharedPreferences
    public int getInt(String str, int i) {
        Object objB = null;
        String str2 = "ۨۨۙ۟ۤۤۨ۠ۦۘۥۙ۟ۧۛۚۢ۠ۖ۟ۘۡۘۙۜۧۗۦ۬۬ۧۤ۫ۖۗۜۘۘۘ۬۟ۜۘۜۡۡۘ";
        int iIntValue = 0;
        int i2 = 0;
        while (true) {
            switch ((((str2.hashCode() ^ 167) ^ 869) ^ 51) ^ (-1010565863)) {
                case -1933743670:
                    iIntValue = ((Integer) objB).intValue();
                    str2 = "ۖۡۧ۬ۧۘۘۖۡ۬ۤۡۘۖۥۛۘۘۘ۬ۘۜۗۜۗۦ۫ۦۘۘۥۥۘۖۘۦۤۥۜۘۖۖۗ۬ۨۡۘۖۛۧ۫ۧۥۘۨۧۘۙۧۦۘ";
                    break;
                case -1324262552:
                    str2 = "ۤۥۦۘۗۦۖۘۡ۠ۡۘۖۢۥۘۜ۠ۜۘۨ۫ۢۙۖۥۘ۟ۤۖۛۨۤۖ۠۟";
                    break;
                case -748504910:
                    str2 = "ۡۥۧۘۦۖۡۢۘۗۜۘۧۘۛۨۗۜ۫۬ۦۖۗۡۧۗۘۡۖۢ۬ۦۘۢ۠ۛۢ۟ۖۢ۟ۨ۠ۖ۟";
                    break;
                case 133540940:
                    return i2;
                case 525883121:
                    str2 = "۠۬ۧۨۧۜۘۜ۬ۜۧۖۚ۬ۘۛۧۧۛۢۥ۠۟ۖۜۚۛۘۘۨۧۧۦۖ۠ۥۛۥۦۘۘۚۚۚۖۘۢ۫ۛۙ";
                    break;
                case 1146227492:
                    str2 = "۫ۢۦۘۧۚۗۨ۠ۥۘ۠ۦۡۘۡۙۨۘۦۘۡ۠ۥۖۧۦۘۧۡ۠ۡۨۡ";
                    i2 = i;
                    break;
                case 1297037736:
                    String str3 = "ۚۥۥۜۢۢۛ۬ۡۘۥۗۘ۫۬۟ۖ۬۠ۚۧۜۦۡۖۘۛۡۥۚۢۖۖۗۡۦ۬ۧۨ۠۠ۖۨۦ";
                    while (true) {
                        switch (str3.hashCode() ^ 2095193394) {
                            case -2137310028:
                                str2 = "ۦۧۛ۟۫ۥۜۧۦۙۨۡۘ۫ۜۡۡۡۗۖۨۦۢۡۘۛۗ۬۟ۨۥۗ۠۫۠ۥۛۦۧۘۚ۟ۘۙۡۛ۟ۥۜۘۙۜۖۘۡۨۛ";
                                continue;
                            case -1881677221:
                                str2 = "ۨۢۖۘ۫۫ۖۘۧ۬ۥۘ۟۬ۚۚۗۧۜۚۜ۫ۥۜۘ۫۬ۦۘۥۗۥۛۖۜ";
                                continue;
                            case -1754207042:
                                str3 = "۟۟ۥۙۙۜۜ۫۫ۦۖۡۘ۬ۥۡۖۗۗۨۢۢۤۤۛۖۘۧۘۨۘۙ";
                                break;
                            case 1250241170:
                                String str4 = "ۚۙۧۧۛ۠ۦ۟ۢ۫۟ۨۗۦ۟ۡ۠ۚۘۤۧۨ۠ۤ۬ۨۖۤۖۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1716970369)) {
                                        case 389667994:
                                            str3 = "ۖۡۦۘۦۗۗۦۥۜۘۗۤۥۘۚۧۦۘۧۨۖۥ۬ۘۘۧۛ۠ۗۚۥۘ۟ۦۢ۟۬ۥۘۗۖۗ";
                                            break;
                                        case 803695627:
                                            str4 = "۠ۘ۟ۛۦ۠ۥۚۙۡۤۖۘۗۧۘۘۛۗۚۚۥۜۧۡۡۘ۠۟ۧۚۖۧ۫ۜۡۘۨۤۜۚ۫ۦۘۘۦۘۘ۬ۤ۟۫ۦۧ";
                                        case 816633416:
                                            str4 = objB instanceof Integer ? "ۛۚۙۢۥ۠ۧۛۖۢۡۘۘۗۡۖ۟ۛۨۘۡ۠۟ۖ۫ۖۘ۠۠ۤ۠ۧۨۦۤۛۨۙ" : "ۙ۬ۦ۠ۢۡۥۤۨۦۡۡۚ۠ۧۜۢۘۘۚۢۘ۟ۦۘۚۡ۠۬۫ۘ۫ۜ۫ۧ۟ۦۘ";
                                        case 2040432259:
                                            str3 = "ۤۧۘۘۢۘۜۘۗ۟ۙۢۡۨۦۖۡۥۖ۟ۡۤۨۘۙۜۘۥۙۘۘ۠ۚۡۦۧۡۘۖۧۘۤۨۜۚۖۤۨۥۘۗۚۦ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1688575887:
                    str2 = "ۦۧۛ۟۫ۥۜۧۦۙۨۡۘ۫ۜۡۡۡۗۖۨۦۢۡۘۛۗ۬۟ۨۥۗ۠۫۠ۥۛۦۧۘۚ۟ۘۙۡۛ۟ۥۜۘۙۜۖۘۡۨۛ";
                    i2 = iIntValue;
                    break;
                case 1753791484:
                    objB = b(Integer.valueOf(i), str);
                    str2 = "ۡۗۜ۬ۖۥۘۖ۬ۤۦۦۥۜۡ۟ۤۤۧۖۗۢۡ۫ۜ۟۟۬ۜۡۖۘۡ۫ۥۘۤۜۢۛۨۡۘۡۖ۠۬ۦۢ۠۫ۨۘۢۥۨۘۘۡۖۘ";
                    break;
            }
        }
    }

    @Override // android.content.SharedPreferences
    public long getLong(String str, long j) {
        Object objB = null;
        String str2 = "۠ۡۥ۫۟ۜۘۥۛۡۦۖۖۘ۟ۖۘۘۙ۟ۘۧۚۨۦۨۗۜۧۘۚ۬ۙ۟۟۟ۖۥ";
        long jLongValue = 0;
        long j2 = 0;
        while (true) {
            switch ((((str2.hashCode() ^ 938) ^ 230) ^ 86) ^ 904939114) {
                case -2080840938:
                    jLongValue = ((Long) objB).longValue();
                    str2 = "ۙ۟ۘۘ۠ۙۖۘۦۛۘۘۡۥۙ۫۫ۗ۠۫ۜۘۨۤ۫ۜ۫ۨۘۧۘۜۢۨۙ۟ۤۜۦۖۥۡۚۥۘۡۢۥۘۘۜۨۘ۟ۚۧۢ۠ۢ";
                    break;
                case -1277894373:
                    String str3 = "ۦۜۥۙۘۖۘۨۙۜۜۚۜۘۙۥۘ۬۬ۧۨۘ۟ۢۛۥۘ۟ۗۖۘۗۙۘۚۦۢۢ۫ۦۚۤۧۢۦۖۧۨۘۧۦۖ";
                    while (true) {
                        switch (str3.hashCode() ^ 57091630) {
                            case -1869343569:
                                str2 = "ۙ۫ۙۥۗۢ۠ۖۥۢۥۖۘۘۥۢۖۨۢۘۖۙۢۘۧۘ۠ۡۡۚۨۖۘ";
                                continue;
                            case -604781546:
                                str3 = "ۚۜۥۘۨۥۘ۬۫۫۬۟ۖۘۚۨۡۜ۟ۨۨۢۨۜۚۜۘ۬ۨۜۦۖۥۖۙۥۘۜ۫ۚ";
                                break;
                            case 235207011:
                                String str4 = "۬ۡۘۨۜۖۥۚۤ۫ۥۘۦۖۘ۠ۗۘۗۜۜۜۤۛۛۢ۠۟ۛ۬ۗ۟ۘ۟ۥۦۘۢۗۢۛۧۥۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ 1473985273) {
                                        case -1784854795:
                                            str3 = "ۛۢۚۨۛۧۧۙۙۢۧۨۗ۫ۙۤۡ۟ۗ۠۠ۡۜۘۘ۫ۘۡۡۦۦۦۡۖۚۥ";
                                            break;
                                        case -477610992:
                                            str3 = "ۨۡۦۖۤۖۥ۟ۦۘۘۙ۫ۤۤ۬۠۟ۖۘۡ۠ۨۘۨۛ۫ۜۙ۟ۧ۠ۤۚۗۨۘۢۨۦ۟ۧۨۘۗۧ۫";
                                            break;
                                        case 128612743:
                                            str4 = objB instanceof Long ? "ۤۤۦۘۢۖ۬۟ۢۚۧۖۘۧۚۛۨۥۥۘ۫ۛۧۥۛۘۜۨ۠ۜۗۥ۠۫ۙۘۨۨۘۦ۬۟۬۬ۦۘۡۡۥۘۚۤۧۙۜۡۘۡۡۘ" : "ۚۢۜۘۚۤۜۘ۫۫ۘۜۗۚۨۤۛۨۤ۫ۛۧۙۖۧۡۙۦۚۦۗۨۘ۟ۛۘۘ۟ۘ۫";
                                        case 1617807019:
                                            str4 = "ۙۗۧۗ۟۠ۨۚۗۛ۠ۦ۠ۛۙ۫ۦۘۗۚۨ۠ۘۡۢۖۖۘۤۛۤ";
                                    }
                                }
                                break;
                            case 1756808747:
                                str2 = "ۜۖۙۘۡۘ۬ۛۤۙۨۢۘ۫ۜۘۢ۠ۚۨۙ۠ۘ۟۫ۢۙۜۘ۠۠ۥۡۡ۟ۡۗۜۘۤۦۘۙۗۧ";
                                continue;
                        }
                    }
                    break;
                case -1052613166:
                    str2 = "ۦۘۖۘ۠ۡۖۦۦۦۚۗ۠۟ۡۦۘۖۗۧۖ۟ۜۘۥۚۧۤۤۡۘۢۢۛۗ۬ۡۘ۠ۨۧۘ";
                    break;
                case -704000253:
                    str2 = "ۧ۫ۜۘ۠ۖۜۡۥۧ۫ۙۨۘۚۗۡۘ۠ۜۦۘ۬ۢۧۨ۫ۜۘ۟ۤۢۦ۟ۧۤۛۚۖۗۛ";
                    break;
                case -669809013:
                    objB = b(Long.valueOf(j), str);
                    str2 = "ۖۥۧۘۚۗۖۥۜۡۘۧۜۤۙۜۥۗۡۦ۠ۜۢ۬ۢۖۗ۬ۦ۠ۚ۠۠ۧۡۘۘۦ۫ۘۜ۟ۤۚۙۙۨۥۚ";
                    break;
                case -534206326:
                    str2 = "ۨ۠ۗۖۚۧۨۜۖۘ۠۠۫ۨۦۘۘۖۥۗ۫ۛۥۘۙۜۘۜۦۖۦۜ۠ۚۘۙۙۚۘۜۦۘۘ۟ۦۧۘ۠ۜۤۜۘۧۘ۬ۨۖ۠ۚ۟";
                    j2 = j;
                    break;
                case 141147076:
                    return j2;
                case 512366272:
                    str2 = "ۨۜۥۘ۠۠ۘۡ۬ۚ۟۠ۚۖۦۘ۟ۢۘۘۤۢۥۘۚۡۦۘ۟ۧۤۚۛۨۘ";
                    break;
                case 1346194449:
                    str2 = "ۙ۫ۙۥۗۢ۠ۖۥۢۥۖۘۘۥۢۖۨۢۘۖۙۢۘۧۘ۠ۡۡۚۨۖۘ";
                    j2 = jLongValue;
                    break;
            }
        }
    }

    @Override // android.content.SharedPreferences
    public String getString(String str, String str2) {
        String str3 = "ۦۨۜ۠ۦۚۧۖۧۘۥۡ۠۠۟۫ۧ۟۟ۨ۬۠ۦۦۚ۫ۦۛۖۨۛۥۦۛۡۛۡۘۧۧۚۧۤ۫۬ۖۘ۫ۢۦۘ";
        String str4 = null;
        String str5 = null;
        Object objB = null;
        while (true) {
            switch ((((str3.hashCode() ^ 290) ^ 464) ^ 506) ^ 1621995411) {
                case -1164665176:
                    str3 = "ۤۗۦۘ۫ۛۦۘۘۘۜۘۗ۫۟۫ۚۗ۬ۧ۟ۚ۬۟۬۠ۢۙۡۘۡۘۖۘۨۧۢۖۧۦۙۥۥۛ۟ۙۤۡۨۘ۠۟ۥۚۖۙۡۤۨ";
                    break;
                case -467778009:
                    str3 = "ۗۗ۬۫ۥۧۘۖۡۘ۠ۥۜۘۙۛۥۘۖۧۡ۠ۥۛۘۧۚ۫ۛۢۚۢ۬ۚۘۥۨ۟ۜۘ۠ۙ۫ۘۦۖۘ";
                    break;
                case 18849556:
                    objB = b(str2, str);
                    str3 = "ۢۢۜۖۡۤۛۗۦ۬ۨۥۦۨ۟۠ۘۨۘۚ۬ۖۘۙۘۥۙۥۘۗۖ";
                    break;
                case 151662927:
                    return str5;
                case 1335157124:
                    String str6 = "ۗۢۥ۫۫۟ۙ۠ۨۘۜۙ۫۫ۖ۬ۨۜ۬ۚۛۡۥ۠ۥۤ۫ۦۖۥ۠ۖۦۡۥ۠ۜۘۛۤۚۚۦۜۘ۫ۜۘۧ۫ۛۗ۬ۗۚۖۘ";
                    while (true) {
                        switch (str6.hashCode() ^ (-627561236)) {
                            case -1191220375:
                                str3 = "۫ۡۙۘۖۘۘۡۡۥۘۥ۠ۖۧۗۙ۬ۗۖۘۢ۟ۨۘ۟ۢۦ۬ۥۤۜۤۚۥۗۛۦ۬ۘۙۨۨۘۗۨۖۘۨۨۘۥۜۖ۬ۨ۬ۢۗۙ";
                                continue;
                            case -70520489:
                                str3 = "ۤۙۡۘ۬ۚۥۜۗۜۘ۟ۜۜۛۤۤۛۗۙۨۨۨۘۨۦۙۤۛۦۖۘۙۡۦۨۘ۠۫ۤ۟ۙۧۚۥۜ";
                                continue;
                            case 1450849655:
                                str6 = "ۡۤۨۢۢۢۛۗۙۛۤ۠ۛۚۨۡۛۤۖۖۘۨ۫ۦۘ۟ۥۘۤۚۦۘ";
                                break;
                            case 2041229452:
                                String str7 = "ۢ۠ۢ۠۫ۢ۟ۨۨۘۤۨۢ۠ۢۖۘۢۢۜۢۗ۠۠ۙ۬ۨۙۥۘۨۙۦۘۙۖ۬ۛۥۡۘ";
                                while (true) {
                                    switch (str7.hashCode() ^ (-227366424)) {
                                        case -1769299853:
                                            str7 = objB instanceof String ? "ۡۢۡۘۜ۟ۡۤۥ۠ۖۖۧۖۚ۟ۜۧۘۛۗۨۘۗ۫ۛۜۛۥۧۗ۬ۗۧۨۘۥۙۤ" : "۠۫ۨۘۨ۟ۡۘۚۥۜۘۢۨۥ۫ۧۤۢ۟ۜۘۥۨۢۡۜۨ۫ۚۦۤۙۤ";
                                        case -1322621577:
                                            str7 = "ۘ۬ۙۡۨۦۘۗ۠ۛۨ۠ۧۧۙۨۚۚۦۘۘۦۖۘۤۥۖۤۡۚۧ۬۟ۖ۟ۜۘۖۘۥۘ";
                                        case 1053773136:
                                            str6 = "ۨۜ۟ۙ۟ۚۛۚ۫ۨۛ۫۟ۡۙۦۖۖۡۗ۠۠ۦ۠ۗۤۧ۟۬۟ۨۛۖۧ۟ۗۥ۠۠ۘۨۘۘۖۘۘۙۨ۫ۗۗۖۘۨۘ۠";
                                            break;
                                        case 1742660999:
                                            str6 = "۟ۗۧۘۛۧۖۧۗۘۦۘۘۙۘۜۘۥۙۚۤۜۦۧ۠۠ۢ۬ۧ۠ۥۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1666139179:
                    str3 = "ۤۙۡۘ۬ۚۥۜۗۜۘ۟ۜۜۛۤۤۛۗۙۨۨۨۘۨۦۙۤۛۦۖۘۙۡۦۨۘ۠۫ۤ۟ۙۧۚۥۜ";
                    str5 = str4;
                    break;
                case 1790176729:
                    str3 = "ۚۗۜۘۚۙۥۘۖۡۥ۬۫ۨۘۡۗۘ۠ۦۖ۠ۘ۟۬۟ۖۘۧ۠ۥۦۡۖ";
                    str5 = str2;
                    break;
                case 2058168319:
                    str3 = "۟۟ۙۨ۠۟ۧۖۙۤۛۘ۫۟۬۟ۚۨ۠۬ۨۘ۬۫ۗۦۙۤ۬ۧۨۙ۫ۜۘۖۙۗۧۡۜۘۗ۟ۢ";
                    break;
                case 2060830623:
                    str3 = "ۘۢۖۘۦ۟ۙۡ۠ۖۘۘۜۧۖ۫ۚ۟ۨ۫ۦۗ۫ۖۢۡۘۚۧۦۦۨ۫۫ۚۘ۠ۨۘۨ۫ۗۛ۫۫";
                    str4 = (String) objB;
                    break;
            }
        }
    }

    @Override // android.content.SharedPreferences
    public Set<String> getStringSet(String str, Set<String> set) {
        String str2 = "ۢۤۖۧۜۤۗۛۦۖۥۛۗۢ۫ۜ۬ۤۗۨۘۤۗۢۚۚۨۘۘۡ۟۠۫ۦ۬ۚ۠ۧ۠ۥۘ۫۠ۘۘ۟ۛۧۙۖۜۥ۬ۡۛ۬";
        Set<String> set2 = null;
        Set<String> set3 = null;
        Object objB = null;
        while (true) {
            switch ((((str2.hashCode() ^ 831) ^ 751) ^ 375) ^ (-1757601151)) {
                case -1387476724:
                    objB = b(set, str);
                    str2 = "ۖۢ۫ۨۦۨۚۨۥۥۜۥۘۜۜۗۨ۬ۗ۠ۚۙۖۘۙ۟۠ۨ۬ۦۖۘ";
                    break;
                case -1021620921:
                    str2 = "۬ۙۨۘۗۛۜۘ۫ۖۜۘۤ۠۬۟ۗۜۨۤۙۦۥۘۘۢۙۢۚۛۦۛۖۧۙۗ۟۫ۗ";
                    set3 = set2;
                    break;
                case 136819609:
                    return set3;
                case 273789279:
                    str2 = "ۙۛ۫ۥ۫۠۬۠۟ۤۙۥۘۡۥۤۢۛۤۤۘۥۘۢۤۢۙۨ۟۟ۜۥ";
                    set3 = set;
                    break;
                case 649024128:
                    str2 = "ۙۘۖۘۡۤ۠ۜۨۘۘۛ۠ۛ۫ۘ۫ۛۢۡ۬ۘۚ۟ۜۡۗۖۗۙۖۖ۬۫ۥۨۤۧ۬ۤۜۛ۫ۨۘ";
                    break;
                case 949475367:
                    str2 = "ۥۙۦۘۦۖۦۘۘۗۨ۟ۤۛ۬ۥۦۨ۫ۤۥۥ۬ۨۥۢۧۜ۠۟ۗ";
                    set2 = (Set) objB;
                    break;
                case 971296380:
                    str2 = "ۗۚۢۨ۬ۗۛ۫ۘۘۛۧۦ۫۠ۘ۟ۛۗۡۘۖ۬ۢ۟ۗۨ۟ۨۗۤۚۡ۬ۢ۠۠ۤۙۨۥۤۙ۠ۘۘۙۢۘۘ";
                    break;
                case 1134849282:
                    String str3 = "ۢۨۚۧ۫۬۟۫ۚۦ۠ۛۡۥۜۦۙۗۥۚ۟ۖ۫ۥۘۖ۫ۙۜۥۥۘۖۡۨۘۙ۫ۦۘۙۙۥۙۨۦ";
                    while (true) {
                        switch (str3.hashCode() ^ (-1750962518)) {
                            case -224114950:
                                str3 = "ۡ۬ۢۢ۬۠ۤ۠۠ۢ۫۬ۥۨۗۢۛۨۘۙۨۧۖۖۜۘۨۘ۬ۢۨۘۙ۟ۢ۬ۨ۬ۗ۬۫۬ۦۜ";
                                break;
                            case -18888178:
                                str2 = "۬ۙۨۘۗۛۜۘ۫ۖۜۘۤ۠۬۟ۗۜۨۤۙۦۥۘۘۢۙۢۚۛۦۛۖۧۙۗ۟۫ۗ";
                                continue;
                            case -15574239:
                                str2 = "ۖۛۡۘۡۦۚۡۛۘۘۧۡۨۡۛۜۜۨۦۘۧۛ۬۟۠ۙ۠ۨۘۨۧۤ۫ۢ۟ۛۖۥۘ۫ۥۘ۟ۖۚ";
                                continue;
                            case 1277644248:
                                String str4 = "ۗۜ۫ۦ۬ۘۚ۬ۨۘۢۗۨۗۙۘۧۘۧۚ۫ۢۗۜۦۘۘۦۡۤۖۥۘۤۗۥ۬ۖۦۘۤۙۡۘۘۖۜۢۖۛۡۘۨۙۥۘۨۨ۟";
                                while (true) {
                                    switch (str4.hashCode() ^ 53686486) {
                                        case -639634670:
                                            str3 = "ۚ۫ۢ۟۬ۙۗ۠ۘۘۜۧۖۘۥۜۨۤ۫ۖۘ۟ۗۘۛۜۢۙۦۡۤۙۙۜۘۚۡ۫ۖۘ";
                                            break;
                                        case 792595616:
                                            str4 = objB instanceof Set ? "ۜۥ۟ۢۙۛ۟ۙۢ۫ۡۨۘۜۛ۬ۢۥۧۗۚۢ۟ۦۜۘۦۥ۠ۢۜۧ۬ۦۜۘۚ۫ۢ۠۟ۗۧۨۘۛ۬ۨۘۥۘۜ" : "ۗۥۢۧۨۖۛ۬ۡۢۙۡ۫ۢۤۙۨۜۜۦ۠۬ۦۖۘۗۧۜۘۤۗ۬ۥ۟۠ۥ۠ۗۢ۟ۨۘۤۛۙۜۜۡۘ۫ۢۦۛۙۨ۟ۦ";
                                        case 870709876:
                                            str3 = "۟ۧۙۚۦۜۘۦۙۧ۟ۡۘۚۧ۠ۧ۠ۨۢۗ۬ۡ۠ۦۘ۬ۛۖۘۡ۬ۜۘۖۛۦۢ۠ۚ";
                                            break;
                                        case 1775592051:
                                            str4 = "ۖۨۧۨۦۘ۟ۤۡ۟۬ۨۘ۬ۧۥۘۢۙ۬ۗ۠ۗۗ۬ۜۘۘ۬ۗۥۢۘۘۚۨۨۘ۫ۧۨۘۥۘ۫ۜۧۗ۬ۥۗۛ۟ۜۦ۠ۤۡۥۖۘ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1733084280:
                    str2 = "ۖۤۜۘۛۚ۫ۧۡۘۗ۬ۤۜۨۘۘ۫ۖۘ۟ۛۖ۟ۖۖۘۙۤۢۖۜۜۘۥۛۙۖۤۤۗۧۘۘۥۜۘ";
                    break;
            }
        }
    }

    @Override // android.content.SharedPreferences
    public void registerOnSharedPreferenceChangeListener(SharedPreferences.OnSharedPreferenceChangeListener onSharedPreferenceChangeListener) {
        String str = "ۧ۟ۧۛۛۢ۫ۤ۫ۥ۬ۗۚۦۢۢ۠ۦۤۢۖۥۥۦۤۥۘۦۧۛۤۚۜۘۡ۠ۙۥ۟ۖۦ۬ۥۡۦۘۜۡۤ۟ۨۖ۫ۜۧ";
        while (true) {
            switch ((((str.hashCode() ^ 178) ^ 998) ^ 521) ^ (-1515423009)) {
                case -346918281:
                    return;
                case -86349448:
                    this.a.registerOnSharedPreferenceChangeListener(onSharedPreferenceChangeListener);
                    str = "ۜ۫۟ۛۘ۬۫ۘۘۘۡ۫ۨۘۛۨۦۘۧ۫ۧۡۧۡۨۢۙۥۥۧۘۙۚۘۘۧۙۧ۠ۡۗ";
                    break;
                case 267100238:
                    str = "۟۠ۥ۫ۗۡۘۘۜۥۥۙۤۨ۫۬ۢۡۡۘۨۢ۫ۖۥۦۙۛۜۜۨۥۥۨۨ۠ۥۘۛۢۙۘۤۥۘۘ۠۠ۘ۠۠ۥ۠ۗۢۦۜ";
                    break;
                case 1969396979:
                    str = "ۧ۬ۚۖ۟ۦۘۧۖۖۤۘ۟ۜۘۚۖۦۘۚۛۤۦۙۨۘ۫ۦۙۙۢۙۤ۫ۦ۬ۡ";
                    break;
            }
        }
    }

    @Override // android.content.SharedPreferences
    public void unregisterOnSharedPreferenceChangeListener(SharedPreferences.OnSharedPreferenceChangeListener onSharedPreferenceChangeListener) {
        String str = "ۨۜۛۥۤ۬ۤۜۘ۫ۚۦۘۖۜۧۘۛۛۨۘۥۨۖۖۨۤۨ۫ۡۗۘۘ۠ۨۤۘ۫ۖۧۡۖۘ۠۫ۡۘ۫ۤ۬۠ۢۙۦۧۨ۬ۢۘۘ";
        while (true) {
            switch ((((str.hashCode() ^ 375) ^ 636) ^ 551) ^ 790087533) {
                case -1493165701:
                    str = "۟ۙۚۢۥۛۗۤ۫۫ۧۜۘ۫ۤۙ۟۫ۙۛۖۚۢ۠ۡۢۗۤۖۖۗ۬ۦۘ۬ۚۚۚۜۡۘۖۥۜۦۖۙۡۥ۬ۢۦ۫ۡ۟ۦۘ";
                    break;
                case 1628131720:
                    str = "ۢۛۥۘۢۦ۟ۡۚۤۢ۬۫۬ۖۘ۬ۗۗۧ۟ۖۘۦۤۘۘۙۚۘۦۢۥۘ";
                    break;
                case 1720595626:
                    this.a.unregisterOnSharedPreferenceChangeListener(onSharedPreferenceChangeListener);
                    str = "ۜ۟ۤۛ۟ۛۨۨۧۥ۬۟ۦۖۘۗۨۙۘۦۥۘ۠ۚۥۘ۬ۗۖۘۛۤۤ۟۠ۦۚۧۧ۠۟ۜ۠ۘ";
                    break;
                case 1796642950:
                    return;
            }
        }
    }
}
